[Killed] BlockStatement
src/clocks/durable-clock.ts:17:35
   private readyCallbacks?: [() => void, (reason?: any) => void];
   private assigned?: boolean;
 
-  constructor(clockScope: string) {
-    this.scope = clockScope;
-    this.clockReady = new Promise(async (res, rej) => {
-      // Await for clock.start to be called
-      // This is admitedly a bit of an odd pattern
-      this.readyCallbacks = [res, rej];
-    });
-  }
+  constructor(clockScope: string) {}
 
   async assignToStore(store: TripleStore) {
killedBy: DurableClock creates a fresh clock if no relevant metadata
statusReason: Cannot read properties of undefined (reading '0')

[Timeout] BlockStatement
src/clocks/durable-clock.ts:19:55
 
   constructor(clockScope: string) {
     this.scope = clockScope;
-    this.clockReady = new Promise(async (res, rej) => {
-      // Await for clock.start to be called
-      // This is admitedly a bit of an odd pattern
-      this.readyCallbacks = [res, rej];
-    });
+    this.clockReady = new Promise(async (res, rej) => {});
   }
 

[Timeout] ArrayDeclaration
src/clocks/durable-clock.ts:22:29
     this.clockReady = new Promise(async (res, rej) => {
       // Await for clock.start to be called
       // This is admitedly a bit of an odd pattern
-      this.readyCallbacks = [res, rej];
+      this.readyCallbacks = [];
     });
   }

[Timeout] ConditionalExpression
src/clocks/durable-clock.ts:27:9
   }
 
   async assignToStore(store: TripleStore) {
-    if (this.assigned) return;
+    if (false) return;
     this.assigned = true;
     const [res, rej] = this.readyCallbacks!;

[Timeout] ConditionalExpression
src/clocks/durable-clock.ts:27:9
   }
 
   async assignToStore(store: TripleStore) {
-    if (this.assigned) return;
+    if (true) return;
     this.assigned = true;
     const [res, rej] = this.readyCallbacks!;

[Timeout] BooleanLiteral
src/clocks/durable-clock.ts:28:21
 
   async assignToStore(store: TripleStore) {
     if (this.assigned) return;
-    this.assigned = true;
+    this.assigned = false;
     const [res, rej] = this.readyCallbacks!;
     try {

[Timeout] BlockStatement
src/clocks/durable-clock.ts:30:9
     if (this.assigned) return;
     this.assigned = true;
     const [res, rej] = this.readyCallbacks!;
-    try {
-      this.scopedStore = store.setStorageScope([this.scope]);
-
-      // Initialize in memory clock with current stored clock or create a new one
-      const clockTuples = await this.scopedStore.readMetadataTuples('clock');
-      if (clockTuples.length === 0) {
-        this.clock = [0, nanoid()];
-        await this.scopedStore.updateMetadataTuples([
-          ['clock', ['tick'], this.clock[0]],
-          ['clock', ['clientId'], this.clock[1]],
-        ]);
-      } else {
-        const { clock } = triplesToObject<{
-          clock: { clientId: string; tick: number };
-        }>(clockTuples);
-        this.clock = [clock.tick, clock.clientId];
-      }
-      res();
-    } catch (e) {
+    try {} catch (e) {
       console.error(e);
       return rej(e);

[Killed] StringLiteral
src/clocks/durable-clock.ts:34:69
       this.scopedStore = store.setStorageScope([this.scope]);
 
       // Initialize in memory clock with current stored clock or create a new one
-      const clockTuples = await this.scopedStore.readMetadataTuples('clock');
+      const clockTuples = await this.scopedStore.readMetadataTuples("");
       if (clockTuples.length === 0) {
         this.clock = [0, nanoid()];
killedBy: DurableClock initializes with persisted clock if available
statusReason: expected +0 to be 15 // Object.is equality

[Killed] ConditionalExpression
src/clocks/durable-clock.ts:35:11
 
       // Initialize in memory clock with current stored clock or create a new one
       const clockTuples = await this.scopedStore.readMetadataTuples('clock');
-      if (clockTuples.length === 0) {
+      if (false) {
         this.clock = [0, nanoid()];
         await this.scopedStore.updateMetadataTuples([
killedBy: DurableClock creates a fresh clock if no relevant metadata
statusReason: Cannot read properties of undefined (reading 'tick')

[Killed] EqualityOperator
src/clocks/durable-clock.ts:35:11
 
       // Initialize in memory clock with current stored clock or create a new one
       const clockTuples = await this.scopedStore.readMetadataTuples('clock');
-      if (clockTuples.length === 0) {
+      if (clockTuples.length !== 0) {
         this.clock = [0, nanoid()];
         await this.scopedStore.updateMetadataTuples([
killedBy: DurableClock creates a fresh clock if no relevant metadata
statusReason: Cannot read properties of undefined (reading 'tick')

[Killed] ArrayDeclaration
src/clocks/durable-clock.ts:36:22
       // Initialize in memory clock with current stored clock or create a new one
       const clockTuples = await this.scopedStore.readMetadataTuples('clock');
       if (clockTuples.length === 0) {
-        this.clock = [0, nanoid()];
+        this.clock = [];
         await this.scopedStore.updateMetadataTuples([
           ['clock', ['tick'], this.clock[0]],
killedBy: DurableClock creates a fresh clock if no relevant metadata
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArrayDeclaration
src/clocks/durable-clock.ts:38:11
       if (clockTuples.length === 0) {
         this.clock = [0, nanoid()];
         await this.scopedStore.updateMetadataTuples([
-          ['clock', ['tick'], this.clock[0]],
+          [],
           ['clock', ['clientId'], this.clock[1]],
         ]);
killedBy: DurableClock creates a fresh clock if no relevant metadata
statusReason: attribute is not iterable

[Survived] StringLiteral
src/clocks/durable-clock.ts:38:12
       if (clockTuples.length === 0) {
         this.clock = [0, nanoid()];
         await this.scopedStore.updateMetadataTuples([
-          ['clock', ['tick'], this.clock[0]],
+          ["", ['tick'], this.clock[0]],
           ['clock', ['clientId'], this.clock[1]],
         ]);

[Killed] ArrayDeclaration
src/clocks/durable-clock.ts:39:11
         this.clock = [0, nanoid()];
         await this.scopedStore.updateMetadataTuples([
           ['clock', ['tick'], this.clock[0]],
-          ['clock', ['clientId'], this.clock[1]],
+          [],
         ]);
       } else {
killedBy: DurableClock creates a fresh clock if no relevant metadata
statusReason: attribute is not iterable

[Survived] StringLiteral
src/clocks/durable-clock.ts:39:22
         this.clock = [0, nanoid()];
         await this.scopedStore.updateMetadataTuples([
           ['clock', ['tick'], this.clock[0]],
-          ['clock', ['clientId'], this.clock[1]],
+          ['clock', [""], this.clock[1]],
         ]);
       } else {

[Killed] BlockStatement
src/clocks/durable-clock.ts:41:14
           ['clock', ['tick'], this.clock[0]],
           ['clock', ['clientId'], this.clock[1]],
         ]);
-      } else {
-        const { clock } = triplesToObject<{
-          clock: { clientId: string; tick: number };
-        }>(clockTuples);
-        this.clock = [clock.tick, clock.clientId];
-      }
+      } else {}
       res();
     } catch (e) {
killedBy: DurableClock initializes with persisted clock if available
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArrayDeclaration
src/clocks/durable-clock.ts:45:22
         const { clock } = triplesToObject<{
           clock: { clientId: string; tick: number };
         }>(clockTuples);
-        this.clock = [clock.tick, clock.clientId];
+        this.clock = [];
       }
       res();
killedBy: DurableClock initializes with persisted clock if available
statusReason: expected undefined to be 15 // Object.is equality

[NoCoverage] BlockStatement
src/clocks/durable-clock.ts:48:17
         this.clock = [clock.tick, clock.clientId];
       }
       res();
-    } catch (e) {
-      console.error(e);
-      return rej(e);
-    }
+    } catch (e) {}
 
     // Listen on all storages for new timestamps

[Killed] BlockStatement
src/clocks/durable-clock.ts:54:39
     }
 
     // Listen on all storages for new timestamps
-    store.onInsert(async (triples) => {
-      const maxTimestamp = triples.reduce<Timestamp | undefined>(
-        (max, triple) =>
-          timestampCompare(triple.timestamp, max) > 0 ? triple.timestamp : max,
-        undefined
-      );
-      await this.clockReady;
-      if (timestampCompare(maxTimestamp, this.clock) > 0) {
-        this.clock = [maxTimestamp![0], this.clock![1]];
-        this.scopedStore!.updateMetadataTuples([
-          ['clock', ['tick'], this.clock![0]],
-          ['clock', ['clientId'], this.clock![1]],
-        ]);
-      }
-    });
+    store.onInsert(async (triples) => {});
   }
 
killedBy: DurableClock can read new timestamps from the store and update the clock
statusReason: expected +0 to be 16 // Object.is equality

[Killed] ArrowFunction
src/clocks/durable-clock.ts:56:9
     // Listen on all storages for new timestamps
     store.onInsert(async (triples) => {
       const maxTimestamp = triples.reduce<Timestamp | undefined>(
-        (max, triple) =>
-          timestampCompare(triple.timestamp, max) > 0 ? triple.timestamp : max,
+        () => undefined,
         undefined
       );
killedBy: DurableClock can read new timestamps from the store and update the clock
statusReason: expected +0 to be 16 // Object.is equality

[Killed] ConditionalExpression
src/clocks/durable-clock.ts:57:11
     store.onInsert(async (triples) => {
       const maxTimestamp = triples.reduce<Timestamp | undefined>(
         (max, triple) =>
-          timestampCompare(triple.timestamp, max) > 0 ? triple.timestamp : max,
+          false ? triple.timestamp : max,
         undefined
       );
killedBy: DurableClock can read new timestamps from the store and update the clock
statusReason: expected +0 to be 16 // Object.is equality

[Killed] EqualityOperator
src/clocks/durable-clock.ts:57:11
     store.onInsert(async (triples) => {
       const maxTimestamp = triples.reduce<Timestamp | undefined>(
         (max, triple) =>
-          timestampCompare(triple.timestamp, max) > 0 ? triple.timestamp : max,
+          timestampCompare(triple.timestamp, max) <= 0 ? triple.timestamp : max,
         undefined
       );
killedBy: DurableClock can read new timestamps from the store and update the clock
statusReason: expected +0 to be 16 // Object.is equality

[Killed] EqualityOperator
src/clocks/durable-clock.ts:61:11
         undefined
       );
       await this.clockReady;
-      if (timestampCompare(maxTimestamp, this.clock) > 0) {
+      if (timestampCompare(maxTimestamp, this.clock) <= 0) {
         this.clock = [maxTimestamp![0], this.clock![1]];
         this.scopedStore!.updateMetadataTuples([
killedBy: DurableClock can read new timestamps from the store and update the clock
statusReason: expected +0 to be 16 // Object.is equality

[Killed] ConditionalExpression
src/clocks/durable-clock.ts:61:11
         undefined
       );
       await this.clockReady;
-      if (timestampCompare(maxTimestamp, this.clock) > 0) {
+      if (false) {
         this.clock = [maxTimestamp![0], this.clock![1]];
         this.scopedStore!.updateMetadataTuples([
killedBy: DurableClock can read new timestamps from the store and update the clock
statusReason: expected +0 to be 16 // Object.is equality

[Survived] StringLiteral
src/clocks/durable-clock.ts:64:22
       if (timestampCompare(maxTimestamp, this.clock) > 0) {
         this.clock = [maxTimestamp![0], this.clock![1]];
         this.scopedStore!.updateMetadataTuples([
-          ['clock', ['tick'], this.clock![0]],
+          ['clock', [""], this.clock![0]],
           ['clock', ['clientId'], this.clock![1]],
         ]);

[Survived] ArrayDeclaration
src/clocks/durable-clock.ts:65:21
         this.clock = [maxTimestamp![0], this.clock![1]];
         this.scopedStore!.updateMetadataTuples([
           ['clock', ['tick'], this.clock![0]],
-          ['clock', ['clientId'], this.clock![1]],
+          ['clock', [], this.clock![1]],
         ]);
       }

[Killed] BlockStatement
src/clocks/durable-clock.ts:71:31
     });
   }
 
-  async getCurrentTimestamp() {
-    await this.clockReady;
-    return this.clock!;
-  }
+  async getCurrentTimestamp() {}
 
   async getNextTimestamp() {
killedBy: DurableClock creates a fresh clock if no relevant metadata
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/clocks/durable-clock.ts:76:28
     return this.clock!;
   }
 
-  async getNextTimestamp() {
-    const [tick, clientId] = await this.getCurrentTimestamp();
-    const nextTimestamp = [tick + 1, clientId] as Timestamp;
-    return nextTimestamp;
-  }
+  async getNextTimestamp() {}
 
   async setTick(tick: number) {
killedBy: DurableClock can get the next timestamp
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/clocks/durable-clock.ts:82:31
     return nextTimestamp;
   }
 
-  async setTick(tick: number) {
-    await this.clockReady;
-    this.clock = [tick, this.clock![1]];
-    this.scopedStore!.updateMetadataTuples([['clock', ['tick'], tick]]);
-  }
+  async setTick(tick: number) {}
 }
 
killedBy: DurableClock can set the clock
statusReason: expected +0 to be 15 // Object.is equality

[Killed] ArrayDeclaration
src/clocks/durable-clock.ts:84:18
 
   async setTick(tick: number) {
     await this.clockReady;
-    this.clock = [tick, this.clock![1]];
+    this.clock = [];
     this.scopedStore!.updateMetadataTuples([['clock', ['tick'], tick]]);
   }
killedBy: DurableClock can set the clock
statusReason: expected undefined to be 15 // Object.is equality

[Survived] ArrayDeclaration
src/clocks/durable-clock.ts:85:55
   async setTick(tick: number) {
     await this.clockReady;
     this.clock = [tick, this.clock![1]];
-    this.scopedStore!.updateMetadataTuples([['clock', ['tick'], tick]]);
+    this.scopedStore!.updateMetadataTuples([['clock', [], tick]]);
   }
 }

[Survived] ArrayDeclaration
src/clocks/durable-clock.ts:85:44
   async setTick(tick: number) {
     await this.clockReady;
     this.clock = [tick, this.clock![1]];
-    this.scopedStore!.updateMetadataTuples([['clock', ['tick'], tick]]);
+    this.scopedStore!.updateMetadataTuples([]);
   }
 }
