[Killed] BlockStatement
src/collection-query.ts:24:58
 
 export default function CollectionQueryBuilder<
   M extends Model<any> | undefined
->(collectionName: string, schema?: M, params?: Query<M>) {
-  // TODO fixup ts so that select/where are actually optional
-  return Builder<CollectionQuery<M>>({
-    collectionName,
-    schema,
-    ...params,
-    where: params?.where ?? [],
-    select: params?.select ?? [],
-  });
-}
+>(collectionName: string, schema?: M, params?: Query<M>) {}
 
 export type CollectionQuery<M extends Model<any> | undefined> = Query<M> & {
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'where')

[Killed] OptionalChaining
src/collection-query.ts:30:12
     collectionName,
     schema,
     ...params,
-    where: params?.where ?? [],
+    where: params.where ?? [],
     select: params?.select ?? [],
   });
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'where')

[Killed] LogicalOperator
src/collection-query.ts:30:12
     collectionName,
     schema,
     ...params,
-    where: params?.where ?? [],
+    where: params?.where && [],
     select: params?.select ?? [],
   });
killedBy: Database API supports basic queries without filters
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] OptionalChaining
src/collection-query.ts:31:13
     schema,
     ...params,
     where: params?.where ?? [],
-    select: params?.select ?? [],
+    select: params.select ?? [],
   });
 }
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'select')

[Survived] LogicalOperator
src/collection-query.ts:31:13
     schema,
     ...params,
     where: params?.where ?? [],
-    select: params?.select ?? [],
+    select: params?.select && [],
   });
 }

[Killed] BooleanLiteral
src/collection-query.ts:69:22
 export async function fetch<Q extends CollectionQuery<any>>(
   tx: TripleStoreTransaction | TripleStore,
   query: Q,
-  { includeTriples = false, schema }: FetchOptions = {}
+  { includeTriples = true, schema }: FetchOptions = {}
 ) {
   const order = query.order;
killedBy: database transactions can implicitly commit a transaction
statusReason: expected undefined to be 1 // Object.is equality

[Killed] StringLiteral
src/collection-query.ts:77:62
   const select = query.select;
   const resultOrder = await (order
     ? tx.findValuesInRange(
-        [query.collectionName, ...(order[0] as string).split('.')],
+        [query.collectionName, ...(order[0] as string).split("")],
         {
           direction: order[1],
killedBy: subscriptions handles order and limit
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/collection-query.ts:81:15
         {
           direction: order[1],
           ...(query.after
-            ? order[1] === 'DESC'
+            ? false
               ? { lessThan: query.after }
               : { greaterThan: query.after }
killedBy: ORDER & LIMIT & Pagination can paginate DESC
statusReason: expected false to be truthy

[Killed] ConditionalExpression
src/collection-query.ts:81:15
         {
           direction: order[1],
           ...(query.after
-            ? order[1] === 'DESC'
+            ? true
               ? { lessThan: query.after }
               : { greaterThan: query.after }
killedBy: ORDER & LIMIT & Pagination can paginate ASC
statusReason: expected false to be truthy

[Killed] ObjectLiteral
src/collection-query.ts:82:17
           direction: order[1],
           ...(query.after
             ? order[1] === 'DESC'
-              ? { lessThan: query.after }
+              ? {}
               : { greaterThan: query.after }
             : {}),
killedBy: ORDER & LIMIT & Pagination can paginate DESC
statusReason: expected false to be truthy

[Killed] ArrayDeclaration
src/collection-query.ts:87:20
             : {}),
         }
       )
-    : tx.findByAVE([['_collection'], query.collectionName]));
+    : tx.findByAVE([]));
 
   const allEntities = await (includeTriples
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'triples')

[Killed] StringLiteral
src/collection-query.ts:87:22
             : {}),
         }
       )
-    : tx.findByAVE([['_collection'], query.collectionName]));
+    : tx.findByAVE([[""], query.collectionName]));
 
   const allEntities = await (includeTriples
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArrayDeclaration
src/collection-query.ts:93:38
     ? getCollectionEntitiesAndTriples(tx, query.collectionName)
     : tx.getEntities(query.collectionName));
 
-  const resultTriples: TripleRow[] = [];
+  const resultTriples: TripleRow[] = ["Stryker was here"];
   const entities = await new Pipeline(resultOrder)
     .map(async ({ id }) => {
killedBy: subscriptions can subscribe to just triples
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] MethodExpression
src/collection-query.ts:94:26
     : tx.getEntities(query.collectionName));
 
   const resultTriples: TripleRow[] = [];
-  const entities = await new Pipeline(resultOrder)
-    .map(async ({ id }) => {
-      const entityEntry = allEntities.get(id);
-      const externalId = stripCollectionFromId(id);
-      if (entityEntry.triples) {
-        return [externalId, entityEntry];
-      } else {
-        return [externalId, { triples: [], entity: entityEntry }];
-      }
-    })
-    .filter(async ([, { entity }]) =>
-      doesEntityObjMatchWhere(entity, where, schema)
-    )
+  const entities = await new Pipeline(resultOrder).map(async ({
+  id
+}) => {
+  const entityEntry = allEntities.get(id);
+  const externalId = stripCollectionFromId(id);
+  if (entityEntry.triples) {
+    return [externalId, entityEntry];
+  } else {
+    return [externalId, {
+      triples: [],
+      entity: entityEntry
+    }];
+  }
+})
     .map(async ([id, { triples, entity }]) => {
       resultTriples.push(...triples);
killedBy: Database API supports basic queries with filters
statusReason: expected 4 to be 2 // Object.is equality

[Killed] BlockStatement
src/collection-query.ts:95:28
 
   const resultTriples: TripleRow[] = [];
   const entities = await new Pipeline(resultOrder)
-    .map(async ({ id }) => {
-      const entityEntry = allEntities.get(id);
-      const externalId = stripCollectionFromId(id);
-      if (entityEntry.triples) {
-        return [externalId, entityEntry];
-      } else {
-        return [externalId, { triples: [], entity: entityEntry }];
-      }
-    })
+    .map(async ({ id }) => {})
     .filter(async ([, { entity }]) =>
       doesEntityObjMatchWhere(entity, where, schema)
killedBy: Database API supports basic queries with filters
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
src/collection-query.ts:98:32
     .map(async ({ id }) => {
       const entityEntry = allEntities.get(id);
       const externalId = stripCollectionFromId(id);
-      if (entityEntry.triples) {
-        return [externalId, entityEntry];
-      } else {
+      if (entityEntry.triples) {} else {
         return [externalId, { triples: [], entity: entityEntry }];
       }
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/collection-query.ts:98:11
     .map(async ({ id }) => {
       const entityEntry = allEntities.get(id);
       const externalId = stripCollectionFromId(id);
-      if (entityEntry.triples) {
+      if (true) {
         return [externalId, entityEntry];
       } else {
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/collection-query.ts:100:14
       const externalId = stripCollectionFromId(id);
       if (entityEntry.triples) {
         return [externalId, entityEntry];
-      } else {
-        return [externalId, { triples: [], entity: entityEntry }];
-      }
+      } else {}
     })
     .filter(async ([, { entity }]) =>
killedBy: Database API supports basic queries with filters
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ArrowFunction
src/collection-query.ts:104:13
         return [externalId, { triples: [], entity: entityEntry }];
       }
     })
-    .filter(async ([, { entity }]) =>
-      doesEntityObjMatchWhere(entity, where, schema)
+    .filter(() => undefined
     )
     .map(async ([id, { triples, entity }]) => {
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/collection-query.ts:107:47
     .filter(async ([, { entity }]) =>
       doesEntityObjMatchWhere(entity, where, schema)
     )
-    .map(async ([id, { triples, entity }]) => {
-      resultTriples.push(...triples);
-      return [id, entity] as [string, any];
-    })
+    .map(async ([id, { triples, entity }]) => {})
     .take(limit ?? Infinity)
     .toArray();
killedBy: Database API supports basic queries with filters
statusReason: Iterator value undefined is not an entry object

[Killed] LogicalOperator
src/collection-query.ts:111:11
       resultTriples.push(...triples);
       return [id, entity] as [string, any];
     })
-    .take(limit ?? Infinity)
+    .take(limit && Infinity)
     .toArray();
 
killedBy: subscriptions handles order and limit
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/collection-query.ts:116:7
 
   const results = new Map(entities);
 
-  if (select && select.length > 0) {
+  if (true) {
     for (const result of results) {
       const [entId, entity] = result;
killedBy: Database API supports filtering on one attribute with multiple operators
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/collection-query.ts:116:36
 
   const results = new Map(entities);
 
-  if (select && select.length > 0) {
-    for (const result of results) {
-      const [entId, entity] = result;
-      const selectedEntity = select.reduce<any>((acc, selectPath) => {
-        const pathParts = (selectPath as string).split('.');
-        let scope = acc;
-        for (const pathPart of pathParts) {
-          scope[pathPart] = entity[selectPath];
-          scope = scope[pathPart];
-        }
-        return acc;
-      }, {});
-      results.set(entId, selectedEntity);
-    }
-  }
+  if (select && select.length > 0) {}
   if (includeTriples) {
     return {
killedBy: Database API supports basic select statements
statusReason: expected { Object (id, name, ...) } to not have property "department"

[Killed] BlockStatement
src/collection-query.ts:117:35
   const results = new Map(entities);
 
   if (select && select.length > 0) {
-    for (const result of results) {
-      const [entId, entity] = result;
-      const selectedEntity = select.reduce<any>((acc, selectPath) => {
-        const pathParts = (selectPath as string).split('.');
-        let scope = acc;
-        for (const pathPart of pathParts) {
-          scope[pathPart] = entity[selectPath];
-          scope = scope[pathPart];
-        }
-        return acc;
-      }, {});
-      results.set(entId, selectedEntity);
-    }
+    for (const result of results) {}
   }
   if (includeTriples) {
killedBy: Database API supports basic select statements
statusReason: expected { Object (id, name, ...) } to not have property "department"

[Killed] BlockStatement
src/collection-query.ts:119:70
   if (select && select.length > 0) {
     for (const result of results) {
       const [entId, entity] = result;
-      const selectedEntity = select.reduce<any>((acc, selectPath) => {
-        const pathParts = (selectPath as string).split('.');
-        let scope = acc;
-        for (const pathPart of pathParts) {
-          scope[pathPart] = entity[selectPath];
-          scope = scope[pathPart];
-        }
-        return acc;
-      }, {});
+      const selectedEntity = select.reduce<any>((acc, selectPath) => {}, {});
       results.set(entId, selectedEntity);
     }
killedBy: Database API supports basic select statements
statusReason: Cannot convert undefined or null to object

[Killed] StringLiteral
src/collection-query.ts:120:56
     for (const result of results) {
       const [entId, entity] = result;
       const selectedEntity = select.reduce<any>((acc, selectPath) => {
-        const pathParts = (selectPath as string).split('.');
+        const pathParts = (selectPath as string).split("");
         let scope = acc;
         for (const pathPart of pathParts) {
killedBy: Database API supports basic select statements
statusReason: Maximum call stack size exceeded

[Killed] BlockStatement
src/collection-query.ts:122:43
       const selectedEntity = select.reduce<any>((acc, selectPath) => {
         const pathParts = (selectPath as string).split('.');
         let scope = acc;
-        for (const pathPart of pathParts) {
-          scope[pathPart] = entity[selectPath];
-          scope = scope[pathPart];
-        }
+        for (const pathPart of pathParts) {}
         return acc;
       }, {});
killedBy: Database API supports basic select statements
statusReason: expected {} to have property "name"

[Killed] ConditionalExpression
src/collection-query.ts:131:7
       results.set(entId, selectedEntity);
     }
   }
-  if (includeTriples) {
+  if (false) {
     return {
       results,
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/collection-query.ts:131:23
       results.set(entId, selectedEntity);
     }
   }
-  if (includeTriples) {
-    return {
-      results,
-      triples: resultTriples,
-    };
-  }
+  if (includeTriples) {}
   return results;
 }
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
src/collection-query.ts:132:12
     }
   }
   if (includeTriples) {
-    return {
-      results,
-      triples: resultTriples,
-    };
+    return {};
   }
   return results;
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] MethodExpression
src/collection-query.ts:145:27
   where: Q['where'],
   schema?: Q['schema']
 ) {
-  const basicStatements = where.filter(
-    (statement): statement is FilterStatement<Q['schema']> =>
-      statement instanceof Array
-  );
+  const basicStatements = where;
 
   const orStatements = where.filter(
killedBy: Database API supports filtering on one attribute with multiple operators
statusReason: statement is not iterable

[Killed] ArrowFunction
src/collection-query.ts:146:5
   schema?: Q['schema']
 ) {
   const basicStatements = where.filter(
-    (statement): statement is FilterStatement<Q['schema']> =>
-      statement instanceof Array
+    () => undefined
   );
 
killedBy: Database API supports basic queries with filters
statusReason: expected 4 to be 2 // Object.is equality

[Killed] MethodExpression
src/collection-query.ts:150:24
       statement instanceof Array
   );
 
-  const orStatements = where.filter(
-    (statement): statement is FilterGroup<Q['schema']> =>
-      'mod' in statement && statement.mod === 'or'
-  );
+  const orStatements = where;
 
   const andStatements = where.filter(
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] ArrowFunction
src/collection-query.ts:151:5
   );
 
   const orStatements = where.filter(
-    (statement): statement is FilterGroup<Q['schema']> =>
-      'mod' in statement && statement.mod === 'or'
+    () => undefined
   );
 
killedBy: OR queries supports OR queries
statusReason: expected Map{ '1' => { …(5) }, …(4) } to have a size of 3 but got 5

[Killed] EqualityOperator
src/collection-query.ts:152:29
 
   const orStatements = where.filter(
     (statement): statement is FilterGroup<Q['schema']> =>
-      'mod' in statement && statement.mod === 'or'
+      'mod' in statement && statement.mod !== 'or'
   );
 
killedBy: OR queries supports OR queries
statusReason: expected Map{ '1' => { …(5) }, …(4) } to have a size of 3 but got 5

[Killed] ConditionalExpression
src/collection-query.ts:152:7
 
   const orStatements = where.filter(
     (statement): statement is FilterGroup<Q['schema']> =>
-      'mod' in statement && statement.mod === 'or'
+      false
   );
 
killedBy: OR queries supports OR queries
statusReason: expected Map{ '1' => { …(5) }, …(4) } to have a size of 3 but got 5

[Killed] MethodExpression
src/collection-query.ts:155:25
       'mod' in statement && statement.mod === 'or'
   );
 
-  const andStatements = where.filter(
-    (statement): statement is FilterGroup<Q['schema']> =>
-      'mod' in statement && statement.mod === 'and'
-  );
+  const andStatements = where;
   const matchesBasicFilters = entitySatisfiesAllFilters(
     entityObj,
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] ArrowFunction
src/collection-query.ts:156:5
   );
 
   const andStatements = where.filter(
-    (statement): statement is FilterGroup<Q['schema']> =>
-      'mod' in statement && statement.mod === 'and'
+    () => undefined
   );
   const matchesBasicFilters = entitySatisfiesAllFilters(
killedBy: Database API supports filtering on one attribute with multiple operators
statusReason: expected 6 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/collection-query.ts:157:7
 
   const andStatements = where.filter(
     (statement): statement is FilterGroup<Q['schema']> =>
-      'mod' in statement && statement.mod === 'and'
+      true
   );
   const matchesBasicFilters = entitySatisfiesAllFilters(
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] LogicalOperator
src/collection-query.ts:157:7
 
   const andStatements = where.filter(
     (statement): statement is FilterGroup<Q['schema']> =>
-      'mod' in statement && statement.mod === 'and'
+      'mod' in statement || statement.mod === 'and'
   );
   const matchesBasicFilters = entitySatisfiesAllFilters(
killedBy: OR queries supports OR queries
statusReason: expected Map{} to have a size of 3 but got 1

[Killed] ConditionalExpression
src/collection-query.ts:165:7
     schema
   );
 
-  if (!matchesBasicFilters) return false;
+  if (false) return false;
 
   const matchesOrFilters = orStatements.every(({ filters }) =>
killedBy: Database API supports basic queries with filters
statusReason: expected 4 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/collection-query.ts:165:7
     schema
   );
 
-  if (!matchesBasicFilters) return false;
+  if (true) return false;
 
   const matchesOrFilters = orStatements.every(({ filters }) =>
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[Killed] MethodExpression
src/collection-query.ts:167:28
 
   if (!matchesBasicFilters) return false;
 
-  const matchesOrFilters = orStatements.every(({ filters }) =>
-    filters.some(
-      (filter) => doesEntityObjMatchWhere(entityObj, [filter]),
-      schema
-    )
-  );
+  const matchesOrFilters = orStatements.some(({
+  filters
+}) => filters.some(filter => doesEntityObjMatchWhere(entityObj, [filter]), schema));
   if (!matchesOrFilters) return false;
 
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArrowFunction
src/collection-query.ts:167:47
 
   if (!matchesBasicFilters) return false;
 
-  const matchesOrFilters = orStatements.every(({ filters }) =>
-    filters.some(
-      (filter) => doesEntityObjMatchWhere(entityObj, [filter]),
-      schema
-    )
+  const matchesOrFilters = orStatements.every(() => undefined
   );
   if (!matchesOrFilters) return false;
killedBy: OR queries supports OR queries
statusReason: expected Map{} to have a size of 3 but got +0

[Killed] MethodExpression
src/collection-query.ts:168:5
   if (!matchesBasicFilters) return false;
 
   const matchesOrFilters = orStatements.every(({ filters }) =>
-    filters.some(
-      (filter) => doesEntityObjMatchWhere(entityObj, [filter]),
-      schema
-    )
+    filters.every(filter => doesEntityObjMatchWhere(entityObj, [filter]), schema)
   );
   if (!matchesOrFilters) return false;
killedBy: OR queries supports OR queries
statusReason: expected Map{} to have a size of 3 but got 1

[Killed] ArrowFunction
src/collection-query.ts:169:7
 
   const matchesOrFilters = orStatements.every(({ filters }) =>
     filters.some(
-      (filter) => doesEntityObjMatchWhere(entityObj, [filter]),
+      () => undefined,
       schema
     )
killedBy: OR queries supports OR queries
statusReason: expected Map{} to have a size of 3 but got +0

[Killed] ConditionalExpression
src/collection-query.ts:173:7
       schema
     )
   );
-  if (!matchesOrFilters) return false;
+  if (true) return false;
 
   const matchesAndFilters = andStatements.every(({ filters }) =>
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/collection-query.ts:173:33
       schema
     )
   );
-  if (!matchesOrFilters) return false;
+  if (!matchesOrFilters) return true;
 
   const matchesAndFilters = andStatements.every(({ filters }) =>
killedBy: OR queries supports OR queries
statusReason: expected Map{ '1' => { …(5) }, …(4) } to have a size of 3 but got 5

[Killed] MethodExpression
src/collection-query.ts:175:29
   );
   if (!matchesOrFilters) return false;
 
-  const matchesAndFilters = andStatements.every(({ filters }) =>
-    doesEntityObjMatchWhere(entityObj, filters, schema)
-  );
+  const matchesAndFilters = andStatements.some(({
+  filters
+}) => doesEntityObjMatchWhere(entityObj, filters, schema));
   if (!matchesAndFilters) return false;
 
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArrowFunction
src/collection-query.ts:175:49
   );
   if (!matchesOrFilters) return false;
 
-  const matchesAndFilters = andStatements.every(({ filters }) =>
-    doesEntityObjMatchWhere(entityObj, filters, schema)
+  const matchesAndFilters = andStatements.every(() => undefined
   );
   if (!matchesAndFilters) return false;
killedBy: Database API supports filtering on one attribute with multiple operators
statusReason: expected -Infinity to be 4 // Object.is equality

[Killed] BooleanLiteral
src/collection-query.ts:178:34
   const matchesAndFilters = andStatements.every(({ filters }) =>
     doesEntityObjMatchWhere(entityObj, filters, schema)
   );
-  if (!matchesAndFilters) return false;
+  if (!matchesAndFilters) return true;
 
   return true;
killedBy: Database API supports filtering on one attribute with multiple operators
statusReason: expected 6 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/collection-query.ts:178:7
   const matchesAndFilters = andStatements.every(({ filters }) =>
     doesEntityObjMatchWhere(entityObj, filters, schema)
   );
-  if (!matchesAndFilters) return false;
+  if (false) return false;
 
   return true;
killedBy: Database API supports filtering on one attribute with multiple operators
statusReason: expected 6 to be 4 // Object.is equality

[Killed] BlockStatement
src/collection-query.ts:194:28
   schema?: Q['schema']
 ): boolean {
   const groupedFilters: Map<string, [Operator, any][]> = filters.reduce(
-    (groups, statement) => {
-      const [path, op, value] = statement;
-      if (groups.has(path)) {
-        groups.get(path).push([op, value]);
-      } else {
-        groups.set(path, [[op, value]]);
-      }
-      return groups;
-    },
+    (groups, statement) => {},
     new Map()
   );
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'size')

[Killed] BlockStatement
src/collection-query.ts:196:29
   const groupedFilters: Map<string, [Operator, any][]> = filters.reduce(
     (groups, statement) => {
       const [path, op, value] = statement;
-      if (groups.has(path)) {
-        groups.get(path).push([op, value]);
-      } else {
+      if (groups.has(path)) {} else {
         groups.set(path, [[op, value]]);
       }
killedBy: Database API supports filtering on one attribute with multiple operators
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/collection-query.ts:196:11
   const groupedFilters: Map<string, [Operator, any][]> = filters.reduce(
     (groups, statement) => {
       const [path, op, value] = statement;
-      if (groups.has(path)) {
+      if (false) {
         groups.get(path).push([op, value]);
       } else {
killedBy: Database API supports filtering on one attribute with multiple operators
statusReason: expected 6 to be 4 // Object.is equality

[Killed] ArrayDeclaration
src/collection-query.ts:197:31
     (groups, statement) => {
       const [path, op, value] = statement;
       if (groups.has(path)) {
-        groups.get(path).push([op, value]);
+        groups.get(path).push([]);
       } else {
         groups.set(path, [[op, value]]);
killedBy: Database API supports filtering on one attribute with multiple operators
statusReason: Unknown operator undefined

[Killed] BlockStatement
src/collection-query.ts:198:14
       const [path, op, value] = statement;
       if (groups.has(path)) {
         groups.get(path).push([op, value]);
-      } else {
-        groups.set(path, [[op, value]]);
-      }
+      } else {}
       return groups;
     },
killedBy: Database API supports basic queries with filters
statusReason: expected 4 to be 2 // Object.is equality

[Killed] EqualityOperator
src/collection-query.ts:207:5
   );
 
   return (
-    groupedFilters.size === 0 ||
+    groupedFilters.size !== 0 ||
     [...groupedFilters.entries()].every(([path, filters]) => {
       const dataType = schema && getSchemaFromPath(schema, path.split('.'));
killedBy: Database API supports basic queries with filters
statusReason: expected 4 to be 2 // Object.is equality

[Survived] ConditionalExpression
src/collection-query.ts:207:5
   );
 
   return (
-    groupedFilters.size === 0 ||
+    false ||
     [...groupedFilters.entries()].every(([path, filters]) => {
       const dataType = schema && getSchemaFromPath(schema, path.split('.'));

[Killed] ArrayDeclaration
src/collection-query.ts:208:5
 
   return (
     groupedFilters.size === 0 ||
-    [...groupedFilters.entries()].every(([path, filters]) => {
+    [].every(([path, filters]) => {
       const dataType = schema && getSchemaFromPath(schema, path.split('.'));
 
killedBy: Database API supports basic queries with filters
statusReason: expected 4 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/collection-query.ts:209:24
   return (
     groupedFilters.size === 0 ||
     [...groupedFilters.entries()].every(([path, filters]) => {
-      const dataType = schema && getSchemaFromPath(schema, path.split('.'));
+      const dataType = true;
 
       return filters.every(([op, filterValue]) => {
killedBy: Set operations can add to set
statusReason: Received an unexpected value ([object Object]) for path employees in entity [object Object] interpreted as true. This is likely caused by a missing or incorrect schema, or because a filter path was provided that does not lead to a leaf attribute in the entity

[Killed] ConditionalExpression
src/collection-query.ts:209:24
   return (
     groupedFilters.size === 0 ||
     [...groupedFilters.entries()].every(([path, filters]) => {
-      const dataType = schema && getSchemaFromPath(schema, path.split('.'));
+      const dataType = false;
 
       return filters.every(([op, filterValue]) => {
killedBy: Set operations can add to set
statusReason: Received an unexpected value ([object Object]) for path employees in entity [object Object] interpreted as false. This is likely caused by a missing or incorrect schema, or because a filter path was provided that does not lead to a leaf attribute in the entity
