[Killed] EqualityOperator
src/collection-query.ts:212:25
       const dataType = schema && getSchemaFromPath(schema, path.split('.'));
 
       return filters.every(([op, filterValue]) => {
-        if (dataType && dataType['x-crdt-type'] === 'Set') {
+        if (dataType && dataType['x-crdt-type'] !== 'Set') {
           const pointer = '/' + path.replace('.', '/');
           const value: Record<string, [boolean, Timestamp]> = ValuePointer.Get(
killedBy: Set operations can add to set
statusReason: Received an unexpected value ([object Object]) for path employees in entity [object Object] interpreted as [object Object]. This is likely caused by a missing or incorrect schema, or because a filter path was provided that does not lead to a leaf attribute in the entity

[Killed] ConditionalExpression
src/collection-query.ts:212:25
       const dataType = schema && getSchemaFromPath(schema, path.split('.'));
 
       return filters.every(([op, filterValue]) => {
-        if (dataType && dataType['x-crdt-type'] === 'Set') {
+        if (dataType && true) {
           const pointer = '/' + path.replace('.', '/');
           const value: Record<string, [boolean, Timestamp]> = ValuePointer.Get(
killedBy: schema changes can rename an attribute
statusReason: number 1 is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] MethodExpression
src/collection-query.ts:218:18
             entity,
             pointer
           );
-          return Object.entries(value)
-            .filter(([_v, [inSet, _ts]]) => inSet)
-            .some(([v]) => isOperatorSatisfied(op, v, filterValue));
+          return Object.entries(value).filter(([_v, [inSet, _ts]]) => inSet).every(([v]) => isOperatorSatisfied(op, v, filterValue));
         }
         const maybeValue = path
killedBy: Set operations can add to set
statusReason: expected Map{} to have a size of 1 but got +0

[Killed] MethodExpression
src/collection-query.ts:218:18
             entity,
             pointer
           );
-          return Object.entries(value)
-            .filter(([_v, [inSet, _ts]]) => inSet)
+          return Object.entries(value)
             .some(([v]) => isOperatorSatisfied(op, v, filterValue));
         }
killedBy: Set operations can remove from set
statusReason: expected Map{} to have a size of +0 but got 1

[Killed] ArrowFunction
src/collection-query.ts:219:21
             pointer
           );
           return Object.entries(value)
-            .filter(([_v, [inSet, _ts]]) => inSet)
+            .filter(() => undefined)
             .some(([v]) => isOperatorSatisfied(op, v, filterValue));
         }
killedBy: Set operations can add to set
statusReason: expected Map{} to have a size of 1 but got +0

[Killed] ArrowFunction
src/collection-query.ts:220:19
           );
           return Object.entries(value)
             .filter(([_v, [inSet, _ts]]) => inSet)
-            .some(([v]) => isOperatorSatisfied(op, v, filterValue));
+            .some(() => undefined);
         }
         const maybeValue = path
killedBy: Set operations can add to set
statusReason: expected Map{} to have a size of 1 but got +0

[Killed] ArrowFunction
src/collection-query.ts:224:19
         }
         const maybeValue = path
           .split('.')
-          .reduce((acc, curr) => acc && acc[curr], entity);
+          .reduce(() => undefined, entity);
         if (!maybeValue) console.warn(`${path} not found in ${entity}`);
         if (
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/collection-query.ts:224:34
         }
         const maybeValue = path
           .split('.')
-          .reduce((acc, curr) => acc && acc[curr], entity);
+          .reduce((acc, curr) => true, entity);
         if (!maybeValue) console.warn(`${path} not found in ${entity}`);
         if (
killedBy: Database API supports basic queries with filters
statusReason: Received an unexpected value (true) for path level in entity [object Object] interpreted as undefined. This is likely caused by a missing or incorrect schema, or because a filter path was provided that does not lead to a leaf attribute in the entity

[Survived] BooleanLiteral
src/collection-query.ts:225:13
         const maybeValue = path
           .split('.')
           .reduce((acc, curr) => acc && acc[curr], entity);
-        if (!maybeValue) console.warn(`${path} not found in ${entity}`);
+        if (maybeValue) console.warn(`${path} not found in ${entity}`);
         if (
           maybeValue &&

[Survived] ConditionalExpression
src/collection-query.ts:225:13
         const maybeValue = path
           .split('.')
           .reduce((acc, curr) => acc && acc[curr], entity);
-        if (!maybeValue) console.warn(`${path} not found in ${entity}`);
+        if (false) console.warn(`${path} not found in ${entity}`);
         if (
           maybeValue &&

[Killed] ConditionalExpression
src/collection-query.ts:227:11
           .reduce((acc, curr) => acc && acc[curr], entity);
         if (!maybeValue) console.warn(`${path} not found in ${entity}`);
         if (
-          maybeValue &&
-          (!(maybeValue instanceof Array) || maybeValue.length > 2)
+          true
         ) {
           throw new Error(
killedBy: Database API supports basic queries with filters
statusReason: Received an unexpected value (100,6,atSUfP79-ABRdz2fwkm4d) for path level in entity [object Object] interpreted as undefined. This is likely caused by a missing or incorrect schema, or because a filter path was provided that does not lead to a leaf attribute in the entity

[Killed] LogicalOperator
src/collection-query.ts:227:11
           .reduce((acc, curr) => acc && acc[curr], entity);
         if (!maybeValue) console.warn(`${path} not found in ${entity}`);
         if (
-          maybeValue &&
-          (!(maybeValue instanceof Array) || maybeValue.length > 2)
+          maybeValue || !(maybeValue instanceof Array) || maybeValue.length > 2
         ) {
           throw new Error(
killedBy: Database API supports basic queries with filters
statusReason: Received an unexpected value (100,6,d5Nuo47uZ5VW23es2TElG) for path level in entity [object Object] interpreted as undefined. This is likely caused by a missing or incorrect schema, or because a filter path was provided that does not lead to a leaf attribute in the entity

[Killed] BooleanLiteral
src/collection-query.ts:228:12
         if (!maybeValue) console.warn(`${path} not found in ${entity}`);
         if (
           maybeValue &&
-          (!(maybeValue instanceof Array) || maybeValue.length > 2)
+          (maybeValue instanceof Array || maybeValue.length > 2)
         ) {
           throw new Error(
killedBy: Database API supports basic queries with filters
statusReason: Received an unexpected value (100,6,tSb1GgEflys8l65ZzXQZV) for path level in entity [object Object] interpreted as undefined. This is likely caused by a missing or incorrect schema, or because a filter path was provided that does not lead to a leaf attribute in the entity

[Killed] EqualityOperator
src/collection-query.ts:228:46
         if (!maybeValue) console.warn(`${path} not found in ${entity}`);
         if (
           maybeValue &&
-          (!(maybeValue instanceof Array) || maybeValue.length > 2)
+          (!(maybeValue instanceof Array) || maybeValue.length <= 2)
         ) {
           throw new Error(
killedBy: Database API supports basic queries with filters
statusReason: Received an unexpected value (100,6,iVvtmjyUTQ71o_EsjejxT) for path level in entity [object Object] interpreted as undefined. This is likely caused by a missing or incorrect schema, or because a filter path was provided that does not lead to a leaf attribute in the entity

[Killed] LogicalOperator
src/collection-query.ts:234:30
           );
         }
-        const [value, _ts] = maybeValue ?? [undefined, undefined];
+        const [value, _ts] = maybeValue && [undefined, undefined];
         return isOperatorSatisfied(op, value, filterValue);
       });
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[Survived] ArrayDeclaration
src/collection-query.ts:234:44
           );
         }
-        const [value, _ts] = maybeValue ?? [undefined, undefined];
+        const [value, _ts] = maybeValue ?? [];
         return isOperatorSatisfied(op, value, filterValue);
       });

[Killed] BlockStatement
src/collection-query.ts:241:56
   );
 }
 
-function ilike(text: string, pattern: string): boolean {
-  // Escape special regex characters in the pattern
-  pattern = pattern.replace(/[-[\]{}()*+?.,\\^$|#\s]/g, '\\$&');
-  // Replace SQL LIKE wildcards (%) with equivalent regex wildcards (.*)
-  pattern = pattern.replace(/%/g, '.*');
-
-  // Replace SQL LIKE single-character wildcards (_) with equivalent regex wildcards (.)
-  pattern = pattern.replace(/_/g, '.');
-
-  // Create a RegExp object from the pattern
-  const regex = new RegExp(`^${pattern}$`, 'i');
-
-  // Test the text against the regex
-  return regex.test(text);
-}
+function ilike(text: string, pattern: string): boolean {}
 
 function isOperatorSatisfied(op: Operator, value: any, filterValue: any) {
killedBy: Database API supports basic queries with the "like" operator
statusReason: expected +0 to be 1 // Object.is equality

[Killed] Regex
src/collection-query.ts:243:29
 
 function ilike(text: string, pattern: string): boolean {
   // Escape special regex characters in the pattern
-  pattern = pattern.replace(/[-[\]{}()*+?.,\\^$|#\s]/g, '\\$&');
+  pattern = pattern.replace(/[^-[\]{}()*+?.,\\^$|#\s]/g, '\\$&');
   // Replace SQL LIKE wildcards (%) with equivalent regex wildcards (.*)
   pattern = pattern.replace(/%/g, '.*');
killedBy: Database API supports basic queries with the "like" operator
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/collection-query.ts:257:74
   return regex.test(text);
 }
 
-function isOperatorSatisfied(op: Operator, value: any, filterValue: any) {
-  switch (op) {
-    case '=':
-      return value == filterValue;
-    case '!=':
-      return value !== filterValue;
-    case '>':
-      return value > filterValue;
-    case '>=':
-      return value >= filterValue;
-    case '<':
-      return value < filterValue;
-    case '<=':
-      return value <= filterValue;
-
-    //TODO: move regex initialization outside of the scan loop to improve performance
-    case 'like':
-      return ilike(value, filterValue);
-    default:
-      throw new Error(`Unknown operator ${op}`);
-  }
-}
+function isOperatorSatisfied(op: Operator, value: any, filterValue: any) {}
 
 async function getCollectionEntitiesAndTriples(
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/collection-query.ts:259:5
 
 function isOperatorSatisfied(op: Operator, value: any, filterValue: any) {
   switch (op) {
-    case '=':
-      return value == filterValue;
+    case '=':
     case '!=':
       return value !== filterValue;
killedBy: OR queries supports OR queries
statusReason: expected Map{ '2' => { …(5) }, …(3) } to have a size of 3 but got 4

[Killed] StringLiteral
src/collection-query.ts:259:10
 
 function isOperatorSatisfied(op: Operator, value: any, filterValue: any) {
   switch (op) {
-    case '=':
+    case "":
       return value == filterValue;
     case '!=':
killedBy: Database API supports basic queries with filters
statusReason: Unknown operator =

[Killed] ConditionalExpression
src/collection-query.ts:260:14
 function isOperatorSatisfied(op: Operator, value: any, filterValue: any) {
   switch (op) {
     case '=':
-      return value == filterValue;
+      return true;
     case '!=':
       return value !== filterValue;
killedBy: Database API supports basic queries with filters
statusReason: expected 4 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/collection-query.ts:260:14
 function isOperatorSatisfied(op: Operator, value: any, filterValue: any) {
   switch (op) {
     case '=':
-      return value == filterValue;
+      return false;
     case '!=':
       return value !== filterValue;
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[Survived] ConditionalExpression
src/collection-query.ts:261:5
   switch (op) {
     case '=':
       return value == filterValue;
-    case '!=':
-      return value !== filterValue;
+    case '!=':
     case '>':
       return value > filterValue;

[Killed] ConditionalExpression
src/collection-query.ts:262:14
     case '=':
       return value == filterValue;
     case '!=':
-      return value !== filterValue;
+      return true;
     case '>':
       return value > filterValue;
killedBy: Database API supports basic queries with filters
statusReason: expected 4 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/collection-query.ts:262:14
     case '=':
       return value == filterValue;
     case '!=':
-      return value !== filterValue;
+      return false;
     case '>':
       return value > filterValue;
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/collection-query.ts:263:5
       return value == filterValue;
     case '!=':
       return value !== filterValue;
-    case '>':
-      return value > filterValue;
+    case '>':
     case '>=':
       return value >= filterValue;
killedBy: Database API supports basic queries with filters
statusReason: expected 4 to be 2 // Object.is equality

[Killed] StringLiteral
src/collection-query.ts:263:10
       return value == filterValue;
     case '!=':
       return value !== filterValue;
-    case '>':
+    case "":
       return value > filterValue;
     case '>=':
killedBy: Database API supports basic queries with filters
statusReason: Unknown operator >

[Killed] ConditionalExpression
src/collection-query.ts:264:14
     case '!=':
       return value !== filterValue;
     case '>':
-      return value > filterValue;
+      return false;
     case '>=':
       return value >= filterValue;
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/collection-query.ts:264:14
     case '!=':
       return value !== filterValue;
     case '>':
-      return value > filterValue;
+      return true;
     case '>=':
       return value >= filterValue;
killedBy: Database API supports basic queries with filters
statusReason: expected 4 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/collection-query.ts:265:5
       return value !== filterValue;
     case '>':
       return value > filterValue;
-    case '>=':
-      return value >= filterValue;
+    case '>=':
     case '<':
       return value < filterValue;
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/collection-query.ts:266:14
     case '>':
       return value > filterValue;
     case '>=':
-      return value >= filterValue;
+      return true;
     case '<':
       return value < filterValue;
killedBy: Database API supports filtering on one attribute with multiple operators
statusReason: expected 1 to be 2 // Object.is equality

[Killed] EqualityOperator
src/collection-query.ts:266:14
     case '>':
       return value > filterValue;
     case '>=':
-      return value >= filterValue;
+      return value < filterValue;
     case '<':
       return value < filterValue;
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/collection-query.ts:267:5
       return value > filterValue;
     case '>=':
       return value >= filterValue;
-    case '<':
-      return value < filterValue;
+    case '<':
     case '<=':
       return value <= filterValue;
killedBy: Database API supports basic queries with filters
statusReason: expected 4 to be 2 // Object.is equality

[Killed] EqualityOperator
src/collection-query.ts:268:14
     case '>=':
       return value >= filterValue;
     case '<':
-      return value < filterValue;
+      return value >= filterValue;
     case '<=':
       return value <= filterValue;
killedBy: Database API supports filtering on one attribute with multiple operators
statusReason: expected 6 to be 4 // Object.is equality

[Killed] EqualityOperator
src/collection-query.ts:268:14
     case '>=':
       return value >= filterValue;
     case '<':
-      return value < filterValue;
+      return value <= filterValue;
     case '<=':
       return value <= filterValue;
killedBy: Database API supports basic queries with filters
statusReason: expected 4 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/collection-query.ts:269:5
       return value >= filterValue;
     case '<':
       return value < filterValue;
-    case '<=':
-      return value <= filterValue;
+    case '<=':
+
+//TODO: move regex initialization outside of the scan loop to improve performance
 
     //TODO: move regex initialization outside of the scan loop to improve performance
killedBy: Database API supports basic queries with filters
statusReason: pattern.replace is not a function

[Killed] StringLiteral
src/collection-query.ts:269:10
       return value >= filterValue;
     case '<':
       return value < filterValue;
-    case '<=':
+    case "":
       return value <= filterValue;
 
killedBy: Database API supports basic queries with filters
statusReason: Unknown operator <=

[Killed] ConditionalExpression
src/collection-query.ts:270:14
     case '<':
       return value < filterValue;
     case '<=':
-      return value <= filterValue;
+      return false;
 
     //TODO: move regex initialization outside of the scan loop to improve performance
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 4 // Object.is equality

[Killed] EqualityOperator
src/collection-query.ts:270:14
     case '<':
       return value < filterValue;
     case '<=':
-      return value <= filterValue;
+      return value > filterValue;
 
     //TODO: move regex initialization outside of the scan loop to improve performance
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/collection-query.ts:273:5
       return value <= filterValue;
 
     //TODO: move regex initialization outside of the scan loop to improve performance
-    case 'like':
-      return ilike(value, filterValue);
+    //TODO: move regex initialization outside of the scan loop to improve performance
+case 'like':
     default:
       throw new Error(`Unknown operator ${op}`);
killedBy: Database API supports basic queries with the "like" operator
statusReason: Unknown operator like

[Killed] ConditionalExpression
src/collection-query.ts:275:5
     //TODO: move regex initialization outside of the scan loop to improve performance
     case 'like':
       return ilike(value, filterValue);
-    default:
-      throw new Error(`Unknown operator ${op}`);
+    default:
   }
 }
killedBy: Database API throws an error when filtering with an unimplmented operator
statusReason: promise resolved "[object Map]" instead of rejecting

[Survived] StringLiteral
src/collection-query.ts:276:23
     case 'like':
       return ilike(value, filterValue);
     default:
-      throw new Error(`Unknown operator ${op}`);
+      throw new Error(``);
   }
 }

[Killed] BlockStatement
src/collection-query.ts:283:64
 async function getCollectionEntitiesAndTriples(
   tx: TripleStoreTransaction | TripleStore,
   collectionName: string
-): Promise<Map<string, { triples: TripleRow[]; entity: any }>> {
-  // This could use the object entity index but keeping seperate for now to allow this to be used in instead of the entity index if we need to disable it
-  const collectionTriples = await tx.findByCollection(collectionName);
-  return collectionTriples.reduce((acc, triple) => {
-    const { id } = triple;
-    if (!acc.has(id)) {
-      acc.set(id, { triples: [], entity: {} });
-    }
-    const entry = acc.get(id);
-    entry!.triples.push(triple);
-    entry.entity = entityToResultReducer(entry.entity ?? {}, triple);
-    return acc;
-  }, new Map());
-}
+): Promise<Map<string, { triples: TripleRow[]; entity: any }>> {}
 
 function subscribeResultsAndTriples<Q extends CollectionQuery<any>>(
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/collection-query.ts:286:52
 ): Promise<Map<string, { triples: TripleRow[]; entity: any }>> {
   // This could use the object entity index but keeping seperate for now to allow this to be used in instead of the entity index if we need to disable it
   const collectionTriples = await tx.findByCollection(collectionName);
-  return collectionTriples.reduce((acc, triple) => {
-    const { id } = triple;
-    if (!acc.has(id)) {
-      acc.set(id, { triples: [], entity: {} });
-    }
-    const entry = acc.get(id);
-    entry!.triples.push(triple);
-    entry.entity = entityToResultReducer(entry.entity ?? {}, triple);
-    return acc;
-  }, new Map());
+  return collectionTriples.reduce((acc, triple) => {}, new Map());
 }
 
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/collection-query.ts:288:23
   const collectionTriples = await tx.findByCollection(collectionName);
   return collectionTriples.reduce((acc, triple) => {
     const { id } = triple;
-    if (!acc.has(id)) {
-      acc.set(id, { triples: [], entity: {} });
-    }
+    if (!acc.has(id)) {}
     const entry = acc.get(id);
     entry!.triples.push(triple);
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/collection-query.ts:288:9
   const collectionTriples = await tx.findByCollection(collectionName);
   return collectionTriples.reduce((acc, triple) => {
     const { id } = triple;
-    if (!acc.has(id)) {
+    if (false) {
       acc.set(id, { triples: [], entity: {} });
     }
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
src/collection-query.ts:289:19
   return collectionTriples.reduce((acc, triple) => {
     const { id } = triple;
     if (!acc.has(id)) {
-      acc.set(id, { triples: [], entity: {} });
+      acc.set(id, {});
     }
     const entry = acc.get(id);
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] LogicalOperator
src/collection-query.ts:293:42
     }
     const entry = acc.get(id);
     entry!.triples.push(triple);
-    entry.entity = entityToResultReducer(entry.entity ?? {}, triple);
+    entry.entity = entityToResultReducer(entry.entity && {}, triple);
     return acc;
   }, new Map());
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/collection-query.ts:310:23
   const limit = query.limit;
   const asyncUnSub = async () => {
     let { results, triples } = await fetch(tripleStore, query, {
-      includeTriples: true,
+      includeTriples: false,
       schema,
     });
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrayDeclaration
src/collection-query.ts:317:30
 
     const unsub = tripleStore.onWrite(async ({ inserts, deletes }) => {
       let nextResult = new Map(results);
-      const matchedTriples = [];
+      const matchedTriples = ["Stryker was here"];
       const updatedEntities = new Set<string>(
         [...inserts, ...deletes].map(({ id }) => stripCollectionFromId(id))
killedBy: subscriptions can subscribe to just triples
statusReason: expected [ 'Stryker was here', …(5) ] to have a length of 5 but got 6

[Killed] ArrowFunction
src/collection-query.ts:319:38
       let nextResult = new Map(results);
       const matchedTriples = [];
       const updatedEntities = new Set<string>(
-        [...inserts, ...deletes].map(({ id }) => stripCollectionFromId(id))
+        [...inserts, ...deletes].map(() => undefined)
       );
       for (const entity of updatedEntities) {
killedBy: subscriptions handles selection updates
statusReason: expected 'Computer Science' to be 'Math' // Object.is equality

[Killed] ConditionalExpression
src/collection-query.ts:332:11
           query.schema ? initialize(query.schema) : {}
         );
         const isInCollection =
-          entityObj['_collection'] &&
-          entityObj['_collection'][0] === query.collectionName;
+          false;
         const isInResult =
           isInCollection &&
killedBy: subscriptions handles selection updates
statusReason: Cannot read properties of undefined (reading 'major')

[Survived] LogicalOperator
src/collection-query.ts:332:11
           query.schema ? initialize(query.schema) : {}
         );
         const isInCollection =
-          entityObj['_collection'] &&
-          entityObj['_collection'][0] === query.collectionName;
+          entityObj['_collection'] || entityObj['_collection'][0] === query.collectionName;
         const isInResult =
           isInCollection &&

[Killed] EqualityOperator
src/collection-query.ts:333:11
         );
         const isInCollection =
           entityObj['_collection'] &&
-          entityObj['_collection'][0] === query.collectionName;
+          entityObj['_collection'][0] !== query.collectionName;
         const isInResult =
           isInCollection &&
killedBy: subscriptions handles selection updates
statusReason: Cannot read properties of undefined (reading 'major')

[Survived] ConditionalExpression
src/collection-query.ts:333:11
         );
         const isInCollection =
           entityObj['_collection'] &&
-          entityObj['_collection'][0] === query.collectionName;
+          true;
         const isInResult =
           isInCollection &&

[Killed] ConditionalExpression
src/collection-query.ts:335:11
           entityObj['_collection'] &&
           entityObj['_collection'][0] === query.collectionName;
         const isInResult =
-          isInCollection &&
-          doesEntityObjMatchWhere(entityObj, query.where ?? [], schema);
+          false;
         if (isInResult) {
           nextResult.set(entity, entityObj);
killedBy: subscriptions handles selection updates
statusReason: Cannot read properties of undefined (reading 'major')

[Killed] ConditionalExpression
src/collection-query.ts:335:11
           entityObj['_collection'] &&
           entityObj['_collection'][0] === query.collectionName;
         const isInResult =
-          isInCollection &&
-          doesEntityObjMatchWhere(entityObj, query.where ?? [], schema);
+          true;
         if (isInResult) {
           nextResult.set(entity, entityObj);
killedBy: subscriptions handles data leaving query
statusReason: expected 3 to be 2 // Object.is equality

[Killed] LogicalOperator
src/collection-query.ts:336:46
           entityObj['_collection'][0] === query.collectionName;
         const isInResult =
           isInCollection &&
-          doesEntityObjMatchWhere(entityObj, query.where ?? [], schema);
+          doesEntityObjMatchWhere(entityObj, query.where && [], schema);
         if (isInResult) {
           nextResult.set(entity, entityObj);
killedBy: subscriptions handles data leaving query
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/collection-query.ts:337:13
         const isInResult =
           isInCollection &&
           doesEntityObjMatchWhere(entityObj, query.where ?? [], schema);
-        if (isInResult) {
+        if (false) {
           nextResult.set(entity, entityObj);
           matchedTriples.push(...entityTriples);
killedBy: subscriptions handles selection updates
statusReason: Cannot read properties of undefined (reading 'major')

[Killed] BlockStatement
src/collection-query.ts:337:25
         const isInResult =
           isInCollection &&
           doesEntityObjMatchWhere(entityObj, query.where ?? [], schema);
-        if (isInResult) {
-          nextResult.set(entity, entityObj);
-          matchedTriples.push(...entityTriples);
-        } else {
+        if (isInResult) {} else {
           if (nextResult.has(entity)) {
             nextResult.delete(entity);
killedBy: subscriptions handles selection updates
statusReason: expected 'Computer Science' to be 'Math' // Object.is equality
