[Killed] BlockStatement
src/collection-query.ts:340:16
         if (isInResult) {
           nextResult.set(entity, entityObj);
           matchedTriples.push(...entityTriples);
-        } else {
-          if (nextResult.has(entity)) {
-            nextResult.delete(entity);
-            matchedTriples.push(...entityTriples);
-          }
-        }
+        } else {}
       }
 
killedBy: subscriptions handles data leaving query
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/collection-query.ts:341:15
           nextResult.set(entity, entityObj);
           matchedTriples.push(...entityTriples);
         } else {
-          if (nextResult.has(entity)) {
+          if (false) {
             nextResult.delete(entity);
             matchedTriples.push(...entityTriples);
killedBy: subscriptions handles data leaving query
statusReason: expected 3 to be 2 // Object.is equality

[Killed] BlockStatement
src/collection-query.ts:341:39
           nextResult.set(entity, entityObj);
           matchedTriples.push(...entityTriples);
         } else {
-          if (nextResult.has(entity)) {
-            nextResult.delete(entity);
-            matchedTriples.push(...entityTriples);
-          }
+          if (nextResult.has(entity)) {}
         }
       }
killedBy: subscriptions handles data leaving query
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/collection-query.ts:348:11
         }
       }
 
-      if (order || limit) {
+      if (false) {
         const entries = [...nextResult];
 
killedBy: subscriptions handles order and limit
statusReason: expected 3 to be 2 // Object.is equality

[Killed] BlockStatement
src/collection-query.ts:348:27
         }
       }
 
-      if (order || limit) {
-        const entries = [...nextResult];
-
-        if (order) {
-          const [prop, dir] = order;
-          entries.sort(([_aId, a], [_bId, b]) => {
-            // TODO support multi-level props probably using TypeBox json pointer
-            const direction =
-              a[prop][0] < b[prop][0] ? -1 : a[prop][0] == b[prop][0] ? 0 : 1;
-
-            return dir === 'ASC' ? direction : direction * -1;
-          });
-        }
-        nextResult = new Map(entries.slice(0, limit));
-      }
+      if (order || limit) {}
       results = nextResult as FetchResult<Q>;
       // console.timeEnd('query recalculation');
killedBy: subscriptions handles order and limit
statusReason: expected 3 to be 2 // Object.is equality

[Killed] BlockStatement
src/collection-query.ts:351:20
       if (order || limit) {
         const entries = [...nextResult];
 
-        if (order) {
-          const [prop, dir] = order;
-          entries.sort(([_aId, a], [_bId, b]) => {
-            // TODO support multi-level props probably using TypeBox json pointer
-            const direction =
-              a[prop][0] < b[prop][0] ? -1 : a[prop][0] == b[prop][0] ? 0 : 1;
-
-            return dir === 'ASC' ? direction : direction * -1;
-          });
-        }
+        if (order) {}
         nextResult = new Map(entries.slice(0, limit));
       }
killedBy: subscriptions handles order and limit
statusReason: expected [ 'Biology', 'Biology' ] to deeply equal [ 'Astronomy', 'Biology' ]

[Killed] ConditionalExpression
src/collection-query.ts:351:13
       if (order || limit) {
         const entries = [...nextResult];
 
-        if (order) {
+        if (false) {
           const [prop, dir] = order;
           entries.sort(([_aId, a], [_bId, b]) => {
killedBy: subscriptions handles order and limit
statusReason: expected [ 'Biology', 'Biology' ] to deeply equal [ 'Astronomy', 'Biology' ]

[Killed] MethodExpression
src/collection-query.ts:353:11
 
         if (order) {
           const [prop, dir] = order;
-          entries.sort(([_aId, a], [_bId, b]) => {
-            // TODO support multi-level props probably using TypeBox json pointer
-            const direction =
-              a[prop][0] < b[prop][0] ? -1 : a[prop][0] == b[prop][0] ? 0 : 1;
-
-            return dir === 'ASC' ? direction : direction * -1;
-          });
+          entries;
         }
         nextResult = new Map(entries.slice(0, limit));
killedBy: subscriptions handles order and limit
statusReason: expected [ 'Biology', 'Biology' ] to deeply equal [ 'Astronomy', 'Biology' ]

[Killed] BlockStatement
src/collection-query.ts:353:50
 
         if (order) {
           const [prop, dir] = order;
-          entries.sort(([_aId, a], [_bId, b]) => {
-            // TODO support multi-level props probably using TypeBox json pointer
-            const direction =
-              a[prop][0] < b[prop][0] ? -1 : a[prop][0] == b[prop][0] ? 0 : 1;
-
-            return dir === 'ASC' ? direction : direction * -1;
-          });
+          entries.sort(([_aId, a], [_bId, b]) => {});
         }
         nextResult = new Map(entries.slice(0, limit));
killedBy: subscriptions handles order and limit
statusReason: expected [ 'Biology', 'Biology' ] to deeply equal [ 'Astronomy', 'Biology' ]

[Killed] ConditionalExpression
src/collection-query.ts:356:15
           entries.sort(([_aId, a], [_bId, b]) => {
             // TODO support multi-level props probably using TypeBox json pointer
             const direction =
-              a[prop][0] < b[prop][0] ? -1 : a[prop][0] == b[prop][0] ? 0 : 1;
+              false ? -1 : a[prop][0] == b[prop][0] ? 0 : 1;
 
             return dir === 'ASC' ? direction : direction * -1;
killedBy: subscriptions handles order and limit
statusReason: expected [ 'Biology', 'Biology' ] to deeply equal [ 'Astronomy', 'Biology' ]

[Killed] UnaryOperator
src/collection-query.ts:356:41
           entries.sort(([_aId, a], [_bId, b]) => {
             // TODO support multi-level props probably using TypeBox json pointer
             const direction =
-              a[prop][0] < b[prop][0] ? -1 : a[prop][0] == b[prop][0] ? 0 : 1;
+              a[prop][0] < b[prop][0] ? +1 : a[prop][0] == b[prop][0] ? 0 : 1;
 
             return dir === 'ASC' ? direction : direction * -1;
killedBy: subscriptions handles order and limit
statusReason: expected [ 'Biology', 'Biology' ] to deeply equal [ 'Astronomy', 'Biology' ]

[Killed] ConditionalExpression
src/collection-query.ts:358:20
             const direction =
               a[prop][0] < b[prop][0] ? -1 : a[prop][0] == b[prop][0] ? 0 : 1;
 
-            return dir === 'ASC' ? direction : direction * -1;
+            return false ? direction : direction * -1;
           });
         }
killedBy: subscriptions handles order and limit
statusReason: expected [ 'Biology', 'Biology' ] to deeply equal [ 'Astronomy', 'Biology' ]

[Killed] EqualityOperator
src/collection-query.ts:358:20
             const direction =
               a[prop][0] < b[prop][0] ? -1 : a[prop][0] == b[prop][0] ? 0 : 1;
 
-            return dir === 'ASC' ? direction : direction * -1;
+            return dir !== 'ASC' ? direction : direction * -1;
           });
         }
killedBy: subscriptions handles order and limit
statusReason: expected [ 'Biology', 'Biology' ] to deeply equal [ 'Astronomy', 'Biology' ]

[Killed] MethodExpression
src/collection-query.ts:361:30
             return dir === 'ASC' ? direction : direction * -1;
           });
         }
-        nextResult = new Map(entries.slice(0, limit));
+        nextResult = new Map(entries);
       }
       results = nextResult as FetchResult<Q>;
killedBy: subscriptions handles order and limit
statusReason: expected 3 to be 2 // Object.is equality

[Survived] BlockStatement
src/collection-query.ts:372:22
 
   const unsubPromise = asyncUnSub();
 
-  return async () => {
-    const unsub = await unsubPromise;
-    unsub();
-  };
+  return async () => {};
 }
 

[Killed] BlockStatement
src/collection-query.ts:383:3
   query: Q,
   subscriptionCallback: (results: FetchResult<Q>) => void,
   schema?: Q['schema']
-) {
-  return subscribeResultsAndTriples(
-    tripleStore,
-    query,
-    ([results]) => {
-      subscriptionCallback(results);
-    },
-    schema
-  );
-}
+) {}
 
 // TODO: we should do this in a single step when calling entityToResultReducer
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/collection-query.ts:387:20
   return subscribeResultsAndTriples(
     tripleStore,
     query,
-    ([results]) => {
-      subscriptionCallback(results);
-    },
+    ([results]) => {},
     schema
   );
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/collection-query.ts:395:62
 }
 
 // TODO: we should do this in a single step when calling entityToResultReducer
-function filterToLatestEntityAttribute(triples: TripleRow[]) {
-  const latest = new Map<string, TripleRow>();
-  for (const triple of triples) {
-    const key = stringifyEA(triple.id, triple.attribute);
-    if (!latest.has(key)) {
-      latest.set(key, triple);
-      continue;
-    }
-    if (timestampCompare(latest.get(key)!.timestamp, triple.timestamp) < 0) {
-      latest.set(key, triple);
-      continue;
-    }
-  }
-  return [...latest.values()];
-}
+function filterToLatestEntityAttribute(triples: TripleRow[]) {}
 
 function stringifyEA(entity: EntityId, attribute: Attribute) {
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/collection-query.ts:397:33
 // TODO: we should do this in a single step when calling entityToResultReducer
 function filterToLatestEntityAttribute(triples: TripleRow[]) {
   const latest = new Map<string, TripleRow>();
-  for (const triple of triples) {
-    const key = stringifyEA(triple.id, triple.attribute);
-    if (!latest.has(key)) {
-      latest.set(key, triple);
-      continue;
-    }
-    if (timestampCompare(latest.get(key)!.timestamp, triple.timestamp) < 0) {
-      latest.set(key, triple);
-      continue;
-    }
-  }
+  for (const triple of triples) {}
   return [...latest.values()];
 }
killedBy: subscriptions handles selection updates
statusReason: Cannot read properties of undefined (reading 'major')

[Killed] BlockStatement
src/collection-query.ts:399:27
   const latest = new Map<string, TripleRow>();
   for (const triple of triples) {
     const key = stringifyEA(triple.id, triple.attribute);
-    if (!latest.has(key)) {
-      latest.set(key, triple);
-      continue;
-    }
+    if (!latest.has(key)) {}
     if (timestampCompare(latest.get(key)!.timestamp, triple.timestamp) < 0) {
       latest.set(key, triple);
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/collection-query.ts:399:9
   const latest = new Map<string, TripleRow>();
   for (const triple of triples) {
     const key = stringifyEA(triple.id, triple.attribute);
-    if (!latest.has(key)) {
+    if (latest.has(key)) {
       latest.set(key, triple);
       continue;
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[NoCoverage] ConditionalExpression
src/collection-query.ts:403:9
       latest.set(key, triple);
       continue;
     }
-    if (timestampCompare(latest.get(key)!.timestamp, triple.timestamp) < 0) {
+    if (true) {
       latest.set(key, triple);
       continue;

[NoCoverage] BlockStatement
src/collection-query.ts:403:77
       latest.set(key, triple);
       continue;
     }
-    if (timestampCompare(latest.get(key)!.timestamp, triple.timestamp) < 0) {
-      latest.set(key, triple);
-      continue;
-    }
+    if (timestampCompare(latest.get(key)!.timestamp, triple.timestamp) < 0) {}
   }
   return [...latest.values()];

[Killed] BlockStatement
src/collection-query.ts:411:62
   return [...latest.values()];
 }
 
-function stringifyEA(entity: EntityId, attribute: Attribute) {
-  return `${entity}|${attribute}`;
-}
+function stringifyEA(entity: EntityId, attribute: Attribute) {}
 
 export function subscribeTriples<Q extends CollectionQuery<any>>(
killedBy: subscriptions handles selection updates
statusReason: Cannot read properties of undefined (reading 'major')

[Killed] BlockStatement
src/collection-query.ts:420:3
   query: Q,
   subscriptionCallback: (results: TripleRow[]) => void,
   schema?: Q['schema']
-) {
-  return subscribeResultsAndTriples(
-    tripleStore,
-    query,
-    ([_results, triples]) => {
-      subscriptionCallback(triples);
-    },
-    schema
-  );
-}
+) {}
 
killedBy: subscriptions can subscribe to just triples
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/collection-query.ts:424:30
   return subscribeResultsAndTriples(
     tripleStore,
     query,
-    ([_results, triples]) => {
-      subscriptionCallback(triples);
-    },
+    ([_results, triples]) => {},
     schema
   );
killedBy: subscriptions can subscribe to just triples
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
