[Killed] ObjectLiteral
src/data-types/set.ts:6:70
 import { Set as SetStructure } from '../schema';
 import { Attribute } from '../triple-store';
 
-const SetType: DataType<Set<any>, ReturnType<typeof SetStructure>> = {
-  fromJSON(val: Set<string>) {
-    // NOTE: Previously this returned an object from entries, but that loses some information as all keys are converted to strings
-    // This caused query issues down the line when queries expecting numbers were searching over strings and failing
-
-    return new Map(Array.from(val).map((item) => [item, true]));
-  },
-  toJSON() {
-    throw new Error('Function not implemented.');
-  },
-  internalStructure: SetStructure,
-  operations: {
-    add: (value: any) => {
-      const attributeValuePairs = [[[value], true] as [Attribute, boolean]];
-      return attributeValuePairs;
-    },
-    remove: (value: any) => {
-      const attributeValuePairs = [[[value], false] as [Attribute, boolean]];
-      return attributeValuePairs;
-    },
-  },
-};
+const SetType: DataType<Set<any>, ReturnType<typeof SetStructure>> = {};
 
 export default SetType;
killedBy: Set operations can add to set
statusReason: default.fromJSON is not a function

[Killed] BlockStatement
src/data-types/set.ts:7:30
 import { Attribute } from '../triple-store';
 
 const SetType: DataType<Set<any>, ReturnType<typeof SetStructure>> = {
-  fromJSON(val: Set<string>) {
-    // NOTE: Previously this returned an object from entries, but that loses some information as all keys are converted to strings
-    // This caused query issues down the line when queries expecting numbers were searching over strings and failing
-
-    return new Map(Array.from(val).map((item) => [item, true]));
-  },
+  fromJSON(val: Set<string>) {},
   toJSON() {
     throw new Error('Function not implemented.');
killedBy: Set operations can add to set
statusReason: Unknown value type: undefined

[Killed] ArrowFunction
src/data-types/set.ts:11:40
     // NOTE: Previously this returned an object from entries, but that loses some information as all keys are converted to strings
     // This caused query issues down the line when queries expecting numbers were searching over strings and failing
 
-    return new Map(Array.from(val).map((item) => [item, true]));
+    return new Map(Array.from(val).map(() => undefined));
   },
   toJSON() {
killedBy: Set operations can add to set
statusReason: Iterator value undefined is not an entry object

[Killed] BooleanLiteral
src/data-types/set.ts:11:57
     // NOTE: Previously this returned an object from entries, but that loses some information as all keys are converted to strings
     // This caused query issues down the line when queries expecting numbers were searching over strings and failing
 
-    return new Map(Array.from(val).map((item) => [item, true]));
+    return new Map(Array.from(val).map((item) => [item, false]));
   },
   toJSON() {
killedBy: Set operations can remove from set
statusReason: expected Map{} to have a size of 1 but got +0

[NoCoverage] BlockStatement
src/data-types/set.ts:13:12
 
     return new Map(Array.from(val).map((item) => [item, true]));
   },
-  toJSON() {
-    throw new Error('Function not implemented.');
-  },
+  toJSON() {},
   internalStructure: SetStructure,
   operations: {

[Killed] BlockStatement
src/data-types/set.ts:18:26
   },
   internalStructure: SetStructure,
   operations: {
-    add: (value: any) => {
-      const attributeValuePairs = [[[value], true] as [Attribute, boolean]];
-      return attributeValuePairs;
-    },
+    add: (value: any) => {},
     remove: (value: any) => {
       const attributeValuePairs = [[[value], false] as [Attribute, boolean]];
killedBy: Set operations can add to set
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/data-types/set.ts:22:29
       const attributeValuePairs = [[[value], true] as [Attribute, boolean]];
       return attributeValuePairs;
     },
-    remove: (value: any) => {
-      const attributeValuePairs = [[[value], false] as [Attribute, boolean]];
-      return attributeValuePairs;
-    },
+    remove: (value: any) => {},
   },
 };
killedBy: Set operations can remove from set
statusReason: Cannot read properties of undefined (reading 'map')
