[NoCoverage] BlockStatement
src/db.ts:116:3
   collectionName: string,
   ruleType: keyof CollectionRules,
   rule: Rule<any>
-) {
-  return Object.entries(rule).map<EAV>(([key, value]) => [
-    '_schema',
-    ['collections', collectionName, 'rule', ruleType, key],
-    value,
-  ]);
-}
+) {}
 
 export class DBTransaction<M extends Models<any, any> | undefined> {

[NoCoverage] ArrowFunction
src/db.ts:117:40
   ruleType: keyof CollectionRules,
   rule: Rule<any>
 ) {
-  return Object.entries(rule).map<EAV>(([key, value]) => [
-    '_schema',
-    ['collections', collectionName, 'rule', ruleType, key],
-    value,
-  ]);
+  return Object.entries(rule).map<EAV>(() => undefined);
 }
 

[NoCoverage] StringLiteral
src/db.ts:119:6
 ) {
   return Object.entries(rule).map<EAV>(([key, value]) => [
     '_schema',
-    ['collections', collectionName, 'rule', ruleType, key],
+    ["", collectionName, 'rule', ruleType, key],
     value,
   ]);

[NoCoverage] ArrayDeclaration
src/db.ts:119:5
 ) {
   return Object.entries(rule).map<EAV>(([key, value]) => [
     '_schema',
-    ['collections', collectionName, 'rule', ruleType, key],
+    [],
     value,
   ]);

[Killed] BlockStatement
src/db.ts:131:21
   //   return this.storeTx.schema?.collections;
   // }
 
-  async getSchema() {
-    return this.storeTx.readSchema();
-  }
+  async getSchema() {}
 
   async commit() {
killedBy: schema changes can rename an attribute
statusReason: Path studentId does not exist in model.

[Killed] BlockStatement
src/db.ts:135:18
     return this.storeTx.readSchema();
   }
 
-  async commit() {
-    await this.storeTx.commit();
-  }
+  async commit() {}
 
   async cancel() {
killedBy: database transactions can't commit inside the transaction callback
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/db.ts:139:18
     await this.storeTx.commit();
   }
 
-  async cancel() {
-    await this.storeTx.cancel();
-  }
+  async cancel() {}
 
   async insert(
killedBy: database transactions can rollback a transaction
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/db.ts:147:5
     collectionName: CollectionNameFromModels<M>,
     doc: any,
     id?: string
-  ) {
-    if (id && !isValidExternalId(id)) {
-      throw new Error(`Invalid ID: ${id} cannot include ${ID_SEPARATOR}`);
-    }
-    await Document.insert(
-      this.storeTx,
-      appendCollectionToId(collectionName, id ?? nanoid()),
-      doc,
-      this.storeTx.clock,
-      collectionName
-    );
-  }
+  ) {}
 
   async update(
killedBy: Database API will throw an error if the provided entity id has a # sign in it
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/db.ts:148:9
     doc: any,
     id?: string
   ) {
-    if (id && !isValidExternalId(id)) {
+    if (false) {
       throw new Error(`Invalid ID: ${id} cannot include ${ID_SEPARATOR}`);
     }
killedBy: Database API will throw an error if the provided entity id has a # sign in it
statusReason: promise resolved "undefined" instead of rejecting

[Killed] LogicalOperator
src/db.ts:148:9
     doc: any,
     id?: string
   ) {
-    if (id && !isValidExternalId(id)) {
+    if (id || !isValidExternalId(id)) {
       throw new Error(`Invalid ID: ${id} cannot include ${ID_SEPARATOR}`);
     }
killedBy: database transactions can fetch by id in a transaction
statusReason: Invalid ID: 1 cannot include #

[Survived] StringLiteral
src/db.ts:149:23
     id?: string
   ) {
     if (id && !isValidExternalId(id)) {
-      throw new Error(`Invalid ID: ${id} cannot include ${ID_SEPARATOR}`);
+      throw new Error(``);
     }
     await Document.insert(

[Killed] LogicalOperator
src/db.ts:153:44
     }
     await Document.insert(
       this.storeTx,
-      appendCollectionToId(collectionName, id ?? nanoid()),
+      appendCollectionToId(collectionName, id && nanoid()),
       doc,
       this.storeTx.clock,
killedBy: database transactions can fetch by id in a transaction
statusReason: Cannot read properties of null (reading 'score')

[Killed] BlockStatement
src/db.ts:164:5
     collectionName: CollectionNameFromModels<M>,
     entityId: string,
     updater: (mutation: Mutation<ModelFromModels<M>>) => Promise<void>
-  ) {
-    // TODO: i think we need to pass generics to triple store
-    const schema = (await this.getSchema())?.collections as ModelFromModels<M>;
-    const mutation = new Mutation<ModelFromModels<M>>(
-      {
-        transactor: this.storeTx,
-        collection: collectionName as string,
-      },
-      schema && schema[collectionName]
-    ).entity(appendCollectionToId(collectionName, entityId));
-
-    await updater(mutation);
-  }
+  ) {}
 
   async fetch(query: CollectionQuery<ModelFromModels<M>>) {
killedBy: database transactions can update an entity in a transaction
statusReason: expected 80 to be 100 // Object.is equality

[Killed] ObjectLiteral
src/db.ts:168:7
     // TODO: i think we need to pass generics to triple store
     const schema = (await this.getSchema())?.collections as ModelFromModels<M>;
     const mutation = new Mutation<ModelFromModels<M>>(
-      {
-        transactor: this.storeTx,
-        collection: collectionName as string,
-      },
+      {},
       schema && schema[collectionName]
     ).entity(appendCollectionToId(collectionName, entityId));
killedBy: database transactions can update an entity in a transaction
statusReason: Cannot read properties of undefined (reading 'setValue')

[Killed] ConditionalExpression
src/db.ts:172:7
         transactor: this.storeTx,
         collection: collectionName as string,
       },
-      schema && schema[collectionName]
+      true
     ).entity(appendCollectionToId(collectionName, entityId));
 
killedBy: database transactions can update an entity in a transaction
statusReason: Bad path to schema

[Killed] LogicalOperator
src/db.ts:172:7
         transactor: this.storeTx,
         collection: collectionName as string,
       },
-      schema && schema[collectionName]
+      schema || schema[collectionName]
     ).entity(appendCollectionToId(collectionName, entityId));
 
killedBy: database transactions can update an entity in a transaction
statusReason: Bad path to schema

[Killed] BlockStatement
src/db.ts:178:59
     await updater(mutation);
   }
 
-  async fetch(query: CollectionQuery<ModelFromModels<M>>) {
-    return fetch(this.storeTx, query);
-  }
+  async fetch(query: CollectionQuery<ModelFromModels<M>>) {}
 
   async fetchById<Schema extends Model<any>>(
killedBy: database transactions can implicitly commit a transaction
statusReason: Cannot read properties of undefined (reading 'size')

[Killed] BlockStatement
src/db.ts:185:5
   async fetchById<Schema extends Model<any>>(
     collectionName: string,
     id: string
-  ) {
-    const entity = await this.storeTx.getEntity(
-      appendCollectionToId(collectionName, id)
-    );
-    return entity as TypeFromModel<Schema> | null;
-  }
+  ) {}
 
   async createCollection(params: CreateCollectionOperation[1]) {
killedBy: database transactions can fetch by id in a transaction
statusReason: Cannot read properties of undefined (reading 'score')

[Killed] ArrowFunction
src/db.ts:195:7
   async createCollection(params: CreateCollectionOperation[1]) {
     const { name: collectionName, attributes, rules } = params;
     const attributeTuples = Object.entries(attributes).map<EAV>(
-      ([path, attribute]) => [
-        '_schema',
-        ['collections', collectionName, 'attributes', path, 'type'],
-        attribute.type,
-      ]
+      () => undefined
     );
     const ruleTuples = !rules
killedBy: schema changes can add a collection definition to the schema
statusReason: .for is not iterable

[Killed] StringLiteral
src/db.ts:197:61
     const attributeTuples = Object.entries(attributes).map<EAV>(
       ([path, attribute]) => [
         '_schema',
-        ['collections', collectionName, 'attributes', path, 'type'],
+        ['collections', collectionName, 'attributes', path, ""],
         attribute.type,
       ]
killedBy: schema changes can add a collection definition to the schema
statusReason: Invalid type: undefined

[Killed] BooleanLiteral
src/db.ts:201:24
         attribute.type,
       ]
     );
-    const ruleTuples = !rules
+    const ruleTuples = rules
       ? []
       : (
killedBy: schema changes can add a collection definition to the schema
statusReason: Cannot read properties of undefined (reading 'read')

[NoCoverage] ArrowFunction
src/db.ts:205:19
       ? []
       : (
           ['read', 'write', 'update', 'delete'] as (keyof CollectionRules)[]
-        ).flatMap((ruleType) =>
-          rules[ruleType]?.flatMap((rule) =>
-            ruleToTuple(collectionName, ruleType, rule)
-          )
+        ).flatMap(() => undefined
         );
     // const ruleTuples = Object.entries(rules).flatMap<EAV>(([path, attribute]) => Object.entries()[

[NoCoverage] OptionalChaining
src/db.ts:206:11
       : (
           ['read', 'write', 'update', 'delete'] as (keyof CollectionRules)[]
         ).flatMap((ruleType) =>
-          rules[ruleType]?.flatMap((rule) =>
+          rules[ruleType].flatMap((rule) =>
             ruleToTuple(collectionName, ruleType, rule)
           )

[NoCoverage] ArrowFunction
src/db.ts:206:36
       : (
           ['read', 'write', 'update', 'delete'] as (keyof CollectionRules)[]
         ).flatMap((ruleType) =>
-          rules[ruleType]?.flatMap((rule) =>
-            ruleToTuple(collectionName, ruleType, rule)
+          rules[ruleType]?.flatMap(() => undefined
           )
         );

[Killed] BlockStatement
src/db.ts:221:60
     ]);
   }
 
-  async dropCollection(params: DropCollectionOperation[1]) {
-    const { name: collectionName } = params;
-    // DELETE SCHEMA INFO
-    const existingAttributeInfo = await this.storeTx.readMetadataTuples(
-      '_schema',
-      ['collections', collectionName]
-    );
-    const deletes = existingAttributeInfo.map<[string, AttributeItem[]]>(
-      (eav) => [eav[0], eav[1]]
-    );
-    await this.storeTx.deleteMetadataTuples(deletes);
-
-    // DELETE DATA
-    // TODO: check _collection marker too?
-    // const attribute = [collectionName];
-    // const currentTriples = this.storeTx.findByAttribute(attribute);
-    // this.storeTx.deleteTriples(currentTriples);
-  }
+  async dropCollection(params: DropCollectionOperation[1]) {}
 
   async renameAttribute(params: RenameAttributeOperation[1]) {
killedBy: schema changes can drop a collection definition from the schema
statusReason: expected { …(1) } to not have property "students"

[Killed] StringLiteral
src/db.ts:226:8
     // DELETE SCHEMA INFO
     const existingAttributeInfo = await this.storeTx.readMetadataTuples(
       '_schema',
-      ['collections', collectionName]
+      ["", collectionName]
     );
     const deletes = existingAttributeInfo.map<[string, AttributeItem[]]>(
killedBy: schema changes can drop a collection definition from the schema
statusReason: expected { …(1) } to not have property "students"

[Killed] ArrowFunction
src/db.ts:229:7
       ['collections', collectionName]
     );
     const deletes = existingAttributeInfo.map<[string, AttributeItem[]]>(
-      (eav) => [eav[0], eav[1]]
+      () => undefined
     );
     await this.storeTx.deleteMetadataTuples(deletes);
killedBy: schema changes can drop a collection definition from the schema
statusReason: .for is not iterable

[Killed] ConditionalExpression
src/db.ts:243:9
   async renameAttribute(params: RenameAttributeOperation[1]) {
     const { collection: collectionName, path, newPath } = params;
     // Update schema if there is schema
-    if (await this.getSchema()) {
+    if (false) {
       const existingAttributeInfo = await this.storeTx.readMetadataTuples(
         '_schema',
killedBy: schema changes can rename an attribute
statusReason: Path studentId does not exist in model.

[Killed] BlockStatement
src/db.ts:243:33
   async renameAttribute(params: RenameAttributeOperation[1]) {
     const { collection: collectionName, path, newPath } = params;
     // Update schema if there is schema
-    if (await this.getSchema()) {
-      const existingAttributeInfo = await this.storeTx.readMetadataTuples(
-        '_schema',
-        ['collections', collectionName, 'attributes', path]
-      );
-      // Delete old attribute tuples
-      const deletes = existingAttributeInfo.map<[string, AttributeItem[]]>(
-        (eav) => [eav[0], eav[1]]
-      );
-      // Upsert new attribute tuples
-      const updates = existingAttributeInfo.map<EAV>((eav) => {
-        const attr = [...eav[1]];
-        // ['collections', collectionName, 'attributes'] is prefix
-        attr.splice(3, 1, newPath); // Logic may change if path and new path arent strings
-        return [eav[0], attr, eav[2]];
-      });
-      await this.storeTx.deleteMetadataTuples(deletes);
-      await this.storeTx.updateMetadataTuples(updates);
-    }
+    if (await this.getSchema()) {}
     // Update data in place
     // For each storage scope, find all triples with the attribute and update them
killedBy: schema changes can rename an attribute
statusReason: Path studentId does not exist in model.

[Killed] ArrayDeclaration
src/db.ts:250:18
       );
       // Delete old attribute tuples
       const deletes = existingAttributeInfo.map<[string, AttributeItem[]]>(
-        (eav) => [eav[0], eav[1]]
+        (eav) => []
       );
       // Upsert new attribute tuples
killedBy: schema changes can rename an attribute
statusReason: Unknown value type: undefined

[Killed] BlockStatement
src/db.ts:253:63
         (eav) => [eav[0], eav[1]]
       );
       // Upsert new attribute tuples
-      const updates = existingAttributeInfo.map<EAV>((eav) => {
-        const attr = [...eav[1]];
-        // ['collections', collectionName, 'attributes'] is prefix
-        attr.splice(3, 1, newPath); // Logic may change if path and new path arent strings
-        return [eav[0], attr, eav[2]];
-      });
+      const updates = existingAttributeInfo.map<EAV>((eav) => {});
       await this.storeTx.deleteMetadataTuples(deletes);
       await this.storeTx.updateMetadataTuples(updates);
killedBy: schema changes can rename an attribute
statusReason: .for is not iterable

[Killed] ArrayDeclaration
src/db.ts:257:16
         const attr = [...eav[1]];
         // ['collections', collectionName, 'attributes'] is prefix
         attr.splice(3, 1, newPath); // Logic may change if path and new path arent strings
-        return [eav[0], attr, eav[2]];
+        return [];
       });
       await this.storeTx.deleteMetadataTuples(deletes);
killedBy: schema changes can rename an attribute
statusReason: attribute is not iterable

[Killed] BlockStatement
src/db.ts:264:79
     }
     // Update data in place
     // For each storage scope, find all triples with the attribute and update them
-    for (const storageKey of Object.keys(this.storeTx.tupleTx.store.storage)) {
-      const attribute = [collectionName, path];
-      const newAttribute = [collectionName, newPath];
-      const scopedTx = this.storeTx.withScope({
-        read: [storageKey],
-        write: [storageKey],
-      });
-      const currentTriples = await scopedTx.findByAttribute(attribute);
-      const newTriples = transformTripleAttribute(
-        currentTriples,
-        attribute,
-        newAttribute
-      );
-      await scopedTx.deleteTriples(currentTriples);
-      await scopedTx.insertTriples(newTriples);
-    }
+    for (const storageKey of Object.keys(this.storeTx.tupleTx.store.storage)) {}
   }
 
killedBy: schema changes can rename an attribute
statusReason: expected Map{} to have a size of 1 but got +0

[Killed] ArrayDeclaration
src/db.ts:265:25
     // Update data in place
     // For each storage scope, find all triples with the attribute and update them
     for (const storageKey of Object.keys(this.storeTx.tupleTx.store.storage)) {
-      const attribute = [collectionName, path];
+      const attribute = [];
       const newAttribute = [collectionName, newPath];
       const scopedTx = this.storeTx.withScope({
killedBy: schema changes can rename an attribute
statusReason: Bad path to schema

[Killed] ArrayDeclaration
src/db.ts:268:15
       const attribute = [collectionName, path];
       const newAttribute = [collectionName, newPath];
       const scopedTx = this.storeTx.withScope({
-        read: [storageKey],
+        read: [],
         write: [storageKey],
       });
killedBy: schema changes can rename an attribute
statusReason: expected Map{} to have a size of 1 but got +0

[Survived] ArrayDeclaration
src/db.ts:269:16
       const newAttribute = [collectionName, newPath];
       const scopedTx = this.storeTx.withScope({
         read: [storageKey],
-        write: [storageKey],
+        write: [],
       });
       const currentTriples = await scopedTx.findByAttribute(attribute);

[Killed] BlockStatement
src/db.ts:282:56
     }
   }
 
-  async addAttribute(params: AddAttributeOperation[1]) {
-    const { collection: collectionName, path, attribute } = params;
-    // Update schema if there is schema
-    if (await this.getSchema()) {
-      const updates: EAV[] = Object.entries(attribute).map(([key, value]) => {
-        return [
-          '_schema',
-          ['collections', collectionName, 'attributes', path, key],
-          value,
-        ];
-      });
-      await this.storeTx.updateMetadataTuples(updates);
-    }
-  }
+  async addAttribute(params: AddAttributeOperation[1]) {}
 
   async dropAttribute(params: DropAttributeOperation[1]) {
killedBy: schema changes can add an attribute
statusReason: expected { …(2) } to have property "age"

[Killed] BlockStatement
src/db.ts:285:33
   async addAttribute(params: AddAttributeOperation[1]) {
     const { collection: collectionName, path, attribute } = params;
     // Update schema if there is schema
-    if (await this.getSchema()) {
-      const updates: EAV[] = Object.entries(attribute).map(([key, value]) => {
-        return [
-          '_schema',
-          ['collections', collectionName, 'attributes', path, key],
-          value,
-        ];
-      });
-      await this.storeTx.updateMetadataTuples(updates);
-    }
+    if (await this.getSchema()) {}
   }
 
killedBy: schema changes can add an attribute
statusReason: expected { …(2) } to have property "age"

[Killed] BlockStatement
src/db.ts:286:78
     const { collection: collectionName, path, attribute } = params;
     // Update schema if there is schema
     if (await this.getSchema()) {
-      const updates: EAV[] = Object.entries(attribute).map(([key, value]) => {
-        return [
-          '_schema',
-          ['collections', collectionName, 'attributes', path, key],
-          value,
-        ];
-      });
+      const updates: EAV[] = Object.entries(attribute).map(([key, value]) => {});
       await this.storeTx.updateMetadataTuples(updates);
     }
killedBy: schema changes can add an attribute
statusReason: .for is not iterable

[Killed] StringLiteral
src/db.ts:288:11
     if (await this.getSchema()) {
       const updates: EAV[] = Object.entries(attribute).map(([key, value]) => {
         return [
-          '_schema',
+          "",
           ['collections', collectionName, 'attributes', path, key],
           value,
killedBy: schema changes can add an attribute
statusReason: expected { …(2) } to have property "age"

[Killed] StringLiteral
src/db.ts:289:43
       const updates: EAV[] = Object.entries(attribute).map(([key, value]) => {
         return [
           '_schema',
-          ['collections', collectionName, 'attributes', path, key],
+          ['collections', collectionName, "", path, key],
           value,
         ];
killedBy: schema changes can add an attribute
statusReason: expected { …(2) } to have property "age"

[Killed] BlockStatement
src/db.ts:297:58
     }
   }
 
-  async dropAttribute(params: DropAttributeOperation[1]) {
-    const { collection: collectionName, path } = params;
-    // Update schema if there is schema
-    if (await this.getSchema()) {
-      const existingAttributeInfo = await this.storeTx.readMetadataTuples(
-        '_schema',
-        ['collections', collectionName, 'attributes', path]
-      );
-      // Delete old attribute tuples
-      const deletes = existingAttributeInfo.map<[string, AttributeItem[]]>(
-        (eav) => [eav[0], eav[1]]
-      );
-      await this.storeTx.deleteMetadataTuples(deletes);
-    }
-
-    // TODO: check _collection marker too?
-    // const attribute = [collectionName, path];
-    // const currentTriples = this.storeTx.findByAttribute(attribute);
-    // this.storeTx.deleteTriples(currentTriples);
-  }
+  async dropAttribute(params: DropAttributeOperation[1]) {}
 }
 
killedBy: schema changes can drop an attribute
statusReason: expected { …(2) } to not have property "id"

[Killed] BlockStatement
src/db.ts:300:33
   async dropAttribute(params: DropAttributeOperation[1]) {
     const { collection: collectionName, path } = params;
     // Update schema if there is schema
-    if (await this.getSchema()) {
-      const existingAttributeInfo = await this.storeTx.readMetadataTuples(
-        '_schema',
-        ['collections', collectionName, 'attributes', path]
-      );
-      // Delete old attribute tuples
-      const deletes = existingAttributeInfo.map<[string, AttributeItem[]]>(
-        (eav) => [eav[0], eav[1]]
-      );
-      await this.storeTx.deleteMetadataTuples(deletes);
-    }
+    if (await this.getSchema()) {}
 
     // TODO: check _collection marker too?
killedBy: schema changes can drop an attribute
statusReason: expected { …(2) } to not have property "id"

[Killed] StringLiteral
src/db.ts:302:9
     // Update schema if there is schema
     if (await this.getSchema()) {
       const existingAttributeInfo = await this.storeTx.readMetadataTuples(
-        '_schema',
+        "",
         ['collections', collectionName, 'attributes', path]
       );
killedBy: schema changes can drop an attribute
statusReason: expected { …(2) } to not have property "id"

[Killed] ArrayDeclaration
src/db.ts:303:9
     if (await this.getSchema()) {
       const existingAttributeInfo = await this.storeTx.readMetadataTuples(
         '_schema',
-        ['collections', collectionName, 'attributes', path]
+        []
       );
       // Delete old attribute tuples
killedBy: schema changes can drop an attribute
statusReason: Cannot convert undefined or null to object

[Survived] LogicalOperator
src/db.ts:332:24
     clock,
   }: DBConfig<M> = {}) {
     // If only one source is provided, use the default key
-    const sourcesMap = sources ?? {
-      [DEFAULT_STORE_KEY]: source ?? new MemoryStorage(),
-    };
+    const sourcesMap = sources && {
+  [DEFAULT_STORE_KEY]: source ?? new MemoryStorage()
+};
     if (Object.keys(sourcesMap).length === 0)
       throw new Error('No triple stores provided.');

[Killed] LogicalOperator
src/db.ts:333:28
   }: DBConfig<M> = {}) {
     // If only one source is provided, use the default key
     const sourcesMap = sources ?? {
-      [DEFAULT_STORE_KEY]: source ?? new MemoryStorage(),
+      [DEFAULT_STORE_KEY]: source && new MemoryStorage(),
     };
     if (Object.keys(sourcesMap).length === 0)
killedBy: Database API can furnish the client id
statusReason: Cannot read properties of undefined (reading 'scan')

[Survived] ConditionalExpression
src/db.ts:335:9
     const sourcesMap = sources ?? {
       [DEFAULT_STORE_KEY]: source ?? new MemoryStorage(),
     };
-    if (Object.keys(sourcesMap).length === 0)
+    if (false)
       throw new Error('No triple stores provided.');
 

[Survived] EqualityOperator
src/db.ts:335:9
     const sourcesMap = sources ?? {
       [DEFAULT_STORE_KEY]: source ?? new MemoryStorage(),
     };
-    if (Object.keys(sourcesMap).length === 0)
+    if (Object.keys(sourcesMap).length !== 0)
       throw new Error('No triple stores provided.');
 

[Survived] ConditionalExpression
src/db.ts:338:9
     if (Object.keys(sourcesMap).length === 0)
       throw new Error('No triple stores provided.');
 
-    if (schema && migrations)
+    if (false)
       throw new Error('Cannot provide both schema and migrations');
 

[Survived] LogicalOperator
src/db.ts:338:9
     if (Object.keys(sourcesMap).length === 0)
       throw new Error('No triple stores provided.');
 
-    if (schema && migrations)
+    if (schema || migrations)
       throw new Error('Cannot provide both schema and migrations');
 

[NoCoverage] StringLiteral
src/db.ts:339:23
       throw new Error('No triple stores provided.');
 
     if (schema && migrations)
-      throw new Error('Cannot provide both schema and migrations');
+      throw new Error("");
 
     // If a schema is provided, assume using schema but no migrations (keep at version 0)

[Killed] BlockStatement
src/db.ts:358:23
       : Promise.resolve();
   }
 
-  async getClientId() {
-    const ts = await this.tripleStore.clock.getCurrentTimestamp();
-    return ts[1];
-  }
+  async getClientId() {}
 
   async getSchema(full: true): Promise<StoreSchema<M>>;
killedBy: Database API can furnish the client id
statusReason: expected undefined to be truthy

[Killed] BlockStatement
src/db.ts:373:42
       ? undefined
       : never
   >;
-  async getSchema(full: boolean = false) {
-    await this.ensureMigrated;
-    const tripleStoreSchema = await this.tripleStore.readSchema();
-    if (full) return tripleStoreSchema;
-    return tripleStoreSchema?.collections;
-  }
+  async getSchema(full: boolean = false) {}
 
   async getCollectionSchema<CN extends CollectionNameFromModels<M>>(
killedBy: Set operations can add to set
statusReason: Received an unexpected value ([object Object]) for path employees in entity [object Object] interpreted as undefined. This is likely caused by a missing or incorrect schema, or because a filter path was provided that does not lead to a leaf attribute in the entity

[Killed] BooleanLiteral
src/db.ts:373:35
       ? undefined
       : never
   >;
-  async getSchema(full: boolean = false) {
+  async getSchema(full: boolean = true) {
     await this.ensureMigrated;
     const tripleStoreSchema = await this.tripleStore.readSchema();
killedBy: Set operations can add to set
statusReason: Bad path to schema

[Killed] ConditionalExpression
src/db.ts:376:9
   async getSchema(full: boolean = false) {
     await this.ensureMigrated;
     const tripleStoreSchema = await this.tripleStore.readSchema();
-    if (full) return tripleStoreSchema;
+    if (true) return tripleStoreSchema;
     return tripleStoreSchema?.collections;
   }
killedBy: Set operations can add to set
statusReason: Bad path to schema

[Killed] ConditionalExpression
src/db.ts:376:9
   async getSchema(full: boolean = false) {
     await this.ensureMigrated;
     const tripleStoreSchema = await this.tripleStore.readSchema();
-    if (full) return tripleStoreSchema;
+    if (false) return tripleStoreSchema;
     return tripleStoreSchema?.collections;
   }
killedBy: migrations will only run migrations if version and parent pointer match
statusReason: expected undefined to deeply equal 4

[Killed] OptionalChaining
src/db.ts:377:12
     await this.ensureMigrated;
     const tripleStoreSchema = await this.tripleStore.readSchema();
     if (full) return tripleStoreSchema;
-    return tripleStoreSchema?.collections;
+    return tripleStoreSchema.collections;
   }
 
killedBy: Database API can furnish the client id
statusReason: Cannot read properties of undefined (reading 'collections')

[Killed] BlockStatement
src/db.ts:382:5
 
   async getCollectionSchema<CN extends CollectionNameFromModels<M>>(
     collectionName: CN
-  ) {
-    const collections = await this.getSchema();
-    if (!collections) return undefined;
-    // TODO: i think we need some stuff in the triple store...
-    const collectionSchema = collections[collectionName] as ModelFromModels<
-      M,
-      CN
-    >;
-    return {
-      ...collectionSchema,
-      rules: { read: [], write: { filter: [['text', 'LIKE', 'Day %']] } },
-    };
-  }
+  ) {}
 
   static ABORT_TRANSACTION = Symbol('abort transaction');
killedBy: Set operations can add to set
statusReason: Received an unexpected value ([object Object]) for path employees in entity [object Object] interpreted as undefined. This is likely caused by a missing or incorrect schema, or because a filter path was provided that does not lead to a leaf attribute in the entity

[Killed] ConditionalExpression
src/db.ts:384:9
     collectionName: CN
   ) {
     const collections = await this.getSchema();
-    if (!collections) return undefined;
+    if (false) return undefined;
     // TODO: i think we need some stuff in the triple store...
     const collectionSchema = collections[collectionName] as ModelFromModels<
killedBy: Database API can furnish the client id
statusReason: Cannot read properties of undefined (reading 'Student')

[Killed] BooleanLiteral
src/db.ts:384:9
     collectionName: CN
   ) {
     const collections = await this.getSchema();
-    if (!collections) return undefined;
+    if (collections) return undefined;
     // TODO: i think we need some stuff in the triple store...
     const collectionSchema = collections[collectionName] as ModelFromModels<
killedBy: Database API can furnish the client id
statusReason: Cannot read properties of undefined (reading 'Student')

[Killed] ObjectLiteral
src/db.ts:390:12
       M,
       CN
     >;
-    return {
-      ...collectionSchema,
-      rules: { read: [], write: { filter: [['text', 'LIKE', 'Day %']] } },
-    };
+    return {};
   }
 
killedBy: Set operations can add to set
statusReason: Cannot read properties of undefined (reading 'write')
