[Survived] StringLiteral
src/db.ts:392:45
     >;
     return {
       ...collectionSchema,
-      rules: { read: [], write: { filter: [['text', 'LIKE', 'Day %']] } },
+      rules: { read: [], write: { filter: [["", 'LIKE', 'Day %']] } },
     };
   }

[Survived] ObjectLiteral
src/db.ts:392:33
     >;
     return {
       ...collectionSchema,
-      rules: { read: [], write: { filter: [['text', 'LIKE', 'Day %']] } },
+      rules: { read: [], write: {} },
     };
   }

[Survived] StringLiteral
src/db.ts:396:37
     };
   }
 
-  static ABORT_TRANSACTION = Symbol('abort transaction');
+  static ABORT_TRANSACTION = Symbol("");
 
   async transact(

[Killed] BlockStatement
src/db.ts:401:5
   async transact(
     callback: (tx: DBTransaction<M>) => Promise<void>,
     storeScope?: { read: string[]; write: string[] }
-  ) {
-    await this.ensureMigrated;
-    await this.tripleStore.transact(async (tripTx) => {
-      const tx = new DBTransaction<M>(tripTx);
-      return await callback(tx);
-      // await tx.commit();
-    }, storeScope);
-  }
+  ) {}
 
   async fetch(query: CollectionQuery<ModelFromModels<M>>, scope?: string[]) {
killedBy: database transactions can implicitly commit a transaction
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/db.ts:403:55
     storeScope?: { read: string[]; write: string[] }
   ) {
     await this.ensureMigrated;
-    await this.tripleStore.transact(async (tripTx) => {
-      const tx = new DBTransaction<M>(tripTx);
-      return await callback(tx);
-      // await tx.commit();
-    }, storeScope);
+    await this.tripleStore.transact(async (tripTx) => {}, storeScope);
   }
 
killedBy: Database API will throw an error if the provided entity id has a # sign in it
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/db.ts:410:77
     }, storeScope);
   }
 
-  async fetch(query: CollectionQuery<ModelFromModels<M>>, scope?: string[]) {
-    await this.ensureMigrated;
-    // TODO: need to unfuck collectionquery typing
-    const schema = await this.getCollectionSchema(
-      query.collectionName as CollectionNameFromModels<M>
-    );
-    // if (schema.rules.read) {
-    // }
-    return await fetch(
-      scope ? this.tripleStore.setStorageScope(scope) : this.tripleStore,
-      query,
-      { schema, includeTriples: false }
-    );
-  }
+  async fetch(query: CollectionQuery<ModelFromModels<M>>, scope?: string[]) {}
 
   // TODO: we could probably infer a type here
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'size')

[Killed] BooleanLiteral
src/db.ts:421:33
     return await fetch(
       scope ? this.tripleStore.setStorageScope(scope) : this.tripleStore,
       query,
-      { schema, includeTriples: false }
+      { schema, includeTriples: true }
     );
   }
killedBy: Database API supports basic queries with filters
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ObjectLiteral
src/db.ts:421:7
     return await fetch(
       scope ? this.tripleStore.setStorageScope(scope) : this.tripleStore,
       query,
-      { schema, includeTriples: false }
+      {}
     );
   }
killedBy: Set operations can add to set
statusReason: Received an unexpected value ([object Object]) for path employees in entity [object Object] interpreted as undefined. This is likely caused by a missing or incorrect schema, or because a filter path was provided that does not lead to a leaf attribute in the entity

[Killed] BlockStatement
src/db.ts:429:5
   async fetchById<Schema extends Model<any>>(
     collectionName: string,
     id: string
-  ) {
-    const entity = await this.tripleStore.getEntity(
-      appendCollectionToId(collectionName, id)
-    );
-    return entity as TypeFromModel<Schema> | null;
-  }
+  ) {}
 
   async insert(
killedBy: Database API can lookup entity by Id
statusReason: expected undefined to be null

[Killed] BlockStatement
src/db.ts:441:5
     doc: any,
     id?: string,
     storeScope?: { read: string[]; write: string[] }
-  ) {
-    if (id && !isValidExternalId(id)) {
-      throw new Error(`Invalid ID: ${id} cannot include ${ID_SEPARATOR}`);
-    }
-    await this.ensureMigrated;
-    const schema = await this.getCollectionSchema(
-      collectionName as CollectionNameFromModels<M>
-    );
-
-    if (schema?.rules.write) {
-    }
-
-    await this.tripleStore.transact(async (tx) => {
-      await Document.insert(
-        tx,
-        appendCollectionToId(collectionName, id ?? nanoid()),
-        doc,
-        tx.clock,
-        collectionName
-      );
-    }, storeScope);
-  }
+  ) {}
 
   subscribe<Q extends CollectionQuery<ModelFromModels<M>>>(
killedBy: Database API will throw an error if the provided entity id has a # sign in it
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/db.ts:442:9
     id?: string,
     storeScope?: { read: string[]; write: string[] }
   ) {
-    if (id && !isValidExternalId(id)) {
+    if (true) {
       throw new Error(`Invalid ID: ${id} cannot include ${ID_SEPARATOR}`);
     }
killedBy: Database API can furnish the client id
statusReason: Invalid ID: student-1 cannot include #

[Killed] BooleanLiteral
src/db.ts:442:15
     id?: string,
     storeScope?: { read: string[]; write: string[] }
   ) {
-    if (id && !isValidExternalId(id)) {
+    if (id && isValidExternalId(id)) {
       throw new Error(`Invalid ID: ${id} cannot include ${ID_SEPARATOR}`);
     }
killedBy: Database API can furnish the client id
statusReason: Invalid ID: student-1 cannot include #

[Killed] OptionalChaining
src/db.ts:450:9
       collectionName as CollectionNameFromModels<M>
     );
 
-    if (schema?.rules.write) {
+    if (schema.rules.write) {
     }
 
killedBy: Database API can furnish the client id
statusReason: Cannot read properties of undefined (reading 'rules')

[Survived] ConditionalExpression
src/db.ts:450:9
       collectionName as CollectionNameFromModels<M>
     );
 
-    if (schema?.rules.write) {
+    if (false) {
     }
 

[Killed] BlockStatement
src/db.ts:453:51
     if (schema?.rules.write) {
     }
 
-    await this.tripleStore.transact(async (tx) => {
-      await Document.insert(
-        tx,
-        appendCollectionToId(collectionName, id ?? nanoid()),
-        doc,
-        tx.clock,
-        collectionName
-      );
-    }, storeScope);
+    await this.tripleStore.transact(async (tx) => {}, storeScope);
   }
 
killedBy: Database API can lookup entity by Id
statusReason: expected null not to be null

[Killed] LogicalOperator
src/db.ts:456:46
     await this.tripleStore.transact(async (tx) => {
       await Document.insert(
         tx,
-        appendCollectionToId(collectionName, id ?? nanoid()),
+        appendCollectionToId(collectionName, id && nanoid()),
         doc,
         tx.clock,
killedBy: Database API can lookup entity by Id
statusReason: expected null not to be null

[Killed] BlockStatement
src/db.ts:468:5
     query: Q,
     callback: (results: FetchResult<Q>) => void,
     scope?: string[]
-  ) {
-    const startSubscription = async () => {
-      // TODO: get rid of this "as" here
-      const schema = await this.getCollectionSchema(
-        query.collectionName as CollectionNameFromModels<M>
-      );
-
-      const unsub = subscribe(
-        scope ? this.tripleStore.setStorageScope(scope) : this.tripleStore,
-        query,
-        callback,
-        schema
-      );
-      return unsub;
-    };
-
-    const unsubPromise = startSubscription();
-
-    return async () => {
-      const unsub = await unsubPromise;
-      return unsub();
-    };
-  }
+  ) {}
 
   subscribeTriples<Q extends CollectionQuery<ModelFromModels<M>>>(
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/db.ts:469:43
     callback: (results: FetchResult<Q>) => void,
     scope?: string[]
   ) {
-    const startSubscription = async () => {
-      // TODO: get rid of this "as" here
-      const schema = await this.getCollectionSchema(
-        query.collectionName as CollectionNameFromModels<M>
-      );
-
-      const unsub = subscribe(
-        scope ? this.tripleStore.setStorageScope(scope) : this.tripleStore,
-        query,
-        callback,
-        schema
-      );
-      return unsub;
-    };
+    const startSubscription = async () => {};
 
     const unsubPromise = startSubscription();
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] BlockStatement
src/db.ts:486:24
 
     const unsubPromise = startSubscription();
 
-    return async () => {
-      const unsub = await unsubPromise;
-      return unsub();
-    };
+    return async () => {};
   }
 

[Killed] BlockStatement
src/db.ts:496:5
     query: Q,
     callback: (results: TripleRow[]) => void,
     scope?: string[]
-  ) {
-    const startSubscription = async () => {
-      const schema = await this.getCollectionSchema(
-        query.collectionName as CollectionNameFromModels<M>
-      );
-
-      const unsub = subscribeTriples(
-        scope ? this.tripleStore.setStorageScope(scope) : this.tripleStore,
-        query,
-        callback,
-        schema
-      );
-      return unsub;
-    };
-
-    const unsubPromise = startSubscription();
-
-    return async () => {
-      const unsub = await unsubPromise;
-      return unsub();
-    };
-  }
+  ) {}
 
   async update<CN extends CollectionNameFromModels<M>>(
killedBy: subscriptions can subscribe to just triples
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/db.ts:497:43
     callback: (results: TripleRow[]) => void,
     scope?: string[]
   ) {
-    const startSubscription = async () => {
-      const schema = await this.getCollectionSchema(
-        query.collectionName as CollectionNameFromModels<M>
-      );
-
-      const unsub = subscribeTriples(
-        scope ? this.tripleStore.setStorageScope(scope) : this.tripleStore,
-        query,
-        callback,
-        schema
-      );
-      return unsub;
-    };
+    const startSubscription = async () => {};
 
     const unsubPromise = startSubscription();
killedBy: subscriptions can subscribe to just triples
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/db.ts:524:5
     entityId: string,
     updater: (mutation: Mutation<ModelFromModels<M, CN>>) => Promise<void>,
     storeScope?: { read: string[]; write: string[] }
-  ) {
-    await this.ensureMigrated;
-    const schema = await this.getCollectionSchema(collectionName);
-    return this.tripleStore.transact(async (tx) => {
-      const mutation = new Mutation<ModelFromModels<M, CN>>(
-        {
-          transactor: tx,
-          collection: collectionName as string,
-        },
-        schema
-      ).entity(appendCollectionToId(collectionName, entityId));
-
-      await updater(mutation);
-    }, storeScope);
-  }
+  ) {}
 
   query<CN extends CollectionNameFromModels<M>>(
killedBy: Register operations can set register
statusReason: expected Map{} to have a size of +0 but got 1

[Killed] BlockStatement
src/db.ts:527:52
   ) {
     await this.ensureMigrated;
     const schema = await this.getCollectionSchema(collectionName);
-    return this.tripleStore.transact(async (tx) => {
-      const mutation = new Mutation<ModelFromModels<M, CN>>(
-        {
-          transactor: tx,
-          collection: collectionName as string,
-        },
-        schema
-      ).entity(appendCollectionToId(collectionName, entityId));
-
-      await updater(mutation);
-    }, storeScope);
+    return this.tripleStore.transact(async (tx) => {}, storeScope);
   }
 
killedBy: Register operations can set register
statusReason: expected Map{} to have a size of +0 but got 1

[Killed] BlockStatement
src/db.ts:543:5
   query<CN extends CollectionNameFromModels<M>>(
     collectionName: CN,
     params?: Query<ModelFromModels<M, CN>>
-  ) {
-    return CollectionQueryBuilder(
-      collectionName as string,
-      // I think TS is mad that we're not passing the generic type down to the schema
-      // this.schema is of type Models<any, any>, collection query is expecting us to use the generic type M
-      // Passing down the generic touched a lot of things, so we're just ignoring the error for now
-      // TODO: ...pretty sure this doesnt exist anymore...can it be removed?
-      // @ts-ignore
-      this.schema && this.schema[collectionName],
-      params
-    );
-  }
+  ) {}
 
   async createCollection(params: CreateCollectionOperation[1]) {
killedBy: schema changes can rename an attribute
statusReason: Cannot read properties of undefined (reading 'where')

[Killed] LogicalOperator
src/db.ts:551:7
       // Passing down the generic touched a lot of things, so we're just ignoring the error for now
       // TODO: ...pretty sure this doesnt exist anymore...can it be removed?
       // @ts-ignore
-      this.schema && this.schema[collectionName],
+      // I think TS is mad that we're not passing the generic type down to the schema
+// this.schema is of type Models<any, any>, collection query is expecting us to use the generic type M
+// Passing down the generic touched a lot of things, so we're just ignoring the error for now
+// TODO: ...pretty sure this doesnt exist anymore...can it be removed?
+// @ts-ignore
+this.schema || this.schema[collectionName],
       params
     );
killedBy: schema changes can rename an attribute
statusReason: Cannot read properties of undefined (reading 'students')

[Survived] ConditionalExpression
src/db.ts:551:7
       // Passing down the generic touched a lot of things, so we're just ignoring the error for now
       // TODO: ...pretty sure this doesnt exist anymore...can it be removed?
       // @ts-ignore
-      this.schema && this.schema[collectionName],
+      false,
       params
     );

[Killed] BlockStatement
src/db.ts:556:64
     );
   }
 
-  async createCollection(params: CreateCollectionOperation[1]) {
-    await this.tripleStore.transact(async (tripTx) => {
-      const tx = new DBTransaction(tripTx);
-      await tx.createCollection(params);
-    });
-  }
+  async createCollection(params: CreateCollectionOperation[1]) {}
 
   async dropCollection(params: DropCollectionOperation[1]) {
killedBy: schema changes can add a collection definition to the schema
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
src/db.ts:557:55
   }
 
   async createCollection(params: CreateCollectionOperation[1]) {
-    await this.tripleStore.transact(async (tripTx) => {
-      const tx = new DBTransaction(tripTx);
-      await tx.createCollection(params);
-    });
+    await this.tripleStore.transact(async (tripTx) => {});
   }
 
killedBy: schema changes can add a collection definition to the schema
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
src/db.ts:563:60
     });
   }
 
-  async dropCollection(params: DropCollectionOperation[1]) {
-    await this.tripleStore.transact(async (tripTx) => {
-      const tx = new DBTransaction(tripTx);
-      await tx.dropCollection(params);
-    });
-  }
+  async dropCollection(params: DropCollectionOperation[1]) {}
 
   async renameAttribute(params: RenameAttributeOperation[1]) {
killedBy: schema changes can drop a collection definition from the schema
statusReason: expected { …(1) } to not have property "students"

[Killed] BlockStatement
src/db.ts:564:55
   }
 
   async dropCollection(params: DropCollectionOperation[1]) {
-    await this.tripleStore.transact(async (tripTx) => {
-      const tx = new DBTransaction(tripTx);
-      await tx.dropCollection(params);
-    });
+    await this.tripleStore.transact(async (tripTx) => {});
   }
 
killedBy: schema changes can drop a collection definition from the schema
statusReason: expected { …(1) } to not have property "students"

[Killed] BlockStatement
src/db.ts:570:62
     });
   }
 
-  async renameAttribute(params: RenameAttributeOperation[1]) {
-    await this.tripleStore.transact(async (tripTx) => {
-      const tx = new DBTransaction(tripTx);
-      await tx.renameAttribute(params);
-    });
-  }
+  async renameAttribute(params: RenameAttributeOperation[1]) {}
 
   async addAttribute(params: AddAttributeOperation[1]) {
killedBy: schema changes can rename an attribute
statusReason: expected { …(2) } to have property "studentId"

[Killed] BlockStatement
src/db.ts:571:55
   }
 
   async renameAttribute(params: RenameAttributeOperation[1]) {
-    await this.tripleStore.transact(async (tripTx) => {
-      const tx = new DBTransaction(tripTx);
-      await tx.renameAttribute(params);
-    });
+    await this.tripleStore.transact(async (tripTx) => {});
   }
 
killedBy: schema changes can rename an attribute
statusReason: expected { …(2) } to have property "studentId"

[Killed] BlockStatement
src/db.ts:577:56
     });
   }
 
-  async addAttribute(params: AddAttributeOperation[1]) {
-    await this.tripleStore.transact(async (tripTx) => {
-      const tx = new DBTransaction(tripTx);
-      await tx.addAttribute(params);
-    });
-  }
+  async addAttribute(params: AddAttributeOperation[1]) {}
 
   async dropAttribute(params: DropAttributeOperation[1]) {
killedBy: schema changes can add an attribute
statusReason: expected { …(2) } to have property "age"

[Killed] BlockStatement
src/db.ts:578:55
   }
 
   async addAttribute(params: AddAttributeOperation[1]) {
-    await this.tripleStore.transact(async (tripTx) => {
-      const tx = new DBTransaction(tripTx);
-      await tx.addAttribute(params);
-    });
+    await this.tripleStore.transact(async (tripTx) => {});
   }
 
killedBy: schema changes can add an attribute
statusReason: expected { …(2) } to have property "age"

[Killed] BlockStatement
src/db.ts:584:58
     });
   }
 
-  async dropAttribute(params: DropAttributeOperation[1]) {
-    await this.tripleStore.transact(async (tripTx) => {
-      const tx = new DBTransaction(tripTx);
-      await tx.dropAttribute(params);
-    });
-  }
+  async dropAttribute(params: DropAttributeOperation[1]) {}
 
   private async applyRemoteTransaction(operations: DBOperation[]) {
killedBy: schema changes can drop an attribute
statusReason: expected { …(2) } to not have property "id"

[Killed] BlockStatement
src/db.ts:585:55
   }
 
   async dropAttribute(params: DropAttributeOperation[1]) {
-    await this.tripleStore.transact(async (tripTx) => {
-      const tx = new DBTransaction(tripTx);
-      await tx.dropAttribute(params);
-    });
+    await this.tripleStore.transact(async (tripTx) => {});
   }
 
killedBy: schema changes can drop an attribute
statusReason: expected { …(2) } to not have property "id"

[Killed] BlockStatement
src/db.ts:592:55
   }
 
   private async applyRemoteTransaction(operations: DBOperation[]) {
-    await this.tripleStore.transact(async (tripTx) => {
-      const tx = new DBTransaction(tripTx);
-      for (const operation of operations) {
-        switch (operation[0]) {
-          case 'create_collection':
-            await tx.createCollection(operation[1]);
-            break;
-          case 'drop_collection':
-            await tx.dropCollection(operation[1]);
-            break;
-          case 'rename_attribute':
-            await tx.renameAttribute(operation[1]);
-            break;
-          case 'add_attribute':
-            await tx.addAttribute(operation[1]);
-            break;
-          case 'drop_attribute':
-            await tx.dropAttribute(operation[1]);
-            break;
-          default:
-            throw new Error(`Operation Not Implemented: ${operation[0]}`);
-        }
-      }
-    });
+    await this.tripleStore.transact(async (tripTx) => {});
   }
 
killedBy: migrations initializing a DB with migrations sets the schema
statusReason: expected {} to have property "students"

[Killed] BlockStatement
src/db.ts:594:43
   private async applyRemoteTransaction(operations: DBOperation[]) {
     await this.tripleStore.transact(async (tripTx) => {
       const tx = new DBTransaction(tripTx);
-      for (const operation of operations) {
-        switch (operation[0]) {
-          case 'create_collection':
-            await tx.createCollection(operation[1]);
-            break;
-          case 'drop_collection':
-            await tx.dropCollection(operation[1]);
-            break;
-          case 'rename_attribute':
-            await tx.renameAttribute(operation[1]);
-            break;
-          case 'add_attribute':
-            await tx.addAttribute(operation[1]);
-            break;
-          case 'drop_attribute':
-            await tx.dropAttribute(operation[1]);
-            break;
-          default:
-            throw new Error(`Operation Not Implemented: ${operation[0]}`);
-        }
-      }
+      for (const operation of operations) {}
     });
   }
killedBy: migrations initializing a DB with migrations sets the schema
statusReason: expected {} to have property "students"

[Killed] ConditionalExpression
src/db.ts:596:11
       const tx = new DBTransaction(tripTx);
       for (const operation of operations) {
         switch (operation[0]) {
-          case 'create_collection':
-            await tx.createCollection(operation[1]);
-            break;
+          case 'create_collection':
           case 'drop_collection':
             await tx.dropCollection(operation[1]);
killedBy: migrations initializing a DB with migrations sets the schema
statusReason: expected {} to have property "students"

[NoCoverage] ConditionalExpression
src/db.ts:599:11
           case 'create_collection':
             await tx.createCollection(operation[1]);
             break;
-          case 'drop_collection':
-            await tx.dropCollection(operation[1]);
-            break;
+          case 'drop_collection':
           case 'rename_attribute':
             await tx.renameAttribute(operation[1]);

[NoCoverage] ConditionalExpression
src/db.ts:602:11
           case 'drop_collection':
             await tx.dropCollection(operation[1]);
             break;
-          case 'rename_attribute':
-            await tx.renameAttribute(operation[1]);
-            break;
+          case 'rename_attribute':
           case 'add_attribute':
             await tx.addAttribute(operation[1]);

[NoCoverage] ConditionalExpression
src/db.ts:605:11
           case 'rename_attribute':
             await tx.renameAttribute(operation[1]);
             break;
-          case 'add_attribute':
-            await tx.addAttribute(operation[1]);
-            break;
+          case 'add_attribute':
           case 'drop_attribute':
             await tx.dropAttribute(operation[1]);

[NoCoverage] ConditionalExpression
src/db.ts:608:11
           case 'add_attribute':
             await tx.addAttribute(operation[1]);
             break;
-          case 'drop_attribute':
-            await tx.dropAttribute(operation[1]);
-            break;
+          case 'drop_attribute':
           default:
             throw new Error(`Operation Not Implemented: ${operation[0]}`);

[Survived] StringLiteral
src/db.ts:608:16
           case 'add_attribute':
             await tx.addAttribute(operation[1]);
             break;
-          case 'drop_attribute':
+          case "":
             await tx.dropAttribute(operation[1]);
             break;

[Killed] ConditionalExpression
src/db.ts:611:11
           case 'drop_attribute':
             await tx.dropAttribute(operation[1]);
             break;
-          default:
-            throw new Error(`Operation Not Implemented: ${operation[0]}`);
+          default:
         }
       }
killedBy: migrations will stop migrating on an error and rollback changes
statusReason: expected { …(2) } to not have property "classes"

[Killed] OptionalChaining
src/db.ts:621:25
   async migrate(migrations: Migration[], direction: 'up' | 'down') {
     for (const migration of migrations) {
       const tripleSchema = await this.tripleStore.readSchema();
-      const dbVersion = tripleSchema?.version ?? 0;
+      const dbVersion = tripleSchema.version ?? 0;
       if (canMigrate(migration, direction, dbVersion)) {
         try {
killedBy: migrations initializing a DB with migrations sets the schema
statusReason: Cannot convert undefined or null to object

[Killed] LogicalOperator
src/db.ts:621:25
   async migrate(migrations: Migration[], direction: 'up' | 'down') {
     for (const migration of migrations) {
       const tripleSchema = await this.tripleStore.readSchema();
-      const dbVersion = tripleSchema?.version ?? 0;
+      const dbVersion = tripleSchema?.version && 0;
       if (canMigrate(migration, direction, dbVersion)) {
         try {
killedBy: migrations initializing a DB with migrations sets the schema
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
src/db.ts:622:56
     for (const migration of migrations) {
       const tripleSchema = await this.tripleStore.readSchema();
       const dbVersion = tripleSchema?.version ?? 0;
-      if (canMigrate(migration, direction, dbVersion)) {
-        try {
-          await this.applyRemoteTransaction(migration[direction]);
-        } catch (e) {
-          console.error(
-            `Error applying ${direction} migration with verison`,
-            migration.version,
-            e
-          );
-          throw e;
-        }
-        // TODO: move this into the transaction
-        await this.tripleStore.updateMetadataTuples([
-          [
-            '_schema',
-            ['version'],
-            direction === 'up' ? migration.version : migration.parent,
-          ],
-        ]);
-      } else {
+      if (canMigrate(migration, direction, dbVersion)) {} else {
         console.info('skipping migration', migration);
       }
killedBy: migrations initializing a DB with migrations sets the schema
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
src/db.ts:622:11
     for (const migration of migrations) {
       const tripleSchema = await this.tripleStore.readSchema();
       const dbVersion = tripleSchema?.version ?? 0;
-      if (canMigrate(migration, direction, dbVersion)) {
+      if (false) {
         try {
           await this.applyRemoteTransaction(migration[direction]);
killedBy: migrations initializing a DB with migrations sets the schema
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
src/db.ts:623:13
       const tripleSchema = await this.tripleStore.readSchema();
       const dbVersion = tripleSchema?.version ?? 0;
       if (canMigrate(migration, direction, dbVersion)) {
-        try {
-          await this.applyRemoteTransaction(migration[direction]);
-        } catch (e) {
+        try {} catch (e) {
           console.error(
             `Error applying ${direction} migration with verison`,
killedBy: migrations initializing a DB with migrations sets the schema
statusReason: expected {} to have property "students"

[Killed] BlockStatement
src/db.ts:625:21
       if (canMigrate(migration, direction, dbVersion)) {
         try {
           await this.applyRemoteTransaction(migration[direction]);
-        } catch (e) {
-          console.error(
-            `Error applying ${direction} migration with verison`,
-            migration.version,
-            e
-          );
-          throw e;
-        }
+        } catch (e) {}
         // TODO: move this into the transaction
         await this.tripleStore.updateMetadataTuples([
killedBy: migrations will stop migrating on an error and rollback changes
statusReason: expected 2 to deeply equal 1

[Survived] StringLiteral
src/db.ts:627:13
           await this.applyRemoteTransaction(migration[direction]);
         } catch (e) {
           console.error(
-            `Error applying ${direction} migration with verison`,
+            ``,
             migration.version,
             e

[Killed] ArrayDeclaration
src/db.ts:634:53
           throw e;
         }
         // TODO: move this into the transaction
-        await this.tripleStore.updateMetadataTuples([
-          [
-            '_schema',
-            ['version'],
-            direction === 'up' ? migration.version : migration.parent,
-          ],
-        ]);
+        await this.tripleStore.updateMetadataTuples([]);
       } else {
         console.info('skipping migration', migration);
killedBy: migrations initializing a DB with migrations sets the schema
statusReason: expected { …(1) } to have property "classes"

[Killed] ConditionalExpression
src/db.ts:638:13
           [
             '_schema',
             ['version'],
-            direction === 'up' ? migration.version : migration.parent,
+            false ? migration.version : migration.parent,
           ],
         ]);
killedBy: migrations initializing a DB with migrations sets the schema
statusReason: expected { …(1) } to have property "classes"

[Killed] EqualityOperator
src/db.ts:638:13
           [
             '_schema',
             ['version'],
-            direction === 'up' ? migration.version : migration.parent,
+            direction !== 'up' ? migration.version : migration.parent,
           ],
         ]);
killedBy: migrations initializing a DB with migrations sets the schema
statusReason: expected { …(1) } to have property "classes"
