[Survived] BlockStatement
src/db.ts:641:14
             direction === 'up' ? migration.version : migration.parent,
           ],
         ]);
-      } else {
-        console.info('skipping migration', migration);
-      }
+      } else {}
     }
   }

[Killed] BlockStatement
src/db.ts:647:30
     }
   }
 
-  async getCollectionStats() {
-    const collectionMetaTriples = await this.tripleStore.findByAttribute([
-      '_collection',
-    ]);
-    // Aggregates each collection my entity count
-    const stats = collectionMetaTriples.reduce((acc, t) => {
-      const collectionName = t.value;
-      if (!acc.has(collectionName)) {
-        acc.set(collectionName, 0);
-      }
-      acc.set(collectionName, acc.get(collectionName) + 1);
-      return acc;
-    }, new Map());
-    return stats;
-  }
+  async getCollectionStats() {}
 
   async clear() {
killedBy: Database API can report basic collection stats from the database
statusReason: Cannot read properties of undefined (reading 'keys')

[Killed] ArrayDeclaration
src/db.ts:648:74
   }
 
   async getCollectionStats() {
-    const collectionMetaTriples = await this.tripleStore.findByAttribute([
-      '_collection',
-    ]);
+    const collectionMetaTriples = await this.tripleStore.findByAttribute([]);
     // Aggregates each collection my entity count
     const stats = collectionMetaTriples.reduce((acc, t) => {
killedBy: Database API can report basic collection stats from the database
statusReason: expected [ Array(44) ] to deeply equal [ 'Class', 'Department', …(2) ]

[Killed] StringLiteral
src/db.ts:649:7
 
   async getCollectionStats() {
     const collectionMetaTriples = await this.tripleStore.findByAttribute([
-      '_collection',
+      "",
     ]);
     // Aggregates each collection my entity count
killedBy: Database API can report basic collection stats from the database
statusReason: expected [] to deeply equal [ 'Class', 'Department', …(2) ]

[Killed] BlockStatement
src/db.ts:652:60
       '_collection',
     ]);
     // Aggregates each collection my entity count
-    const stats = collectionMetaTriples.reduce((acc, t) => {
-      const collectionName = t.value;
-      if (!acc.has(collectionName)) {
-        acc.set(collectionName, 0);
-      }
-      acc.set(collectionName, acc.get(collectionName) + 1);
-      return acc;
-    }, new Map());
+    const stats = collectionMetaTriples.reduce((acc, t) => {}, new Map());
     return stats;
   }
killedBy: Database API can report basic collection stats from the database
statusReason: Cannot read properties of undefined (reading 'keys')

[Killed] ConditionalExpression
src/db.ts:654:11
     // Aggregates each collection my entity count
     const stats = collectionMetaTriples.reduce((acc, t) => {
       const collectionName = t.value;
-      if (!acc.has(collectionName)) {
+      if (false) {
         acc.set(collectionName, 0);
       }
killedBy: Database API can report basic collection stats from the database
statusReason: expected NaN to be 5 // Object.is equality

[Killed] ConditionalExpression
src/db.ts:654:11
     // Aggregates each collection my entity count
     const stats = collectionMetaTriples.reduce((acc, t) => {
       const collectionName = t.value;
-      if (!acc.has(collectionName)) {
+      if (true) {
         acc.set(collectionName, 0);
       }
killedBy: Database API can report basic collection stats from the database
statusReason: expected 1 to be 5 // Object.is equality

[Killed] ArithmeticOperator
src/db.ts:657:31
       if (!acc.has(collectionName)) {
         acc.set(collectionName, 0);
       }
-      acc.set(collectionName, acc.get(collectionName) + 1);
+      acc.set(collectionName, acc.get(collectionName) - 1);
       return acc;
     }, new Map());
killedBy: Database API can report basic collection stats from the database
statusReason: expected -5 to be 5 // Object.is equality

[Killed] BlockStatement
src/db.ts:663:17
     return stats;
   }
 
-  async clear() {
-    await this.tripleStore.clear();
-  }
+  async clear() {}
 }
 
killedBy: migrations Data deletion clear() removes all data from the database
statusReason: expected 13 to be +0 // Object.is equality

[Killed] BlockStatement
src/db.ts:672:3
   migration: Migration,
   direction: 'up' | 'down',
   dbVersion: number
-) {
-  if (direction === 'up') {
-    return migration.parent === dbVersion;
-  } else {
-    return migration.version === dbVersion;
-  }
-}
+) {}
 
 function transformTripleAttribute(
killedBy: migrations initializing a DB with migrations sets the schema
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
src/db.ts:673:7
   direction: 'up' | 'down',
   dbVersion: number
 ) {
-  if (direction === 'up') {
+  if (true) {
     return migration.parent === dbVersion;
   } else {
killedBy: migrations will only run migrations if version and parent pointer match
statusReason: expected 5 to deeply equal 4

[Killed] ConditionalExpression
src/db.ts:673:7
   direction: 'up' | 'down',
   dbVersion: number
 ) {
-  if (direction === 'up') {
+  if (false) {
     return migration.parent === dbVersion;
   } else {
killedBy: migrations initializing a DB with migrations sets the schema
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
src/db.ts:674:12
   dbVersion: number
 ) {
   if (direction === 'up') {
-    return migration.parent === dbVersion;
+    return false;
   } else {
     return migration.version === dbVersion;
killedBy: migrations initializing a DB with migrations sets the schema
statusReason: Cannot convert undefined or null to object

[Killed] EqualityOperator
src/db.ts:674:12
   dbVersion: number
 ) {
   if (direction === 'up') {
-    return migration.parent === dbVersion;
+    return migration.parent !== dbVersion;
   } else {
     return migration.version === dbVersion;
killedBy: migrations initializing a DB with migrations sets the schema
statusReason: expected { …(1) } to have property "students"

[Killed] BlockStatement
src/db.ts:675:10
 ) {
   if (direction === 'up') {
     return migration.parent === dbVersion;
-  } else {
-    return migration.version === dbVersion;
-  }
+  } else {}
 }
 
killedBy: migrations will only run migrations if version and parent pointer match
statusReason: expected 5 to deeply equal 4

[Killed] ConditionalExpression
src/db.ts:676:12
   if (direction === 'up') {
     return migration.parent === dbVersion;
   } else {
-    return migration.version === dbVersion;
+    return true;
   }
 }
killedBy: migrations will only run migrations if version and parent pointer match
statusReason: expected 3 to deeply equal 4

[Killed] ConditionalExpression
src/db.ts:676:12
   if (direction === 'up') {
     return migration.parent === dbVersion;
   } else {
-    return migration.version === dbVersion;
+    return false;
   }
 }
killedBy: migrations will only run migrations if version and parent pointer match
statusReason: expected 5 to deeply equal 4

[Killed] BlockStatement
src/db.ts:684:3
   triples: TripleRow[],
   attribute: string[],
   newAttribute: string[]
-) {
-  // At some point this may not work for all data types, but for now it does
-  return triples.map<TripleRow>((triple) => {
-    const fullAttribute = [...triple.attribute];
-    fullAttribute.splice(0, attribute.length, ...newAttribute);
-    return { ...triple, attribute: fullAttribute };
-  });
-}
+) {}
 
 const ID_SEPARATOR = '#';
killedBy: schema changes can rename an attribute
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/db.ts:686:45
   newAttribute: string[]
 ) {
   // At some point this may not work for all data types, but for now it does
-  return triples.map<TripleRow>((triple) => {
-    const fullAttribute = [...triple.attribute];
-    fullAttribute.splice(0, attribute.length, ...newAttribute);
-    return { ...triple, attribute: fullAttribute };
-  });
+  return triples.map<TripleRow>((triple) => {});
 }
 
killedBy: schema changes can rename an attribute
statusReason: Cannot destructure property 'id' of 'tripleInput' as it is undefined.

[Killed] BlockStatement
src/db.ts:695:40
 
 const ID_SEPARATOR = '#';
 
-function isValidExternalId(id: string) {
-  return !String(id).includes(ID_SEPARATOR);
-}
+function isValidExternalId(id: string) {}
 
 export function appendCollectionToId(collectionName: string, id: string) {
killedBy: Database API can furnish the client id
statusReason: Invalid ID: student-1 cannot include #

[Killed] BooleanLiteral
src/db.ts:696:10
 const ID_SEPARATOR = '#';
 
 function isValidExternalId(id: string) {
-  return !String(id).includes(ID_SEPARATOR);
+  return String(id).includes(ID_SEPARATOR);
 }
 
killedBy: Database API can furnish the client id
statusReason: Invalid ID: student-1 cannot include #

[Killed] BlockStatement
src/db.ts:699:74
   return !String(id).includes(ID_SEPARATOR);
 }
 
-export function appendCollectionToId(collectionName: string, id: string) {
-  return `${collectionName}${ID_SEPARATOR}${id}`;
-}
+export function appendCollectionToId(collectionName: string, id: string) {}
 
 export function stripCollectionFromId(id: string): string {
killedBy: Database API can furnish the client id
statusReason: Unknown value type: undefined

[Killed] BlockStatement
src/db.ts:703:59
   return `${collectionName}${ID_SEPARATOR}${id}`;
 }
 
-export function stripCollectionFromId(id: string): string {
-  const parts = id.split(ID_SEPARATOR);
-  if (parts.length !== 2) {
-    throw new Error(
-      `Malformed ID: ${id} should only include one separator(${ID_SEPARATOR})`
-    );
-  }
-  return parts[1];
-}
+export function stripCollectionFromId(id: string): string {}
 
killedBy: Database API will throw an error when it parses an ID with a # in it
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/db.ts:705:27
 
 export function stripCollectionFromId(id: string): string {
   const parts = id.split(ID_SEPARATOR);
-  if (parts.length !== 2) {
-    throw new Error(
-      `Malformed ID: ${id} should only include one separator(${ID_SEPARATOR})`
-    );
-  }
+  if (parts.length !== 2) {}
   return parts[1];
 }
killedBy: Database API will throw an error when it parses an ID with a # in it
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/db.ts:705:7
 
 export function stripCollectionFromId(id: string): string {
   const parts = id.split(ID_SEPARATOR);
-  if (parts.length !== 2) {
+  if (true) {
     throw new Error(
       `Malformed ID: ${id} should only include one separator(${ID_SEPARATOR})`
killedBy: Database API supports basic queries with filters
statusReason: Malformed ID: Class#class-1 should only include one separator(#)

[Survived] StringLiteral
src/db.ts:707:7
   const parts = id.split(ID_SEPARATOR);
   if (parts.length !== 2) {
     throw new Error(
-      `Malformed ID: ${id} should only include one separator(${ID_SEPARATOR})`
+      ``
     );
   }
