[Killed] BlockStatement
src/document.ts:15:50
 ) {
   const extendedTuples = objectToTuples(document);
 
-  const avRows = extendedTuples.map((pathVal) => {
-    if (pathVal.length === 0)
-      throw new Error('Empty tuple generated for document');
-    return {
-      attribute: [
-        ...(collectionName ? [collectionName] : []),
-        ...(pathVal.slice(0, -1) as string[]),
-      ],
-      value: pathVal.at(-1) as string | number | null,
-    };
-  });
+  const avRows = extendedTuples.map((pathVal) => {});
   const timestamp = await clock.getNextTimestamp();
   const triples: TripleRow[] = avRows.map<TripleRow>(
killedBy: Database API can furnish the client id
statusReason: Cannot destructure property 'attribute' of 'undefined' as it is undefined.

[Killed] EqualityOperator
src/document.ts:16:9
   const extendedTuples = objectToTuples(document);
 
   const avRows = extendedTuples.map((pathVal) => {
-    if (pathVal.length === 0)
+    if (pathVal.length !== 0)
       throw new Error('Empty tuple generated for document');
     return {
killedBy: Database API can furnish the client id
statusReason: Empty tuple generated for document

[Killed] ConditionalExpression
src/document.ts:16:9
   const extendedTuples = objectToTuples(document);
 
   const avRows = extendedTuples.map((pathVal) => {
-    if (pathVal.length === 0)
+    if (true)
       throw new Error('Empty tuple generated for document');
     return {
killedBy: Database API can furnish the client id
statusReason: Empty tuple generated for document

[NoCoverage] StringLiteral
src/document.ts:17:23
 
   const avRows = extendedTuples.map((pathVal) => {
     if (pathVal.length === 0)
-      throw new Error('Empty tuple generated for document');
+      throw new Error("");
     return {
       attribute: [

[Killed] ObjectLiteral
src/document.ts:18:12
   const avRows = extendedTuples.map((pathVal) => {
     if (pathVal.length === 0)
       throw new Error('Empty tuple generated for document');
-    return {
-      attribute: [
-        ...(collectionName ? [collectionName] : []),
-        ...(pathVal.slice(0, -1) as string[]),
-      ],
-      value: pathVal.at(-1) as string | number | null,
-    };
+    return {};
   });
   const timestamp = await clock.getNextTimestamp();
killedBy: Database API can furnish the client id
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArrayDeclaration
src/document.ts:19:18
     if (pathVal.length === 0)
       throw new Error('Empty tuple generated for document');
     return {
-      attribute: [
-        ...(collectionName ? [collectionName] : []),
-        ...(pathVal.slice(0, -1) as string[]),
-      ],
+      attribute: [],
       value: pathVal.at(-1) as string | number | null,
     };
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArrowFunction
src/document.ts:28:5
   });
   const timestamp = await clock.getNextTimestamp();
   const triples: TripleRow[] = avRows.map<TripleRow>(
-    ({ attribute, value }) => ({
-      id,
-      attribute,
-      value,
-      timestamp,
-      expired: false,
-    })
+    () => undefined
   );
 
killedBy: Database API can furnish the client id
statusReason: Cannot destructure property 'id' of 'tripleInput' as it is undefined.

[Killed] BooleanLiteral
src/document.ts:33:16
       attribute,
       value,
       timestamp,
-      expired: false,
+      expired: true,
     })
   );
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/document.ts:37:7
     })
   );
 
-  if (collectionName) {
+  if (false) {
     triples.push({
       id,
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/document.ts:37:23
     })
   );
 
-  if (collectionName) {
-    triples.push({
-      id,
-      attribute: ['_collection'],
-      value: collectionName,
-      timestamp,
-      expired: false,
-    });
-  }
+  if (collectionName) {}
   await store.insertTriples(triples);
 }
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[Killed] StringLiteral
src/document.ts:40:19
   if (collectionName) {
     triples.push({
       id,
-      attribute: ['_collection'],
+      attribute: [""],
       value: collectionName,
       timestamp,
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality
