[NoCoverage] BlockStatement
src/entity.ts:19:6
     collectionName: string;
     model: M;
     entityId: string;
-  }) {
-    this.store = store;
-    this.collectionName = collectionName;
-    this.model = model;
-    this.id = entityId;
-  }
+  }) {}
 
   prop(propPath: keyof M['properties']) {

[NoCoverage] BlockStatement
src/entity.ts:26:41
     this.id = entityId;
   }
 
-  prop(propPath: keyof M['properties']) {
-    if (this.model.properties[propPath]['x-crdt-type'] === 'Set') {
-      return {
-        add: () => {},
-        remove: () => {},
-      };
-    } else {
-      return {
-        set: () => {},
-      };
-    }
-  }
+  prop(propPath: keyof M['properties']) {}
 }
 

[NoCoverage] EqualityOperator
src/entity.ts:27:9
   }
 
   prop(propPath: keyof M['properties']) {
-    if (this.model.properties[propPath]['x-crdt-type'] === 'Set') {
+    if (this.model.properties[propPath]['x-crdt-type'] !== 'Set') {
       return {
         add: () => {},

[NoCoverage] BlockStatement
src/entity.ts:27:67
   }
 
   prop(propPath: keyof M['properties']) {
-    if (this.model.properties[propPath]['x-crdt-type'] === 'Set') {
-      return {
-        add: () => {},
-        remove: () => {},
-      };
-    } else {
+    if (this.model.properties[propPath]['x-crdt-type'] === 'Set') {} else {
       return {
         set: () => {},

[NoCoverage] ObjectLiteral
src/entity.ts:28:14
 
   prop(propPath: keyof M['properties']) {
     if (this.model.properties[propPath]['x-crdt-type'] === 'Set') {
-      return {
-        add: () => {},
-        remove: () => {},
-      };
+      return {};
     } else {
       return {

[NoCoverage] BlockStatement
src/entity.ts:32:12
         add: () => {},
         remove: () => {},
       };
-    } else {
-      return {
-        set: () => {},
-      };
-    }
+    } else {}
   }
 }
