[Killed] BlockStatement
src/multi-tuple-store.ts:39:6
   }: {
     storage: Record<string, AsyncTupleDatabaseClient<TupleSchema>>;
     storageScope?: { read?: string[]; write?: string[] };
-  }) {
-    this.storage = storage;
-    this.storageScope = storageScope;
-  }
+  }) {}
 
   getStorageClients(context?: 'read' | 'write') {
killedBy: DurableClock creates a fresh clock if no relevant metadata
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
src/multi-tuple-store.ts:44:49
     this.storageScope = storageScope;
   }
 
-  getStorageClients(context?: 'read' | 'write') {
-    if (context && this.storageScope && this.storageScope[context]) {
-      return this.storageScope[context]!.map(
-        (storageKey) => this.storage[storageKey]
-      );
-    }
-    return Object.values(this.storage);
-  }
+  getStorageClients(context?: 'read' | 'write') {}
 
   async scan<T extends Tuple, P extends TuplePrefix<T>>(
killedBy: triple inserts can insert a single triple
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
src/multi-tuple-store.ts:45:9
   }
 
   getStorageClients(context?: 'read' | 'write') {
-    if (context && this.storageScope && this.storageScope[context]) {
+    if (true) {
       return this.storageScope[context]!.map(
         (storageKey) => this.storage[storageKey]
killedBy: DurableClock creates a fresh clock if no relevant metadata; Database API can furnish the client id
statusReason: Cannot read properties of undefined (reading 'read')

[Killed] ConditionalExpression
src/multi-tuple-store.ts:45:9
   }
 
   getStorageClients(context?: 'read' | 'write') {
-    if (context && this.storageScope && this.storageScope[context]) {
+    if (true && this.storageScope[context]) {
       return this.storageScope[context]!.map(
         (storageKey) => this.storage[storageKey]
killedBy: DurableClock creates a fresh clock if no relevant metadata; triple inserts can insert a single triple; Database API can furnish the client id
statusReason: Cannot read properties of undefined (reading 'read')

[NoCoverage] ArrowFunction
src/multi-tuple-store.ts:47:9
   getStorageClients(context?: 'read' | 'write') {
     if (context && this.storageScope && this.storageScope[context]) {
       return this.storageScope[context]!.map(
-        (storageKey) => this.storage[storageKey]
+        () => undefined
       );
     }

[Killed] BlockStatement
src/multi-tuple-store.ts:56:65
   async scan<T extends Tuple, P extends TuplePrefix<T>>(
     args?: ScanArgs<T, P> | undefined,
     txId?: string | undefined
-  ): Promise<Extract<TupleSchema, { key: TupleToObject<P> }>[]> {
-    const storages = this.getStorageClients('read');
-
-    const comparer = (a: TupleSchema, b: TupleSchema) =>
-      (compareTuple(a.key, b.key) * (args?.reverse ? -1 : 1)) as 1 | -1 | 0;
-
-    return mergeMultipleSortedArrays(
-      await Promise.all(storages.map((store) => store.scan(args, txId))),
-      comparer
-    );
-  }
+  ): Promise<Extract<TupleSchema, { key: TupleToObject<P> }>[]> {}
 
   subscribe<T extends Tuple, P extends TuplePrefix<T>>(
killedBy: triple inserts can insert a single triple; Database API can furnish the client id; DurableClock creates a fresh clock if no relevant metadata
statusReason: Cannot read properties of undefined (reading 'map')

[Survived] ArrowFunction
src/multi-tuple-store.ts:59:22
   ): Promise<Extract<TupleSchema, { key: TupleToObject<P> }>[]> {
     const storages = this.getStorageClients('read');
 
-    const comparer = (a: TupleSchema, b: TupleSchema) =>
-      (compareTuple(a.key, b.key) * (args?.reverse ? -1 : 1)) as 1 | -1 | 0;
+    const comparer = () => undefined;
 
     return mergeMultipleSortedArrays(

[Killed] ArrowFunction
src/multi-tuple-store.ts:63:38
       (compareTuple(a.key, b.key) * (args?.reverse ? -1 : 1)) as 1 | -1 | 0;
 
     return mergeMultipleSortedArrays(
-      await Promise.all(storages.map((store) => store.scan(args, txId))),
+      await Promise.all(storages.map(() => undefined)),
       comparer
     );
killedBy: DurableClock creates a fresh clock if no relevant metadata; Database API can furnish the client id
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/multi-tuple-store.ts:71:18
   subscribe<T extends Tuple, P extends TuplePrefix<T>>(
     args: ScanArgs<T, P>,
     callback: Callback<Extract<TupleSchema, { key: TupleToObject<P> }>>
-  ): Unsubscribe {
-    const unsubFuncs = this.getStorageClients('read').map((store) =>
-      store.subscribe(args, callback)
-    );
-    return () => {
-      Promise.all(unsubFuncs).then((unsubs) =>
-        unsubs.forEach((unsub) => unsub())
-      );
-    };
-  }
+  ): Unsubscribe {}
 
   // get<T extends Tuple>(
killedBy: DurableClock can read new timestamps from the store and update the clock; schema triple-store should allow the deletion of metadatatriples
statusReason: expected +0 to be 16 // Object.is equality

[Killed] ArrowFunction
src/multi-tuple-store.ts:72:59
     args: ScanArgs<T, P>,
     callback: Callback<Extract<TupleSchema, { key: TupleToObject<P> }>>
   ): Unsubscribe {
-    const unsubFuncs = this.getStorageClients('read').map((store) =>
-      store.subscribe(args, callback)
+    const unsubFuncs = this.getStorageClients('read').map(() => undefined
     );
     return () => {
killedBy: DurableClock can read new timestamps from the store and update the clock
statusReason: expected +0 to be 16 // Object.is equality

[Survived] BlockStatement
src/multi-tuple-store.ts:75:18
     const unsubFuncs = this.getStorageClients('read').map((store) =>
       store.subscribe(args, callback)
     );
-    return () => {
-      Promise.all(unsubFuncs).then((unsubs) =>
-        unsubs.forEach((unsub) => unsub())
-      );
-    };
+    return () => {};
   }
 

[Survived] ArrowFunction
src/multi-tuple-store.ts:76:36
       store.subscribe(args, callback)
     );
     return () => {
-      Promise.all(unsubFuncs).then((unsubs) =>
-        unsubs.forEach((unsub) => unsub())
+      Promise.all(unsubFuncs).then(() => undefined
       );
     };

[Survived] ArrowFunction
src/multi-tuple-store.ts:77:24
     );
     return () => {
       Promise.all(unsubFuncs).then((unsubs) =>
-        unsubs.forEach((unsub) => unsub())
+        unsubs.forEach(() => undefined)
       );
     };

[NoCoverage] BlockStatement
src/multi-tuple-store.ts:96:23
   async exists<T extends Tuple>(
     tuple: T,
     txId?: string | undefined
-  ): Promise<boolean> {
-    return (
-      await Promise.all(
-        this.getStorageClients('read').map((store) => store.exists(tuple, txId))
-      )
-    ).some((exists) => exists);
-  }
+  ): Promise<boolean> {}
   subspace<P extends TuplePrefix<TupleSchema['key']>>(
     prefix: P

[NoCoverage] MethodExpression
src/multi-tuple-store.ts:97:12
     tuple: T,
     txId?: string | undefined
   ): Promise<boolean> {
-    return (
-      await Promise.all(
-        this.getStorageClients('read').map((store) => store.exists(tuple, txId))
-      )
-    ).some((exists) => exists);
+    return (await Promise.all(this.getStorageClients('read').map(store => store.exists(tuple, txId)))).every(exists => exists);
   }
   subspace<P extends TuplePrefix<TupleSchema['key']>>(

[NoCoverage] ArrowFunction
src/multi-tuple-store.ts:99:44
   ): Promise<boolean> {
     return (
       await Promise.all(
-        this.getStorageClients('read').map((store) => store.exists(tuple, txId))
+        this.getStorageClients('read').map(() => undefined)
       )
     ).some((exists) => exists);

[NoCoverage] ArrowFunction
src/multi-tuple-store.ts:101:12
       await Promise.all(
         this.getStorageClients('read').map((store) => store.exists(tuple, txId))
       )
-    ).some((exists) => exists);
+    ).some(() => undefined);
   }
   subspace<P extends TuplePrefix<TupleSchema['key']>>(

[Killed] BlockStatement
src/multi-tuple-store.ts:105:66
   }
   subspace<P extends TuplePrefix<TupleSchema['key']>>(
     prefix: P
-  ): MultiTupleStore<RemoveTupleValuePairPrefix<TupleSchema, P>> {
-    const prefixedStorages = Object.fromEntries(
-      Object.entries(this.storage).map(([storageKey, store]) => [
-        storageKey,
-        store.subspace(prefix),
-      ])
-    );
-    return new MultiTupleStore({
-      storage: prefixedStorages,
-      storageScope: this.storageScope,
-    }) as MultiTupleStore<RemoveTupleValuePairPrefix<TupleSchema, P>>;
-  }
+  ): MultiTupleStore<RemoveTupleValuePairPrefix<TupleSchema, P>> {}
 
   transact(scope?: StorageScope): MultiTupleTransaction<TupleSchema> {
killedBy: triple inserts can insert a single triple
statusReason: Cannot read properties of undefined (reading 'scan')

[Killed] ArrowFunction
src/multi-tuple-store.ts:107:40
     prefix: P
   ): MultiTupleStore<RemoveTupleValuePairPrefix<TupleSchema, P>> {
     const prefixedStorages = Object.fromEntries(
-      Object.entries(this.storage).map(([storageKey, store]) => [
-        storageKey,
-        store.subspace(prefix),
-      ])
+      Object.entries(this.storage).map(() => undefined)
     );
     return new MultiTupleStore({
killedBy: DurableClock creates a fresh clock if no relevant metadata
statusReason: Iterator value undefined is not an entry object

[Killed] BlockStatement
src/multi-tuple-store.ts:118:70
     }) as MultiTupleStore<RemoveTupleValuePairPrefix<TupleSchema, P>>;
   }
 
-  transact(scope?: StorageScope): MultiTupleTransaction<TupleSchema> {
-    return new MultiTupleTransaction({
-      scope: scope ?? this.storageScope,
-      store: this,
-    });
-  }
+  transact(scope?: StorageScope): MultiTupleTransaction<TupleSchema> {}
 
   async autoTransact(
killedBy: DurableClock creates a fresh clock if no relevant metadata; triple inserts can insert a single triple; Database API can furnish the client id
statusReason: Cannot read properties of undefined (reading 'set')

[Killed] LogicalOperator
src/multi-tuple-store.ts:120:14
 
   transact(scope?: StorageScope): MultiTupleTransaction<TupleSchema> {
     return new MultiTupleTransaction({
-      scope: scope ?? this.storageScope,
+      scope: scope && this.storageScope,
       store: this,
     });
killedBy: transaction scoping transactions can specify default read and write scopes
statusReason: expected 3 to be 2 // Object.is equality

[Killed] BlockStatement
src/multi-tuple-store.ts:128:5
   async autoTransact(
     callback: (tx: MultiTupleTransaction<TupleSchema>) => Promise<void>,
     scope: StorageScope | undefined
-  ) {
-    try {
-      // @ts-ignore
-      await transactionalReadWriteAsync()(callback)(
-        // @ts-ignore
-        scope
-          ? new MultiTupleStore({ storage: this.storage, storageScope: scope })
-          : this
-      );
-    } catch (e) {
-      throw e;
-    }
-  }
+  ) {}
 
   async clear() {
killedBy: Database API will throw an error if the provided entity id has a # sign in it; triple inserts can insert a single triple
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/multi-tuple-store.ts:129:9
     callback: (tx: MultiTupleTransaction<TupleSchema>) => Promise<void>,
     scope: StorageScope | undefined
   ) {
-    try {
-      // @ts-ignore
-      await transactionalReadWriteAsync()(callback)(
-        // @ts-ignore
-        scope
-          ? new MultiTupleStore({ storage: this.storage, storageScope: scope })
-          : this
-      );
-    } catch (e) {
+    try {} catch (e) {
       throw e;
     }
killedBy: Database API will throw an error if the provided entity id has a # sign in it; DurableClock initializes with persisted clock if available
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ObjectLiteral
src/multi-tuple-store.ts:134:33
       await transactionalReadWriteAsync()(callback)(
         // @ts-ignore
         scope
-          ? new MultiTupleStore({ storage: this.storage, storageScope: scope })
+          ? new MultiTupleStore({})
           : this
       );
killedBy: transaction scoping transactions can specify default read and write scopes
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
src/multi-tuple-store.ts:137:17
           ? new MultiTupleStore({ storage: this.storage, storageScope: scope })
           : this
       );
-    } catch (e) {
-      throw e;
-    }
+    } catch (e) {}
   }
 
killedBy: Database API will throw an error if the provided entity id has a # sign in it; schema triple-store should prevent wrong types
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/multi-tuple-store.ts:142:17
     }
   }
 
-  async clear() {
-    await Promise.all(
-      Object.values(this.storage).map(async (store) => {
-        await transactionalReadWriteAsync()(async (tx) => {
-          const allData = await tx.scan();
-          await Promise.all(allData.map((data) => tx.remove(data.key)));
-        })(
-          // @ts-ignore
-          store
-        );
-      })
-    );
-  }
+  async clear() {}
 
   close(): void {
killedBy: migrations Data deletion clear() removes all data from the database
statusReason: expected 13 to be +0 // Object.is equality

[Killed] BlockStatement
src/multi-tuple-store.ts:144:56
 
   async clear() {
     await Promise.all(
-      Object.values(this.storage).map(async (store) => {
-        await transactionalReadWriteAsync()(async (tx) => {
-          const allData = await tx.scan();
-          await Promise.all(allData.map((data) => tx.remove(data.key)));
-        })(
-          // @ts-ignore
-          store
-        );
-      })
+      Object.values(this.storage).map(async (store) => {})
     );
   }
killedBy: migrations Data deletion clear() removes all data from the database
statusReason: expected 13 to be +0 // Object.is equality

[Killed] BlockStatement
src/multi-tuple-store.ts:145:59
   async clear() {
     await Promise.all(
       Object.values(this.storage).map(async (store) => {
-        await transactionalReadWriteAsync()(async (tx) => {
-          const allData = await tx.scan();
-          await Promise.all(allData.map((data) => tx.remove(data.key)));
-        })(
+        await transactionalReadWriteAsync()(async (tx) => {})(
           // @ts-ignore
           store
killedBy: migrations Data deletion clear() removes all data from the database
statusReason: expected 13 to be +0 // Object.is equality

[Killed] ArrowFunction
src/multi-tuple-store.ts:147:41
       Object.values(this.storage).map(async (store) => {
         await transactionalReadWriteAsync()(async (tx) => {
           const allData = await tx.scan();
-          await Promise.all(allData.map((data) => tx.remove(data.key)));
+          await Promise.all(allData.map(() => undefined));
         })(
           // @ts-ignore
killedBy: migrations Data deletion clear() removes all data from the database
statusReason: expected 13 to be +0 // Object.is equality

[NoCoverage] BlockStatement
src/multi-tuple-store.ts:156:17
     );
   }
 
-  close(): void {
-    throw new Error('Method not implemented.');
-  }
+  close(): void {}
 }
 

[Killed] BlockStatement
src/multi-tuple-store.ts:163:72
 
 export class ScopedMultiTupleOperator<TupleSchema extends KeyValuePair> {
   readonly txScope: TransactionScope<TupleSchema>;
-  constructor({ txScope }: { txScope: TransactionScope<TupleSchema> }) {
-    this.txScope = txScope;
-  }
+  constructor({ txScope }: { txScope: TransactionScope<TupleSchema> }) {}
 
   async scan<T extends Tuple, P extends TuplePrefix<T>>(
killedBy: DurableClock creates a fresh clock if no relevant metadata
statusReason: Cannot read properties of undefined (reading 'write')

[Killed] BlockStatement
src/multi-tuple-store.ts:169:29
 
   async scan<T extends Tuple, P extends TuplePrefix<T>>(
     args?: ScanArgs<T, P> | undefined
-  ): Promise<TupleSchema[]> {
-    const comparer = (a: TupleSchema, b: TupleSchema) =>
-      (compareTuple(a.key, b.key) * (args?.reverse ? -1 : 1)) as 1 | -1 | 0;
-
-    return mergeMultipleSortedArrays(
-      await Promise.all(this.txScope.read.map((store) => store.scan(args))),
-      comparer
-    );
-  }
+  ): Promise<TupleSchema[]> {}
 
   async exists<T extends Tuple>(tuple: T): Promise<boolean> {
killedBy: triple inserts can insert a single triple
statusReason: Cannot read properties of undefined (reading 'length')

[Survived] ArrowFunction
src/multi-tuple-store.ts:170:22
   async scan<T extends Tuple, P extends TuplePrefix<T>>(
     args?: ScanArgs<T, P> | undefined
   ): Promise<TupleSchema[]> {
-    const comparer = (a: TupleSchema, b: TupleSchema) =>
-      (compareTuple(a.key, b.key) * (args?.reverse ? -1 : 1)) as 1 | -1 | 0;
+    const comparer = () => undefined;
 
     return mergeMultipleSortedArrays(

[Killed] ArrowFunction
src/multi-tuple-store.ts:174:47
       (compareTuple(a.key, b.key) * (args?.reverse ? -1 : 1)) as 1 | -1 | 0;
 
     return mergeMultipleSortedArrays(
-      await Promise.all(this.txScope.read.map((store) => store.scan(args))),
+      await Promise.all(this.txScope.read.map(() => undefined)),
       comparer
     );
killedBy: DurableClock can read new timestamps from the store and update the clock
statusReason: Cannot read properties of undefined (reading 'length')

[Survived] BlockStatement
src/multi-tuple-store.ts:179:61
     );
   }
 
-  async exists<T extends Tuple>(tuple: T): Promise<boolean> {
-    return (
-      await Promise.all(this.txScope.read.map((store) => store.exists(tuple)))
-    ).some((exists) => exists);
-  }
+  async exists<T extends Tuple>(tuple: T): Promise<boolean> {}
 
   // get: <T extends Tuple>(tuple: T) => (Extract<TupleSchema, { key: TupleToObject<T>; }> extends unknown ? Extract<TupleSchema, { key: TupleToObject<T>; }>['value'] : never) | undefined;

[Survived] MethodExpression
src/multi-tuple-store.ts:180:12
   }
 
   async exists<T extends Tuple>(tuple: T): Promise<boolean> {
-    return (
-      await Promise.all(this.txScope.read.map((store) => store.exists(tuple)))
-    ).some((exists) => exists);
+    return (await Promise.all(this.txScope.read.map(store => store.exists(tuple)))).every(exists => exists);
   }
 

[Survived] ArrowFunction
src/multi-tuple-store.ts:181:47
 
   async exists<T extends Tuple>(tuple: T): Promise<boolean> {
     return (
-      await Promise.all(this.txScope.read.map((store) => store.exists(tuple)))
+      await Promise.all(this.txScope.read.map(() => undefined))
     ).some((exists) => exists);
   }

[Survived] ArrowFunction
src/multi-tuple-store.ts:182:12
   async exists<T extends Tuple>(tuple: T): Promise<boolean> {
     return (
       await Promise.all(this.txScope.read.map((store) => store.exists(tuple)))
-    ).some((exists) => exists);
+    ).some(() => undefined);
   }
 

[Killed] BlockStatement
src/multi-tuple-store.ts:187:24
 
   // get: <T extends Tuple>(tuple: T) => (Extract<TupleSchema, { key: TupleToObject<T>; }> extends unknown ? Extract<TupleSchema, { key: TupleToObject<T>; }>['value'] : never) | undefined;
   // exists: <T extends Tuple>(tuple: T) => boolean;
-  remove(tuple: Tuple) {
-    this.txScope.write.forEach((tx) => tx.remove(tuple));
-  }
+  remove(tuple: Tuple) {}
 
   // write: (writes: WriteOps<TupleSchema>) => TupleRootTransactionApi<TupleSchema>;
killedBy: schema triple-store should allow the deletion of metadatatriples
statusReason: expected { collections: { …(1) }, version: +0 } to be falsy

[Killed] ArrowFunction
src/multi-tuple-store.ts:188:32
   // get: <T extends Tuple>(tuple: T) => (Extract<TupleSchema, { key: TupleToObject<T>; }> extends unknown ? Extract<TupleSchema, { key: TupleToObject<T>; }>['value'] : never) | undefined;
   // exists: <T extends Tuple>(tuple: T) => boolean;
   remove(tuple: Tuple) {
-    this.txScope.write.forEach((tx) => tx.remove(tuple));
+    this.txScope.write.forEach(() => undefined);
   }
 
killedBy: schema triple-store should allow the deletion of metadatatriples
statusReason: expected { collections: { …(1) }, version: +0 } to be falsy

[Killed] BlockStatement
src/multi-tuple-store.ts:198:5
     value: Extract<TupleSchema, { key: TupleToObject<Key> }> extends unknown
       ? Extract<TupleSchema, { key: TupleToObject<Key> }>['value']
       : never
-  ) {
-    this.txScope.write.forEach((tx) => tx.set(tuple, value));
-  }
+  ) {}
 }
 
killedBy: DurableClock initializes with persisted clock if available
statusReason: expected +0 to be 15 // Object.is equality

[Killed] ArrowFunction
src/multi-tuple-store.ts:199:32
       ? Extract<TupleSchema, { key: TupleToObject<Key> }>['value']
       : never
   ) {
-    this.txScope.write.forEach((tx) => tx.set(tuple, value));
+    this.txScope.write.forEach(() => undefined);
   }
 }
killedBy: DurableClock initializes with persisted clock if available; Database API can lookup entity by Id
statusReason: expected +0 to be 15 // Object.is equality

[Killed] ArrowFunction
src/multi-tuple-store.ts:207:31
   arrays: T[][],
   comparer: (a: T, b: T) => -1 | 0 | 1
 ): T[] {
-  const pointers = arrays.map(() => 0);
+  const pointers = arrays.map(() => undefined);
   const resultSize = arrays.reduce((acc, arr) => acc + arr.length, 0);
   const result = new Array(resultSize);
killedBy: Database API can furnish the client id; triple inserts can insert a single triple; DurableClock initializes with persisted clock if available
statusReason: Could not find candidate item while sorting arrays. This should never happen.

[Killed] ArithmeticOperator
src/multi-tuple-store.ts:208:50
   comparer: (a: T, b: T) => -1 | 0 | 1
 ): T[] {
   const pointers = arrays.map(() => 0);
-  const resultSize = arrays.reduce((acc, arr) => acc + arr.length, 0);
+  const resultSize = arrays.reduce((acc, arr) => acc - arr.length, 0);
   const result = new Array(resultSize);
   let itemCount = 0;
killedBy: DurableClock initializes with persisted clock if available; Database API can furnish the client id
statusReason: Invalid array length

[Killed] ArrowFunction
src/multi-tuple-store.ts:208:36
   comparer: (a: T, b: T) => -1 | 0 | 1
 ): T[] {
   const pointers = arrays.map(() => 0);
-  const resultSize = arrays.reduce((acc, arr) => acc + arr.length, 0);
+  const resultSize = arrays.reduce(() => undefined, 0);
   const result = new Array(resultSize);
   let itemCount = 0;
killedBy: DurableClock creates a fresh clock if no relevant metadata; triple inserts can insert a single triple
statusReason: Cannot read properties of undefined (reading 'key')

[Killed] EqualityOperator
src/multi-tuple-store.ts:211:10
   const resultSize = arrays.reduce((acc, arr) => acc + arr.length, 0);
   const result = new Array(resultSize);
   let itemCount = 0;
-  while (itemCount < resultSize) {
+  while (itemCount >= resultSize) {
     let candidateList = null;
     for (let i = 0; i < arrays.length; i++) {
killedBy: DurableClock creates a fresh clock if no relevant metadata; Database API can furnish the client id; triple inserts can insert a single triple
statusReason: Could not find candidate item while sorting arrays. This should never happen.

[Killed] ConditionalExpression
src/multi-tuple-store.ts:211:10
   const resultSize = arrays.reduce((acc, arr) => acc + arr.length, 0);
   const result = new Array(resultSize);
   let itemCount = 0;
-  while (itemCount < resultSize) {
+  while (false) {
     let candidateList = null;
     for (let i = 0; i < arrays.length; i++) {
killedBy: Database API can furnish the client id; triple inserts can insert a single triple
statusReason: Cannot read properties of undefined (reading 'key')

[Killed] EqualityOperator
src/multi-tuple-store.ts:213:21
   let itemCount = 0;
   while (itemCount < resultSize) {
     let candidateList = null;
-    for (let i = 0; i < arrays.length; i++) {
+    for (let i = 0; i <= arrays.length; i++) {
       const item = arrays[i][pointers[i]];
       if (!item) continue;
killedBy: Database API can furnish the client id; triple inserts can insert a single triple
statusReason: Cannot read properties of undefined (reading 'undefined')

[Killed] EqualityOperator
src/multi-tuple-store.ts:213:21
   let itemCount = 0;
   while (itemCount < resultSize) {
     let candidateList = null;
-    for (let i = 0; i < arrays.length; i++) {
+    for (let i = 0; i >= arrays.length; i++) {
       const item = arrays[i][pointers[i]];
       if (!item) continue;
killedBy: triple inserts can insert a single triple; Database API can furnish the client id
statusReason: Could not find candidate item while sorting arrays. This should never happen.

[Killed] ConditionalExpression
src/multi-tuple-store.ts:215:11
     let candidateList = null;
     for (let i = 0; i < arrays.length; i++) {
       const item = arrays[i][pointers[i]];
-      if (!item) continue;
+      if (true) continue;
       if (candidateList == null) {
         candidateList = i;
killedBy: DurableClock initializes with persisted clock if available; Database API can furnish the client id; triple inserts can insert a single triple
statusReason: Could not find candidate item while sorting arrays. This should never happen.

[Killed] ConditionalExpression
src/multi-tuple-store.ts:215:11
     let candidateList = null;
     for (let i = 0; i < arrays.length; i++) {
       const item = arrays[i][pointers[i]];
-      if (!item) continue;
+      if (false) continue;
       if (candidateList == null) {
         candidateList = i;
killedBy: transaction scoping transactions can specify default read and write scopes
statusReason: Cannot read properties of undefined (reading 'key')

[Killed] EqualityOperator
src/multi-tuple-store.ts:216:11
     for (let i = 0; i < arrays.length; i++) {
       const item = arrays[i][pointers[i]];
       if (!item) continue;
-      if (candidateList == null) {
+      if (candidateList != null) {
         candidateList = i;
         continue;
killedBy: triple inserts can insert a single triple; DurableClock initializes with persisted clock if available
statusReason: Cannot read properties of undefined (reading 'undefined')

[Killed] ConditionalExpression
src/multi-tuple-store.ts:216:11
     for (let i = 0; i < arrays.length; i++) {
       const item = arrays[i][pointers[i]];
       if (!item) continue;
-      if (candidateList == null) {
+      if (false) {
         candidateList = i;
         continue;
killedBy: Database API can furnish the client id
statusReason: Cannot read properties of undefined (reading 'undefined')

[Survived] ConditionalExpression
src/multi-tuple-store.ts:220:11
         candidateList = i;
         continue;
       }
-      if (comparer(item, arrays[candidateList][pointers[candidateList]]) < 0) {
+      if (true) {
         candidateList = i;
       }

[Survived] EqualityOperator
src/multi-tuple-store.ts:220:11
         candidateList = i;
         continue;
       }
-      if (comparer(item, arrays[candidateList][pointers[candidateList]]) < 0) {
+      if (comparer(item, arrays[candidateList][pointers[candidateList]]) >= 0) {
         candidateList = i;
       }

[Killed] EqualityOperator
src/multi-tuple-store.ts:224:9
         candidateList = i;
       }
     }
-    if (candidateList == null) {
+    if (candidateList != null) {
       throw new Error(
         'Could not find candidate item while sorting arrays. This should never happen.'
killedBy: triple inserts can insert a single triple; Database API can furnish the client id
statusReason: Could not find candidate item while sorting arrays. This should never happen.

[Killed] ConditionalExpression
src/multi-tuple-store.ts:224:9
         candidateList = i;
       }
     }
-    if (candidateList == null) {
+    if (true) {
       throw new Error(
         'Could not find candidate item while sorting arrays. This should never happen.'
killedBy: triple inserts can insert a single triple
statusReason: Could not find candidate item while sorting arrays. This should never happen.

[Killed] UpdateOperator
src/multi-tuple-store.ts:229:49
         'Could not find candidate item while sorting arrays. This should never happen.'
       );
     }
-    result[itemCount++] = arrays[candidateList][pointers[candidateList]++];
+    result[itemCount++] = arrays[candidateList][pointers[candidateList]--];
   }
   return result;
killedBy: Database API can lookup entity by Id; DurableClock initializes with persisted clock if available
statusReason: Could not find candidate item while sorting arrays. This should never happen.

[Killed] UpdateOperator
src/multi-tuple-store.ts:229:12
         'Could not find candidate item while sorting arrays. This should never happen.'
       );
     }
-    result[itemCount++] = arrays[candidateList][pointers[candidateList]++];
+    result[itemCount--] = arrays[candidateList][pointers[candidateList]++];
   }
   return result;
killedBy: Database API can furnish the client id; DurableClock initializes with persisted clock if available; triple inserts can insert a single triple
statusReason: Could not find candidate item while sorting arrays. This should never happen.

[Killed] BooleanLiteral
src/multi-tuple-store.ts:239:16
 > extends ScopedMultiTupleOperator<TupleSchema> {
   readonly txs: Record<string, AsyncTupleRootTransactionApi<TupleSchema>>;
   readonly store: MultiTupleStore<TupleSchema>;
-  isCanceled = false;
+  isCanceled = true;
 
   constructor({
killedBy: Database API can lookup entity by Id; triple inserts can insert a single triple
statusReason: expected null not to be null
