[Killed] BlockStatement
src/multi-tuple-store.ts:247:6
   }: {
     store: MultiTupleStore<TupleSchema>;
     scope?: StorageScope;
-  }) {
-    const txs = Object.fromEntries(
-      Object.entries(store.storage).map(([storageKey, store]) => [
-        storageKey,
-        store.transact(),
-      ])
-    );
-    const readKeys = scope?.read ?? Object.keys(store.storage);
-    const writeKeys = scope?.write ?? Object.keys(store.storage);
-    super({
-      txScope: {
-        read: readKeys.map((storageKey) => txs[storageKey]),
-        write: writeKeys.map((storageKey) => txs[storageKey]),
-      },
-    });
-    this.txs = txs;
-    this.store = store;
-  }
+  }) {}
 
   withScope(scope: StorageScope) {
killedBy: DurableClock creates a fresh clock if no relevant metadata; triple inserts can insert a single triple
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] ArrowFunction
src/multi-tuple-store.ts:249:41
     scope?: StorageScope;
   }) {
     const txs = Object.fromEntries(
-      Object.entries(store.storage).map(([storageKey, store]) => [
-        storageKey,
-        store.transact(),
-      ])
+      Object.entries(store.storage).map(() => undefined)
     );
     const readKeys = scope?.read ?? Object.keys(store.storage);
killedBy: Database API can furnish the client id; DurableClock creates a fresh clock if no relevant metadata; triple inserts can insert a single triple
statusReason: Iterator value undefined is not an entry object

[Killed] ArrayDeclaration
src/multi-tuple-store.ts:249:66
     scope?: StorageScope;
   }) {
     const txs = Object.fromEntries(
-      Object.entries(store.storage).map(([storageKey, store]) => [
-        storageKey,
-        store.transact(),
-      ])
+      Object.entries(store.storage).map(([storageKey, store]) => [])
     );
     const readKeys = scope?.read ?? Object.keys(store.storage);
killedBy: DurableClock creates a fresh clock if no relevant metadata; Database API can furnish the client id; triple inserts can insert a single triple
statusReason: Cannot read properties of undefined (reading 'set')

[Killed] LogicalOperator
src/multi-tuple-store.ts:254:22
         store.transact(),
       ])
     );
-    const readKeys = scope?.read ?? Object.keys(store.storage);
+    const readKeys = scope?.read && Object.keys(store.storage);
     const writeKeys = scope?.write ?? Object.keys(store.storage);
     super({
killedBy: triple inserts can insert a single triple; Database API can furnish the client id; DurableClock creates a fresh clock if no relevant metadata
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] OptionalChaining
src/multi-tuple-store.ts:254:22
         store.transact(),
       ])
     );
-    const readKeys = scope?.read ?? Object.keys(store.storage);
+    const readKeys = scope.read ?? Object.keys(store.storage);
     const writeKeys = scope?.write ?? Object.keys(store.storage);
     super({
killedBy: DurableClock creates a fresh clock if no relevant metadata; Database API can furnish the client id; triple inserts can insert a single triple
statusReason: Cannot read properties of undefined (reading 'read')

[Killed] OptionalChaining
src/multi-tuple-store.ts:255:23
       ])
     );
     const readKeys = scope?.read ?? Object.keys(store.storage);
-    const writeKeys = scope?.write ?? Object.keys(store.storage);
+    const writeKeys = scope.write ?? Object.keys(store.storage);
     super({
       txScope: {
killedBy: DurableClock creates a fresh clock if no relevant metadata
statusReason: Cannot read properties of undefined (reading 'write')

[Killed] LogicalOperator
src/multi-tuple-store.ts:255:23
       ])
     );
     const readKeys = scope?.read ?? Object.keys(store.storage);
-    const writeKeys = scope?.write ?? Object.keys(store.storage);
+    const writeKeys = scope?.write && Object.keys(store.storage);
     super({
       txScope: {
killedBy: Database API can furnish the client id; triple inserts can insert a single triple
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ObjectLiteral
src/multi-tuple-store.ts:257:16
     const readKeys = scope?.read ?? Object.keys(store.storage);
     const writeKeys = scope?.write ?? Object.keys(store.storage);
     super({
-      txScope: {
-        read: readKeys.map((storageKey) => txs[storageKey]),
-        write: writeKeys.map((storageKey) => txs[storageKey]),
-      },
+      txScope: {},
     });
     this.txs = txs;
killedBy: Database API can furnish the client id; triple inserts can insert a single triple
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/multi-tuple-store.ts:258:28
     const writeKeys = scope?.write ?? Object.keys(store.storage);
     super({
       txScope: {
-        read: readKeys.map((storageKey) => txs[storageKey]),
+        read: readKeys.map(() => undefined),
         write: writeKeys.map((storageKey) => txs[storageKey]),
       },
killedBy: DurableClock can read new timestamps from the store and update the clock; Database API can furnish the client id
statusReason: Cannot read properties of undefined (reading 'exists')

[Killed] ArrowFunction
src/multi-tuple-store.ts:259:30
     super({
       txScope: {
         read: readKeys.map((storageKey) => txs[storageKey]),
-        write: writeKeys.map((storageKey) => txs[storageKey]),
+        write: writeKeys.map(() => undefined),
       },
     });
killedBy: DurableClock creates a fresh clock if no relevant metadata; triple inserts can insert a single triple
statusReason: Cannot read properties of undefined (reading 'set')

[Killed] BlockStatement
src/multi-tuple-store.ts:266:34
     this.store = store;
   }
 
-  withScope(scope: StorageScope) {
-    const readKeys = scope.read ?? Object.keys(this.store.storage);
-    const writeKeys = scope.write ?? Object.keys(this.store.storage);
-    return new ScopedMultiTupleOperator({
-      txScope: {
-        read: readKeys.map((storageKey) => this.txs[storageKey]),
-        write: writeKeys.map((storageKey) => this.txs[storageKey]),
-      },
-    });
-  }
+  withScope(scope: StorageScope) {}
 
   async commit() {
killedBy: transaction scoping actions within a transaction can specify read and write scopes; schema changes can rename an attribute
statusReason: Cannot read properties of undefined (reading 'exists')

[Killed] LogicalOperator
src/multi-tuple-store.ts:267:22
   }
 
   withScope(scope: StorageScope) {
-    const readKeys = scope.read ?? Object.keys(this.store.storage);
+    const readKeys = scope.read && Object.keys(this.store.storage);
     const writeKeys = scope.write ?? Object.keys(this.store.storage);
     return new ScopedMultiTupleOperator({
killedBy: transaction scoping actions within a transaction can specify read and write scopes
statusReason: expected 2 to be +0 // Object.is equality

[Killed] LogicalOperator
src/multi-tuple-store.ts:268:23
 
   withScope(scope: StorageScope) {
     const readKeys = scope.read ?? Object.keys(this.store.storage);
-    const writeKeys = scope.write ?? Object.keys(this.store.storage);
+    const writeKeys = scope.write && Object.keys(this.store.storage);
     return new ScopedMultiTupleOperator({
       txScope: {
killedBy: transaction scoping actions within a transaction can specify read and write scopes
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ArrowFunction
src/multi-tuple-store.ts:271:28
     const writeKeys = scope.write ?? Object.keys(this.store.storage);
     return new ScopedMultiTupleOperator({
       txScope: {
-        read: readKeys.map((storageKey) => this.txs[storageKey]),
+        read: readKeys.map(() => undefined),
         write: writeKeys.map((storageKey) => this.txs[storageKey]),
       },
killedBy: transaction scoping actions within a transaction can specify read and write scopes; schema changes can rename an attribute
statusReason: Cannot read properties of undefined (reading 'exists')

[Killed] ArrowFunction
src/multi-tuple-store.ts:272:30
     return new ScopedMultiTupleOperator({
       txScope: {
         read: readKeys.map((storageKey) => this.txs[storageKey]),
-        write: writeKeys.map((storageKey) => this.txs[storageKey]),
+        write: writeKeys.map(() => undefined),
       },
     });
killedBy: schema changes can rename an attribute; transaction scoping actions within a transaction can specify read and write scopes
statusReason: Cannot read properties of undefined (reading 'remove')

[Killed] BlockStatement
src/multi-tuple-store.ts:277:18
     });
   }
 
-  async commit() {
-    if (this.isCanceled) {
-      console.warn('Cannot commit already canceled transaction.');
-      return;
-    }
-    await Promise.all(Object.values(this.txs).map((tx) => tx.commit()));
-  }
+  async commit() {}
   async cancel() {
     if (this.isCanceled) {
killedBy: Database API can lookup entity by Id; triple inserts can insert a single triple
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/multi-tuple-store.ts:278:9
   }
 
   async commit() {
-    if (this.isCanceled) {
+    if (false) {
       console.warn('Cannot commit already canceled transaction.');
       return;
killedBy: supports transactions can rollback a transaction
statusReason: Transaction already canceled

[Killed] BlockStatement
src/multi-tuple-store.ts:278:26
   }
 
   async commit() {
-    if (this.isCanceled) {
-      console.warn('Cannot commit already canceled transaction.');
-      return;
-    }
+    if (this.isCanceled) {}
     await Promise.all(Object.values(this.txs).map((tx) => tx.commit()));
   }
killedBy: database transactions can rollback a transaction; supports transactions can rollback a transaction
statusReason: Transaction already canceled

[Survived] StringLiteral
src/multi-tuple-store.ts:279:20
 
   async commit() {
     if (this.isCanceled) {
-      console.warn('Cannot commit already canceled transaction.');
+      console.warn("");
       return;
     }

[Killed] ArrowFunction
src/multi-tuple-store.ts:282:51
       console.warn('Cannot commit already canceled transaction.');
       return;
     }
-    await Promise.all(Object.values(this.txs).map((tx) => tx.commit()));
+    await Promise.all(Object.values(this.txs).map(() => undefined));
   }
   async cancel() {
killedBy: triple inserts can insert a single triple; Database API can lookup entity by Id; DurableClock initializes with persisted clock if available
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/multi-tuple-store.ts:284:18
     }
     await Promise.all(Object.values(this.txs).map((tx) => tx.commit()));
   }
-  async cancel() {
-    if (this.isCanceled) {
-      console.warn('Attempted to cancel already canceled transaction.');
-      return;
-    }
-    await Promise.all(Object.values(this.txs).map((tx) => tx.cancel()));
-    this.isCanceled = true;
-  }
+  async cancel() {}
 }
 
killedBy: database transactions can rollback a transaction; supports transactions can rollback a transaction
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/multi-tuple-store.ts:285:9
     await Promise.all(Object.values(this.txs).map((tx) => tx.commit()));
   }
   async cancel() {
-    if (this.isCanceled) {
+    if (true) {
       console.warn('Attempted to cancel already canceled transaction.');
       return;
killedBy: database transactions can rollback a transaction; supports transactions can rollback a transaction
statusReason: expected 1 to be +0 // Object.is equality

[Survived] ConditionalExpression
src/multi-tuple-store.ts:285:9
     await Promise.all(Object.values(this.txs).map((tx) => tx.commit()));
   }
   async cancel() {
-    if (this.isCanceled) {
+    if (false) {
       console.warn('Attempted to cancel already canceled transaction.');
       return;

[Survived] ArrowFunction
src/multi-tuple-store.ts:289:51
       console.warn('Attempted to cancel already canceled transaction.');
       return;
     }
-    await Promise.all(Object.values(this.txs).map((tx) => tx.cancel()));
+    await Promise.all(Object.values(this.txs).map(() => undefined));
     this.isCanceled = true;
   }

[Killed] BooleanLiteral
src/multi-tuple-store.ts:290:23
       return;
     }
     await Promise.all(Object.values(this.txs).map((tx) => tx.cancel()));
-    this.isCanceled = true;
+    this.isCanceled = false;
   }
 }
killedBy: database transactions can rollback a transaction; supports transactions can rollback a transaction
statusReason: Transaction already canceled
