[Killed] BlockStatement
src/mutation.ts:57:52
   tx: MutationTransaction;
   schema?: M;
 
-  constructor(tx: MutationTransaction, schema?: M) {
-    this.tx = tx;
-    this.schema = schema;
-  }
+  constructor(tx: MutationTransaction, schema?: M) {}
 
   entity(entity: EntityId) {
killedBy: Register operations can set register
statusReason: Cannot set properties of undefined (setting 'entity')

[Killed] BlockStatement
src/mutation.ts:62:28
     this.schema = schema;
   }
 
-  entity(entity: EntityId) {
-    this.tx.entity = entity;
-    return this;
-  }
+  entity(entity: EntityId) {}
 
   attribute<Attr extends MutationAttribute<M>>(
killedBy: Register operations can set register
statusReason: Cannot read properties of undefined (reading 'attribute')

[Killed] BlockStatement
src/mutation.ts:69:37
 
   attribute<Attr extends MutationAttribute<M>>(
     attribute: [...Attr]
-  ): MutationTypeFromModel<M, Attr> {
-    const fullAttribute = [this.tx.collection!, ...(attribute as string[])];
-    this.tx.attribute = fullAttribute;
-
-    if (!this.tx.entity) throw new Error('Must select an entity to update');
-    if (!this.tx.attribute?.length)
-      throw new Error('Must select an attribute to update');
-    if (this.schema) {
-      const pathSchema = getSchemaFromPath(this.schema, attribute as string[]);
-      if (pathSchema['x-crdt-type'] === 'Register')
-        // @ts-ignore
-        return new MutationRegister(this.tx as UpdateMutationTransaction);
-      if (pathSchema['x-crdt-type'] === 'Set')
-        // @ts-ignore
-        return new MutationSet(this.tx as UpdateMutationTransaction);
-      throw new Error('Invalid update type');
-    }
-    // @ts-ignore
-    return new MutationRegister(this.tx as UpdateMutationTransaction);
-  }
+  ): MutationTypeFromModel<M, Attr> {}
 }
 
killedBy: Register operations can set register
statusReason: Cannot read properties of undefined (reading 'set')

[Killed] ArrayDeclaration
src/mutation.ts:70:27
   attribute<Attr extends MutationAttribute<M>>(
     attribute: [...Attr]
   ): MutationTypeFromModel<M, Attr> {
-    const fullAttribute = [this.tx.collection!, ...(attribute as string[])];
+    const fullAttribute = [];
     this.tx.attribute = fullAttribute;
 
killedBy: Register operations can set register
statusReason: Must select an attribute to update

[Killed] BooleanLiteral
src/mutation.ts:73:9
     const fullAttribute = [this.tx.collection!, ...(attribute as string[])];
     this.tx.attribute = fullAttribute;
 
-    if (!this.tx.entity) throw new Error('Must select an entity to update');
+    if (this.tx.entity) throw new Error('Must select an entity to update');
     if (!this.tx.attribute?.length)
       throw new Error('Must select an attribute to update');
killedBy: Register operations can set register
statusReason: Must select an entity to update

[Killed] ConditionalExpression
src/mutation.ts:73:9
     const fullAttribute = [this.tx.collection!, ...(attribute as string[])];
     this.tx.attribute = fullAttribute;
 
-    if (!this.tx.entity) throw new Error('Must select an entity to update');
+    if (true) throw new Error('Must select an entity to update');
     if (!this.tx.attribute?.length)
       throw new Error('Must select an attribute to update');
killedBy: Register operations can set register
statusReason: Must select an entity to update

[Killed] ConditionalExpression
src/mutation.ts:74:9
     this.tx.attribute = fullAttribute;
 
     if (!this.tx.entity) throw new Error('Must select an entity to update');
-    if (!this.tx.attribute?.length)
+    if (true)
       throw new Error('Must select an attribute to update');
     if (this.schema) {
killedBy: Register operations can set register
statusReason: Must select an attribute to update

[Killed] BooleanLiteral
src/mutation.ts:74:9
     this.tx.attribute = fullAttribute;
 
     if (!this.tx.entity) throw new Error('Must select an entity to update');
-    if (!this.tx.attribute?.length)
+    if (this.tx.attribute?.length)
       throw new Error('Must select an attribute to update');
     if (this.schema) {
killedBy: Register operations can set register
statusReason: Must select an attribute to update

[NoCoverage] StringLiteral
src/mutation.ts:75:23
 
     if (!this.tx.entity) throw new Error('Must select an entity to update');
     if (!this.tx.attribute?.length)
-      throw new Error('Must select an attribute to update');
+      throw new Error("");
     if (this.schema) {
       const pathSchema = getSchemaFromPath(this.schema, attribute as string[]);

[Killed] ConditionalExpression
src/mutation.ts:76:9
     if (!this.tx.entity) throw new Error('Must select an entity to update');
     if (!this.tx.attribute?.length)
       throw new Error('Must select an attribute to update');
-    if (this.schema) {
+    if (true) {
       const pathSchema = getSchemaFromPath(this.schema, attribute as string[]);
       if (pathSchema['x-crdt-type'] === 'Register')
killedBy: Register operations can set register
statusReason: Bad path to schema

[Killed] BlockStatement
src/mutation.ts:76:22
     if (!this.tx.entity) throw new Error('Must select an entity to update');
     if (!this.tx.attribute?.length)
       throw new Error('Must select an attribute to update');
-    if (this.schema) {
-      const pathSchema = getSchemaFromPath(this.schema, attribute as string[]);
-      if (pathSchema['x-crdt-type'] === 'Register')
-        // @ts-ignore
-        return new MutationRegister(this.tx as UpdateMutationTransaction);
-      if (pathSchema['x-crdt-type'] === 'Set')
-        // @ts-ignore
-        return new MutationSet(this.tx as UpdateMutationTransaction);
-      throw new Error('Invalid update type');
-    }
+    if (this.schema) {}
     // @ts-ignore
     return new MutationRegister(this.tx as UpdateMutationTransaction);
killedBy: Set operations can add to set
statusReason: entity.attribute(...).add is not a function

[Killed] ConditionalExpression
src/mutation.ts:78:11
       throw new Error('Must select an attribute to update');
     if (this.schema) {
       const pathSchema = getSchemaFromPath(this.schema, attribute as string[]);
-      if (pathSchema['x-crdt-type'] === 'Register')
+      if (true)
         // @ts-ignore
         return new MutationRegister(this.tx as UpdateMutationTransaction);
killedBy: Set operations can add to set
statusReason: entity.attribute(...).add is not a function

[Killed] EqualityOperator
src/mutation.ts:78:11
       throw new Error('Must select an attribute to update');
     if (this.schema) {
       const pathSchema = getSchemaFromPath(this.schema, attribute as string[]);
-      if (pathSchema['x-crdt-type'] === 'Register')
+      if (pathSchema['x-crdt-type'] !== 'Register')
         // @ts-ignore
         return new MutationRegister(this.tx as UpdateMutationTransaction);
killedBy: Set operations can add to set
statusReason: entity.attribute(...).add is not a function

[Killed] EqualityOperator
src/mutation.ts:81:11
       if (pathSchema['x-crdt-type'] === 'Register')
         // @ts-ignore
         return new MutationRegister(this.tx as UpdateMutationTransaction);
-      if (pathSchema['x-crdt-type'] === 'Set')
+      if (pathSchema['x-crdt-type'] !== 'Set')
         // @ts-ignore
         return new MutationSet(this.tx as UpdateMutationTransaction);
killedBy: Set operations can add to set
statusReason: Invalid update type

[Killed] ConditionalExpression
src/mutation.ts:81:11
       if (pathSchema['x-crdt-type'] === 'Register')
         // @ts-ignore
         return new MutationRegister(this.tx as UpdateMutationTransaction);
-      if (pathSchema['x-crdt-type'] === 'Set')
+      if (false)
         // @ts-ignore
         return new MutationSet(this.tx as UpdateMutationTransaction);
killedBy: Set operations can add to set
statusReason: Invalid update type

[Killed] BlockStatement
src/mutation.ts:93:46
 
 class MutationRegister {
   private tx: UpdateMutationTransaction;
-  constructor(tx: UpdateMutationTransaction) {
-    this.tx = tx;
-  }
+  constructor(tx: UpdateMutationTransaction) {}
 
   async set(value: Value) {
killedBy: Register operations can set register
statusReason: Cannot destructure property 'transactor' of 'tx' as it is undefined.

[Killed] BlockStatement
src/mutation.ts:97:27
     this.tx = tx;
   }
 
-  async set(value: Value) {
-    return RegisterCRDT.set(this.tx, value);
-  }
+  async set(value: Value) {}
 }
 
killedBy: Register operations can set register
statusReason: expected Map{} to have a size of +0 but got 1

[Killed] BlockStatement
src/mutation.ts:108:27
     this.tx = tx;
   }
 
-  async add(value: Value) {
-    return SetCRDT.add(this.tx, value);
-  }
+  async add(value: Value) {}
 
   async remove(value: Value) {
killedBy: Set operations can add to set
statusReason: expected Map{} to have a size of 1 but got +0

[Killed] BlockStatement
src/mutation.ts:112:30
     return SetCRDT.add(this.tx, value);
   }
 
-  async remove(value: Value) {
-    return SetCRDT.remove(this.tx, value);
-  }
+  async remove(value: Value) {}
 }
 
killedBy: Set operations can remove from set
statusReason: expected Map{} to have a size of +0 but got 1
