[Killed] BlockStatement
src/query.ts:40:3
 export function entityToResultReducer<M extends Models<any, any>[string]>(
   entity: TypeFromModel<M>,
   triple: TripleRow
-) {
-  // TODO support tombestones and timestamps
-  const { attribute, value, timestamp, expired: isExpired } = triple;
-  if (isExpired) return entity;
-  if (attribute[0] === '_collection')
-    return { ...entity, _collection: [value, timestamp] };
-  const [_collectionName, ...path] = attribute;
-  updateEntityAtPath(entity, path, value, timestamp);
-  return entity;
-}
+) {}
 
 export function queryResultToJson(
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'triples')

[Killed] ConditionalExpression
src/query.ts:43:7
 ) {
   // TODO support tombestones and timestamps
   const { attribute, value, timestamp, expired: isExpired } = triple;
-  if (isExpired) return entity;
+  if (true) return entity;
   if (attribute[0] === '_collection')
     return { ...entity, _collection: [value, timestamp] };
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[Survived] ConditionalExpression
src/query.ts:43:7
 ) {
   // TODO support tombestones and timestamps
   const { attribute, value, timestamp, expired: isExpired } = triple;
-  if (isExpired) return entity;
+  if (false) return entity;
   if (attribute[0] === '_collection')
     return { ...entity, _collection: [value, timestamp] };

[Killed] ConditionalExpression
src/query.ts:44:7
   // TODO support tombestones and timestamps
   const { attribute, value, timestamp, expired: isExpired } = triple;
   if (isExpired) return entity;
-  if (attribute[0] === '_collection')
+  if (false)
     return { ...entity, _collection: [value, timestamp] };
   const [_collectionName, ...path] = attribute;
killedBy: subscriptions handles selection updates
statusReason: Cannot read properties of undefined (reading 'major')

[Killed] ConditionalExpression
src/query.ts:44:7
   // TODO support tombestones and timestamps
   const { attribute, value, timestamp, expired: isExpired } = triple;
   if (isExpired) return entity;
-  if (attribute[0] === '_collection')
+  if (true)
     return { ...entity, _collection: [value, timestamp] };
   const [_collectionName, ...path] = attribute;
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ObjectLiteral
src/query.ts:45:12
   const { attribute, value, timestamp, expired: isExpired } = triple;
   if (isExpired) return entity;
   if (attribute[0] === '_collection')
-    return { ...entity, _collection: [value, timestamp] };
+    return {};
   const [_collectionName, ...path] = attribute;
   updateEntityAtPath(entity, path, value, timestamp);
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[NoCoverage] BlockStatement
src/query.ts:53:3
 
 export function queryResultToJson(
   results: Map<string, Record<string, Set<any>>>
-) {
-  const entries = Array.from(results.entries());
-  const jsonifiedEntries = entries.map(([id, vals]) => [
-    id,
-    setRecordToArrayRecord(vals),
-  ]);
-  return Object.fromEntries(jsonifiedEntries);
-}
+) {}
 
 function setRecordToArrayRecord(

[NoCoverage] ArrowFunction
src/query.ts:55:40
   results: Map<string, Record<string, Set<any>>>
 ) {
   const entries = Array.from(results.entries());
-  const jsonifiedEntries = entries.map(([id, vals]) => [
-    id,
-    setRecordToArrayRecord(vals),
-  ]);
+  const jsonifiedEntries = entries.map(() => undefined);
   return Object.fromEntries(jsonifiedEntries);
 }

[NoCoverage] ArrayDeclaration
src/query.ts:55:56
   results: Map<string, Record<string, Set<any>>>
 ) {
   const entries = Array.from(results.entries());
-  const jsonifiedEntries = entries.map(([id, vals]) => [
-    id,
-    setRecordToArrayRecord(vals),
-  ]);
+  const jsonifiedEntries = entries.map(([id, vals]) => []);
   return Object.fromEntries(jsonifiedEntries);
 }

[NoCoverage] BlockStatement
src/query.ts:64:26
 
 function setRecordToArrayRecord(
   record: Record<string, Set<any>>
-): Record<string, any[]> {
-  return Object.fromEntries(
-    Object.entries(record).map(([id, set]) => [id, Array.from(set)])
-  );
-}
+): Record<string, any[]> {}
 
 export function or<M extends Model<any> | undefined>(where: QueryWhere<M>) {

[NoCoverage] ArrowFunction
src/query.ts:66:32
   record: Record<string, Set<any>>
 ): Record<string, any[]> {
   return Object.fromEntries(
-    Object.entries(record).map(([id, set]) => [id, Array.from(set)])
+    Object.entries(record).map(() => undefined)
   );
 }

[NoCoverage] ArrayDeclaration
src/query.ts:66:47
   record: Record<string, Set<any>>
 ): Record<string, any[]> {
   return Object.fromEntries(
-    Object.entries(record).map(([id, set]) => [id, Array.from(set)])
+    Object.entries(record).map(([id, set]) => [])
   );
 }

[Killed] BlockStatement
src/query.ts:70:76
   );
 }
 
-export function or<M extends Model<any> | undefined>(where: QueryWhere<M>) {
-  return { mod: 'or' as const, filters: where };
-}
+export function or<M extends Model<any> | undefined>(where: QueryWhere<M>) {}
 
 export function and<M extends Model<any> | undefined>(where: QueryWhere<M>) {
killedBy: OR queries supports OR queries
statusReason: Cannot use 'in' operator to search for 'mod' in undefined

[Killed] BlockStatement
src/query.ts:74:77
   return { mod: 'or' as const, filters: where };
 }
 
-export function and<M extends Model<any> | undefined>(where: QueryWhere<M>) {
-  return { mod: 'and' as const, filters: where };
-}
+export function and<M extends Model<any> | undefined>(where: QueryWhere<M>) {}
 
killedBy: Database API supports filtering on one attribute with multiple operators
statusReason: Cannot use 'in' operator to search for 'mod' in undefined

[Killed] ObjectLiteral
src/query.ts:75:10
 }
 
 export function and<M extends Model<any> | undefined>(where: QueryWhere<M>) {
-  return { mod: 'and' as const, filters: where };
+  return {};
 }
 
killedBy: Database API supports filtering on one attribute with multiple operators
statusReason: expected 6 to be 4 // Object.is equality
