[Killed] ArrowFunction
src/schema.ts:22:23
 // Using solution 3.1 described in this comment as a fix: https://github.com/microsoft/TypeScript/issues/47663#issuecomment-1519138189
 export type { TObject } from '@sinclair/typebox';
 
-export const string = () => Register(Type.String());
+export const string = () => undefined;
 export const number = () => Register(Type.Number());
 export const Boolean = () => Register(Type.Boolean());
killedBy: Set operations can add to set
statusReason: Bad path to schema

[Killed] ArrowFunction
src/schema.ts:23:23
 export type { TObject } from '@sinclair/typebox';
 
 export const string = () => Register(Type.String());
-export const number = () => Register(Type.Number());
+export const number = () => undefined;
 export const Boolean = () => Register(Type.Boolean());
 
killedBy: schema triple-store defining a store with a schema should overwrite existing schema
statusReason: Bad path to schema

[Survived] ArrowFunction
src/schema.ts:24:24
 
 export const string = () => Register(Type.String());
 export const number = () => Register(Type.Number());
-export const Boolean = () => Register(Type.Boolean());
+export const Boolean = () => undefined;
 
 // const StringEnum = TypeSystem.Type<

[Survived] BlockStatement
src/schema.ts:44:12
 
 export function Register<
   T extends TNumber | TBoolean | TString | TUnsafe<string>
->(type: T) {
-  return Type.Tuple([type, Timestamp], {
-    'x-serialized-type': type.type,
-    'x-crdt-type': 'Register',
-  });
-}
+>(type: T) {}
 
 // NOTE: Calling this Object conflicts with the global Object type

[Killed] StringLiteral
src/schema.ts:47:20
 >(type: T) {
   return Type.Tuple([type, Timestamp], {
     'x-serialized-type': type.type,
-    'x-crdt-type': 'Register',
+    'x-crdt-type': "",
   });
 }
killedBy: database transactions can update an entity in a transaction
statusReason: Invalid update type

[NoCoverage] BlockStatement
src/schema.ts:52:46
 }
 
 // NOTE: Calling this Object conflicts with the global Object type
-export function Record(schema: SchemaConfig) {
-  return Type.Object(schema);
-}
+export function Record(schema: SchemaConfig) {}
 
 export type ValidSetDataTypes = TNumber | TString;

[Killed] BlockStatement
src/schema.ts:59:3
 export type ValidSetDataTypes = TNumber | TString;
 export function Set<T extends ValidSetDataTypes>(
   type: ReturnType<typeof Register<T>>
-) {
-  if (!type.items?.length)
-    throw new Error('Invalid type for set, register tuple must contain data');
-  const keyType = type.items[0];
-  const setOptions = {
-    'x-crdt-type': 'Set',
-  };
-  if (TypeGuard.TString(keyType))
-    return Type.Record(keyType, Register(Type.Boolean()), {
-      ...setOptions,
-      'x-serialized-type': 'set_string',
-    });
-  if (TypeGuard.TNumber(keyType))
-    return Type.Record(keyType, Register(Type.Boolean()), {
-      ...setOptions,
-      'x-serialized-type': 'set_number',
-    });
-
-  throw new Error('Invalid type for set, must be number or string');
-}
+) {}
 
 export type RegisterType = ReturnType<
killedBy: Set operations can add to set; schema triple-store defining a store with a schema should store schema
statusReason: Bad path to schema

[Survived] ConditionalExpression
src/schema.ts:60:7
 export function Set<T extends ValidSetDataTypes>(
   type: ReturnType<typeof Register<T>>
 ) {
-  if (!type.items?.length)
+  if (true)
     throw new Error('Invalid type for set, register tuple must contain data');
   const keyType = type.items[0];

[Survived] ConditionalExpression
src/schema.ts:60:7
 export function Set<T extends ValidSetDataTypes>(
   type: ReturnType<typeof Register<T>>
 ) {
-  if (!type.items?.length)
+  if (false)
     throw new Error('Invalid type for set, register tuple must contain data');
   const keyType = type.items[0];

[NoCoverage] StringLiteral
src/schema.ts:61:21
   type: ReturnType<typeof Register<T>>
 ) {
   if (!type.items?.length)
-    throw new Error('Invalid type for set, register tuple must contain data');
+    throw new Error("");
   const keyType = type.items[0];
   const setOptions = {

[Survived] ConditionalExpression
src/schema.ts:66:7
   const setOptions = {
     'x-crdt-type': 'Set',
   };
-  if (TypeGuard.TString(keyType))
+  if (false)
     return Type.Record(keyType, Register(Type.Boolean()), {
       ...setOptions,

[Survived] ConditionalExpression
src/schema.ts:66:7
   const setOptions = {
     'x-crdt-type': 'Set',
   };
-  if (TypeGuard.TString(keyType))
+  if (true)
     return Type.Record(keyType, Register(Type.Boolean()), {
       ...setOptions,

[Killed] ObjectLiteral
src/schema.ts:67:59
     'x-crdt-type': 'Set',
   };
   if (TypeGuard.TString(keyType))
-    return Type.Record(keyType, Register(Type.Boolean()), {
-      ...setOptions,
-      'x-serialized-type': 'set_string',
-    });
+    return Type.Record(keyType, Register(Type.Boolean()), {});
   if (TypeGuard.TNumber(keyType))
     return Type.Record(keyType, Register(Type.Boolean()), {
killedBy: schema triple-store defining a store with a schema should store schema
statusReason: Invalid type: undefined

[Survived] ConditionalExpression
src/schema.ts:71:7
       ...setOptions,
       'x-serialized-type': 'set_string',
     });
-  if (TypeGuard.TNumber(keyType))
+  if (true)
     return Type.Record(keyType, Register(Type.Boolean()), {
       ...setOptions,

[Survived] ConditionalExpression
src/schema.ts:71:7
       ...setOptions,
       'x-serialized-type': 'set_string',
     });
-  if (TypeGuard.TNumber(keyType))
+  if (false)
     return Type.Record(keyType, Register(Type.Boolean()), {
       ...setOptions,

[NoCoverage] StringLiteral
src/schema.ts:77:19
       'x-serialized-type': 'set_number',
     });
 
-  throw new Error('Invalid type for set, must be number or string');
+  throw new Error("");
 }
 

[Killed] BlockStatement
src/schema.ts:94:69
   // [key: keyof any]: DataType; // TODO add tighter type here instead of TSchema
 }
 
-export function Schema<Config extends SchemaConfig>(config: Config) {
-  return Type.Object(config);
-}
+export function Schema<Config extends SchemaConfig>(config: Config) {}
 
 export type Model<T extends SchemaConfig> = ReturnType<typeof Schema<T>>;
killedBy: Set operations can add to set; schema triple-store defining a store with a schema should store schema
statusReason: Cannot read properties of undefined (reading 'properties')

[Killed] ConditionalExpression
src/schema.ts:110:19
   path: Attribute
 ) {
   let scope = model;
-  for (let i = 0; i < path.length; i++) {
+  for (let i = 0; false; i++) {
     const part = path[i];
     // Currently only Sets use Type.Record
killedBy: Set operations can add to set; schema triple-store defining a store with a schema should store schema
statusReason: Invalid type: undefined

[Killed] EqualityOperator
src/schema.ts:110:19
   path: Attribute
 ) {
   let scope = model;
-  for (let i = 0; i < path.length; i++) {
+  for (let i = 0; i >= path.length; i++) {
     const part = path[i];
     // Currently only Sets use Type.Record
killedBy: Set operations can add to set; schema triple-store defining a store with a schema should store schema
statusReason: Invalid type: undefined

[Killed] BlockStatement
src/schema.ts:113:35
   for (let i = 0; i < path.length; i++) {
     const part = path[i];
     // Currently only Sets use Type.Record
-    if (TypeGuard.TRecord(scope)) {
-      for (const [pattern, valueSchema] of Object.entries(
-        scope.patternProperties
-      )) {
-        // NOTE: im pretty sure the only regex pattern is one that matches all strings
-        if (new RegExp(pattern).test(part as string)) {
-          return valueSchema as M;
-        }
-      }
-    } else if (TypeGuard.TObject(scope)) {
+    if (TypeGuard.TRecord(scope)) {} else if (TypeGuard.TObject(scope)) {
       if (!scope.properties[part]) {
         throw new Error(
killedBy: Set operations can add to set
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/schema.ts:113:9
   for (let i = 0; i < path.length; i++) {
     const part = path[i];
     // Currently only Sets use Type.Record
-    if (TypeGuard.TRecord(scope)) {
+    if (false) {
       for (const [pattern, valueSchema] of Object.entries(
         scope.patternProperties
killedBy: Set operations can add to set
statusReason: Bad path to schema

[Killed] BlockStatement
src/schema.ts:116:10
     if (TypeGuard.TRecord(scope)) {
       for (const [pattern, valueSchema] of Object.entries(
         scope.patternProperties
-      )) {
-        // NOTE: im pretty sure the only regex pattern is one that matches all strings
-        if (new RegExp(pattern).test(part as string)) {
-          return valueSchema as M;
-        }
-      }
+      )) {}
     } else if (TypeGuard.TObject(scope)) {
       if (!scope.properties[part]) {
killedBy: Set operations can add to set
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/schema.ts:118:55
         scope.patternProperties
       )) {
         // NOTE: im pretty sure the only regex pattern is one that matches all strings
-        if (new RegExp(pattern).test(part as string)) {
-          return valueSchema as M;
-        }
+        if (new RegExp(pattern).test(part as string)) {}
       }
     } else if (TypeGuard.TObject(scope)) {
killedBy: Set operations can add to set
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/schema.ts:118:13
         scope.patternProperties
       )) {
         // NOTE: im pretty sure the only regex pattern is one that matches all strings
-        if (new RegExp(pattern).test(part as string)) {
+        if (false) {
           return valueSchema as M;
         }
killedBy: Set operations can add to set
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/schema.ts:122:42
           return valueSchema as M;
         }
       }
-    } else if (TypeGuard.TObject(scope)) {
-      if (!scope.properties[part]) {
-        throw new Error(
-          `Path ${path.slice(0, i + 1).join('.')} does not exist in model.`
-        );
-      }
-      scope = scope.properties[part] as M;
-    } else {
+    } else if (TypeGuard.TObject(scope)) {} else {
       throw new Error('Bad path to schema');
     }
killedBy: Set operations can add to set; schema triple-store defining a store with a schema should store schema
statusReason: Invalid type: undefined

[Killed] ConditionalExpression
src/schema.ts:122:16
           return valueSchema as M;
         }
       }
-    } else if (TypeGuard.TObject(scope)) {
+    } else if (false) {
       if (!scope.properties[part]) {
         throw new Error(
killedBy: Set operations can add to set; schema triple-store defining a store with a schema should store schema
statusReason: Bad path to schema

[Killed] BooleanLiteral
src/schema.ts:123:11
         }
       }
     } else if (TypeGuard.TObject(scope)) {
-      if (!scope.properties[part]) {
+      if (scope.properties[part]) {
         throw new Error(
           `Path ${path.slice(0, i + 1).join('.')} does not exist in model.`
killedBy: Set operations can add to set; schema triple-store defining a store with a schema should store schema
statusReason: Path id does not exist in model.

[Killed] ConditionalExpression
src/schema.ts:123:11
         }
       }
     } else if (TypeGuard.TObject(scope)) {
-      if (!scope.properties[part]) {
+      if (true) {
         throw new Error(
           `Path ${path.slice(0, i + 1).join('.')} does not exist in model.`
killedBy: Set operations can add to set; schema triple-store defining a store with a schema should store schema
statusReason: Path id does not exist in model.

[NoCoverage] ArithmeticOperator
src/schema.ts:125:33
     } else if (TypeGuard.TObject(scope)) {
       if (!scope.properties[part]) {
         throw new Error(
-          `Path ${path.slice(0, i + 1).join('.')} does not exist in model.`
+          `Path ${path.slice(0, i - 1).join('.')} does not exist in model.`
         );
       }

[NoCoverage] MethodExpression
src/schema.ts:125:19
     } else if (TypeGuard.TObject(scope)) {
       if (!scope.properties[part]) {
         throw new Error(
-          `Path ${path.slice(0, i + 1).join('.')} does not exist in model.`
+          `Path ${path.join('.')} does not exist in model.`
         );
       }

[NoCoverage] BlockStatement
src/schema.ts:129:12
         );
       }
       scope = scope.properties[part] as M;
-    } else {
-      throw new Error('Bad path to schema');
-    }
+    } else {}
   }
   return scope;

[NoCoverage] StringLiteral
src/schema.ts:130:23
       }
       scope = scope.properties[part] as M;
     } else {
-      throw new Error('Bad path to schema');
+      throw new Error("");
     }
   }

[NoCoverage] BlockStatement
src/schema.ts:136:60
   return scope;
 }
 
-export function initialize<M extends Model<any>>(model: M) {
-  return Value.Create(model);
-}
+export function initialize<M extends Model<any>>(model: M) {}
 
 export function updateEntityAtPath(

[Killed] BlockStatement
src/schema.ts:145:3
   path: Attribute,
   value: any,
   timestamp: TimestampType
-) {
-  const pointer = '/' + path.join('/');
-  const currentValue = ValuePointer.Get(entity, pointer);
-  if (currentValue && timestampCompare(timestamp, currentValue[1]) < 0) {
-    return;
-  }
-  ValuePointer.Set(entity, pointer, [value, timestamp]);
-}
+) {}
 
 export type TypeFromModel<T extends TSchema> = Static<T>;
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[Killed] StringLiteral
src/schema.ts:146:19
   value: any,
   timestamp: TimestampType
 ) {
-  const pointer = '/' + path.join('/');
+  const pointer = "" + path.join('/');
   const currentValue = ValuePointer.Get(entity, pointer);
   if (currentValue && timestampCompare(timestamp, currentValue[1]) < 0) {
killedBy: DurableClock can read new timestamps from the store and update the clock; triple inserts can insert a single triple
statusReason: ValuePointer: Cannot set root value

[Killed] StringLiteral
src/schema.ts:146:35
   value: any,
   timestamp: TimestampType
 ) {
-  const pointer = '/' + path.join('/');
+  const pointer = '/' + path.join("");
   const currentValue = ValuePointer.Get(entity, pointer);
   if (currentValue && timestampCompare(timestamp, currentValue[1]) < 0) {
killedBy: Database API throws an error when a non-terminal object path is provided
statusReason: promise resolved "[object Map]" instead of rejecting

[Killed] ConditionalExpression
src/schema.ts:148:7
 ) {
   const pointer = '/' + path.join('/');
   const currentValue = ValuePointer.Get(entity, pointer);
-  if (currentValue && timestampCompare(timestamp, currentValue[1]) < 0) {
+  if (true) {
     return;
   }
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
src/schema.ts:148:23
 ) {
   const pointer = '/' + path.join('/');
   const currentValue = ValuePointer.Get(entity, pointer);
-  if (currentValue && timestampCompare(timestamp, currentValue[1]) < 0) {
+  if (currentValue && timestampCompare(timestamp, currentValue[1]) >= 0) {
     return;
   }
killedBy: Register operations can set register
statusReason: expected Map{} to have a size of +0 but got 1

[Killed] BlockStatement
src/schema.ts:176:27
 
 export function timestampedObjectToPlainObject<O extends TimestampedObject>(
   obj: O
-): UnTimestampedObject<O> {
-  const entries = Object.entries(obj).map(([key, val]) => {
-    if (typeof val === 'object' && val != null && !(val instanceof Array)) {
-      return [key, timestampedObjectToPlainObject(val)];
-    }
-    return [key, val[0]];
-  });
-  //TODO: result statically typed as any
-  const result = Object.fromEntries(entries);
-  return result;
-}
+): UnTimestampedObject<O> {}
 
 export interface AttributeDefinition {
killedBy: Register operations can set register
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
src/schema.ts:177:59
 export function timestampedObjectToPlainObject<O extends TimestampedObject>(
   obj: O
 ): UnTimestampedObject<O> {
-  const entries = Object.entries(obj).map(([key, val]) => {
-    if (typeof val === 'object' && val != null && !(val instanceof Array)) {
-      return [key, timestampedObjectToPlainObject(val)];
-    }
-    return [key, val[0]];
-  });
+  const entries = Object.entries(obj).map(([key, val]) => {});
   //TODO: result statically typed as any
   const result = Object.fromEntries(entries);
killedBy: Register operations can set register
statusReason: Iterator value undefined is not an entry object

[Killed] BooleanLiteral
src/schema.ts:178:51
   obj: O
 ): UnTimestampedObject<O> {
   const entries = Object.entries(obj).map(([key, val]) => {
-    if (typeof val === 'object' && val != null && !(val instanceof Array)) {
+    if (typeof val === 'object' && val != null && val instanceof Array) {
       return [key, timestampedObjectToPlainObject(val)];
     }
killedBy: Register operations can set register
statusReason: expected { '0': 'D', …(1) } to be 'Dr. Zoidberg' // Object.is equality

[Survived] LogicalOperator
src/schema.ts:178:9
   obj: O
 ): UnTimestampedObject<O> {
   const entries = Object.entries(obj).map(([key, val]) => {
-    if (typeof val === 'object' && val != null && !(val instanceof Array)) {
+    if (typeof val === 'object' || val != null && !(val instanceof Array)) {
       return [key, timestampedObjectToPlainObject(val)];
     }

[Killed] BlockStatement
src/schema.ts:210:21
 
 function collectionsDefinitionToSchema(
   collections: CollectionsDefinition
-): Models<any, any> {
-  const result: Models<any, any> = {};
-  for (const [collectionName, definition] of Object.entries(collections)) {
-    const config: SchemaConfig = {};
-    const attrs = Object.entries(definition.attributes);
-    for (const [path, attrDef] of attrs) {
-      config[path] = attributeDefinitionToSchema(attrDef);
-    }
-    result[collectionName] = Schema(config);
-  }
-
-  return result;
-}
+): Models<any, any> {}
 
 function attributeDefinitionToSchema(schemaItem: AttributeDefinition) {
killedBy: schema changes can add a collection definition to the schema
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
src/schema.ts:212:75
   collections: CollectionsDefinition
 ): Models<any, any> {
   const result: Models<any, any> = {};
-  for (const [collectionName, definition] of Object.entries(collections)) {
-    const config: SchemaConfig = {};
-    const attrs = Object.entries(definition.attributes);
-    for (const [path, attrDef] of attrs) {
-      config[path] = attributeDefinitionToSchema(attrDef);
-    }
-    result[collectionName] = Schema(config);
-  }
+  for (const [collectionName, definition] of Object.entries(collections)) {}
 
   return result;
killedBy: schema changes can add a collection definition to the schema
statusReason: expected {} to have property "students"

[Killed] BlockStatement
src/schema.ts:215:42
   for (const [collectionName, definition] of Object.entries(collections)) {
     const config: SchemaConfig = {};
     const attrs = Object.entries(definition.attributes);
-    for (const [path, attrDef] of attrs) {
-      config[path] = attributeDefinitionToSchema(attrDef);
-    }
+    for (const [path, attrDef] of attrs) {}
     result[collectionName] = Schema(config);
   }
killedBy: schema changes can add a collection definition to the schema
statusReason: expected {} to have property "id"

[Killed] BlockStatement
src/schema.ts:224:71
   return result;
 }
 
-function attributeDefinitionToSchema(schemaItem: AttributeDefinition) {
-  const { type } = schemaItem;
-  if (type === 'string') return string();
-  if (type === 'boolean') return Boolean();
-  if (type === 'number') return number();
-  if (type === 'set_string') return Set(string());
-  if (type === 'set_number') return Set(number());
-  throw new Error(`Invalid type: ${type}`);
-}
+function attributeDefinitionToSchema(schemaItem: AttributeDefinition) {}
 
 export function tuplesToSchema(triples: TuplePrefix<EAV>[]) {
killedBy: schema changes can rename an attribute
statusReason: Bad path to schema

[Killed] ConditionalExpression
src/schema.ts:226:7
 
 function attributeDefinitionToSchema(schemaItem: AttributeDefinition) {
   const { type } = schemaItem;
-  if (type === 'string') return string();
+  if (true) return string();
   if (type === 'boolean') return Boolean();
   if (type === 'number') return number();
killedBy: schema changes can rename an attribute
statusReason: Value 1 does not match schema for students.studentId

[Killed] ConditionalExpression
src/schema.ts:226:7
 
 function attributeDefinitionToSchema(schemaItem: AttributeDefinition) {
   const { type } = schemaItem;
-  if (type === 'string') return string();
+  if (false) return string();
   if (type === 'boolean') return Boolean();
   if (type === 'number') return number();
killedBy: Set operations can add to set; schema triple-store defining a store with a schema should store schema
statusReason: Invalid type: string

[Killed] EqualityOperator
src/schema.ts:227:7
 function attributeDefinitionToSchema(schemaItem: AttributeDefinition) {
   const { type } = schemaItem;
   if (type === 'string') return string();
-  if (type === 'boolean') return Boolean();
+  if (type !== 'boolean') return Boolean();
   if (type === 'number') return number();
   if (type === 'set_string') return Set(string());
killedBy: schema changes can rename an attribute
statusReason: Value 1 does not match schema for students.studentId

[Killed] ConditionalExpression
src/schema.ts:227:7
 function attributeDefinitionToSchema(schemaItem: AttributeDefinition) {
   const { type } = schemaItem;
   if (type === 'string') return string();
-  if (type === 'boolean') return Boolean();
+  if (true) return Boolean();
   if (type === 'number') return number();
   if (type === 'set_string') return Set(string());
killedBy: schema changes can rename an attribute
statusReason: Value 1 does not match schema for students.studentId

[Killed] ConditionalExpression
src/schema.ts:228:7
   const { type } = schemaItem;
   if (type === 'string') return string();
   if (type === 'boolean') return Boolean();
-  if (type === 'number') return number();
+  if (false) return number();
   if (type === 'set_string') return Set(string());
   if (type === 'set_number') return Set(number());
killedBy: Set operations can add to set; schema triple-store defining a store with a schema should overwrite existing schema
statusReason: Invalid type: number

[Killed] EqualityOperator
src/schema.ts:228:7
   const { type } = schemaItem;
   if (type === 'string') return string();
   if (type === 'boolean') return Boolean();
-  if (type === 'number') return number();
+  if (type !== 'number') return number();
   if (type === 'set_string') return Set(string());
   if (type === 'set_number') return Set(number());
killedBy: Set operations can add to set; schema triple-store defining a store with a schema should overwrite existing schema
statusReason: Invalid type: number

[Killed] ConditionalExpression
src/schema.ts:229:7
   if (type === 'string') return string();
   if (type === 'boolean') return Boolean();
   if (type === 'number') return number();
-  if (type === 'set_string') return Set(string());
+  if (false) return Set(string());
   if (type === 'set_number') return Set(number());
   throw new Error(`Invalid type: ${type}`);
killedBy: schema triple-store defining a store with a schema should store schema
statusReason: Invalid type: set_string

[Killed] EqualityOperator
src/schema.ts:229:7
   if (type === 'string') return string();
   if (type === 'boolean') return Boolean();
   if (type === 'number') return number();
-  if (type === 'set_string') return Set(string());
+  if (type !== 'set_string') return Set(string());
   if (type === 'set_number') return Set(number());
   throw new Error(`Invalid type: ${type}`);
killedBy: schema triple-store defining a store with a schema should store schema
statusReason: Invalid type: set_string

[Killed] EqualityOperator
src/schema.ts:230:7
   if (type === 'boolean') return Boolean();
   if (type === 'number') return number();
   if (type === 'set_string') return Set(string());
-  if (type === 'set_number') return Set(number());
+  if (type !== 'set_number') return Set(number());
   throw new Error(`Invalid type: ${type}`);
 }
killedBy: Set operations can add to set
statusReason: Invalid type: set_number

[Killed] ConditionalExpression
src/schema.ts:230:7
   if (type === 'boolean') return Boolean();
   if (type === 'number') return number();
   if (type === 'set_string') return Set(string());
-  if (type === 'set_number') return Set(number());
+  if (false) return Set(number());
   throw new Error(`Invalid type: ${type}`);
 }
killedBy: Set operations can add to set
statusReason: Invalid type: set_number

[NoCoverage] StringLiteral
src/schema.ts:231:19
   if (type === 'number') return number();
   if (type === 'set_string') return Set(string());
   if (type === 'set_number') return Set(number());
-  throw new Error(`Invalid type: ${type}`);
+  throw new Error(``);
 }
 

[Killed] BlockStatement
src/schema.ts:234:61
   throw new Error(`Invalid type: ${type}`);
 }
 
-export function tuplesToSchema(triples: TuplePrefix<EAV>[]) {
-  const schemaData = triplesToObject<{
-    _schema?: SchemaDefinition;
-  }>(triples);
-  const version = schemaData._schema?.version || 0;
-  const collections = schemaData._schema?.collections || {};
-  return { version, collections: collectionsDefinitionToSchema(collections) };
-}
+export function tuplesToSchema(triples: TuplePrefix<EAV>[]) {}
 
 export function schemaToTriples(schema: Models<any, any>): EAV[] {
killedBy: schema changes can add a collection definition to the schema
statusReason: Cannot convert undefined or null to object

[Killed] LogicalOperator
src/schema.ts:238:19
   const schemaData = triplesToObject<{
     _schema?: SchemaDefinition;
   }>(triples);
-  const version = schemaData._schema?.version || 0;
+  const version = schemaData._schema?.version && 0;
   const collections = schemaData._schema?.collections || {};
   return { version, collections: collectionsDefinitionToSchema(collections) };
killedBy: migrations initializing a DB with migrations sets the schema
statusReason: expected { …(1) } to have property "classes"

[Killed] ConditionalExpression
src/schema.ts:238:19
   const schemaData = triplesToObject<{
     _schema?: SchemaDefinition;
   }>(triples);
-  const version = schemaData._schema?.version || 0;
+  const version = true;
   const collections = schemaData._schema?.collections || {};
   return { version, collections: collectionsDefinitionToSchema(collections) };
killedBy: migrations initializing a DB with migrations sets the schema
statusReason: expected { …(1) } to have property "classes"

[Killed] ConditionalExpression
src/schema.ts:239:23
     _schema?: SchemaDefinition;
   }>(triples);
   const version = schemaData._schema?.version || 0;
-  const collections = schemaData._schema?.collections || {};
+  const collections = true;
   return { version, collections: collectionsDefinitionToSchema(collections) };
 }
killedBy: schema changes can add a collection definition to the schema
statusReason: expected {} to have property "students"

[Killed] ConditionalExpression
src/schema.ts:239:23
     _schema?: SchemaDefinition;
   }>(triples);
   const version = schemaData._schema?.version || 0;
-  const collections = schemaData._schema?.collections || {};
+  const collections = false;
   return { version, collections: collectionsDefinitionToSchema(collections) };
 }
killedBy: schema changes can add a collection definition to the schema
statusReason: expected {} to have property "students"

[Killed] ObjectLiteral
src/schema.ts:240:10
   }>(triples);
   const version = schemaData._schema?.version || 0;
   const collections = schemaData._schema?.collections || {};
-  return { version, collections: collectionsDefinitionToSchema(collections) };
+  return {};
 }
 
killedBy: schema changes can add a collection definition to the schema
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
src/schema.ts:243:66
   return { version, collections: collectionsDefinitionToSchema(collections) };
 }
 
-export function schemaToTriples(schema: Models<any, any>): EAV[] {
-  const collections: CollectionsDefinition = {};
-  for (const [collectionName, model] of Object.entries(schema)) {
-    const collection: CollectionDefinition = { attributes: {}, rules: {} };
-    for (const path of Object.keys(model.properties)) {
-      const pathSchema = getSchemaFromPath(model, [path]);
-      collection.attributes[path] = {
-        type: pathSchema['x-serialized-type'],
-      };
-    }
-    collections[collectionName] = collection;
-  }
-  const schemaData: SchemaDefinition = { version: 0, collections };
-  const tuples = objectToTuples(schemaData);
-  return tuples.map((tuple) => {
-    const value = tuple.pop();
-    return ['_schema', tuple, value] as EAV;
-  });
-}
+export function schemaToTriples(schema: Models<any, any>): EAV[] {}
 
killedBy: Set operations can add to set; schema triple-store defining a store with a schema should store schema
statusReason: updates is not iterable
