[Killed] BlockStatement
src/schema.ts:245:65
 
 export function schemaToTriples(schema: Models<any, any>): EAV[] {
   const collections: CollectionsDefinition = {};
-  for (const [collectionName, model] of Object.entries(schema)) {
-    const collection: CollectionDefinition = { attributes: {}, rules: {} };
-    for (const path of Object.keys(model.properties)) {
-      const pathSchema = getSchemaFromPath(model, [path]);
-      collection.attributes[path] = {
-        type: pathSchema['x-serialized-type'],
-      };
-    }
-    collections[collectionName] = collection;
-  }
+  for (const [collectionName, model] of Object.entries(schema)) {}
   const schemaData: SchemaDefinition = { version: 0, collections };
   const tuples = objectToTuples(schemaData);
killedBy: schema changes can drop a collection definition from the schema
statusReason: expected { …(1) } to not have property "students"

[Killed] ObjectLiteral
src/schema.ts:246:46
 export function schemaToTriples(schema: Models<any, any>): EAV[] {
   const collections: CollectionsDefinition = {};
   for (const [collectionName, model] of Object.entries(schema)) {
-    const collection: CollectionDefinition = { attributes: {}, rules: {} };
+    const collection: CollectionDefinition = {};
     for (const path of Object.keys(model.properties)) {
       const pathSchema = getSchemaFromPath(model, [path]);
killedBy: Set operations can add to set; schema triple-store defining a store with a schema should store schema
statusReason: Cannot set properties of undefined (setting 'id')

[Killed] BlockStatement
src/schema.ts:247:55
   const collections: CollectionsDefinition = {};
   for (const [collectionName, model] of Object.entries(schema)) {
     const collection: CollectionDefinition = { attributes: {}, rules: {} };
-    for (const path of Object.keys(model.properties)) {
-      const pathSchema = getSchemaFromPath(model, [path]);
-      collection.attributes[path] = {
-        type: pathSchema['x-serialized-type'],
-      };
-    }
+    for (const path of Object.keys(model.properties)) {}
     collections[collectionName] = collection;
   }
killedBy: schema changes can drop a collection definition from the schema
statusReason: expected { …(1) } to not have property "students"

[Killed] ObjectLiteral
src/schema.ts:249:37
     const collection: CollectionDefinition = { attributes: {}, rules: {} };
     for (const path of Object.keys(model.properties)) {
       const pathSchema = getSchemaFromPath(model, [path]);
-      collection.attributes[path] = {
-        type: pathSchema['x-serialized-type'],
-      };
+      collection.attributes[path] = {};
     }
     collections[collectionName] = collection;
killedBy: schema changes can drop a collection definition from the schema
statusReason: expected { …(1) } to not have property "students"

[Killed] ObjectLiteral
src/schema.ts:255:40
     }
     collections[collectionName] = collection;
   }
-  const schemaData: SchemaDefinition = { version: 0, collections };
+  const schemaData: SchemaDefinition = {};
   const tuples = objectToTuples(schemaData);
   return tuples.map((tuple) => {
killedBy: schema triple-store defining a store with a schema should store schema
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/schema.ts:257:32
   }
   const schemaData: SchemaDefinition = { version: 0, collections };
   const tuples = objectToTuples(schemaData);
-  return tuples.map((tuple) => {
-    const value = tuple.pop();
-    return ['_schema', tuple, value] as EAV;
-  });
+  return tuples.map((tuple) => {});
 }
 
killedBy: Set operations can add to set; schema triple-store defining a store with a schema should store schema
statusReason: .for is not iterable
