[NoCoverage] BlockStatement
src/storage/cached-indexed-db.ts:13:38
   private _indexedDB: IndexedDbTupleStorage;
   private _cache: MemoryBTree;
   private _dbReady: Promise<void>;
-  constructor(public dbName: string) {
-    this._indexedDB = new IndexedDbTupleStorage(dbName);
-    this._cache = new MemoryBTree();
-    this._dbReady = new Promise(async (res, rej) => {
-      try {
-        const results = await this._indexedDB.scan();
-        this._cache.commit({ set: results });
-        res();
-      } catch (e) {
-        rej(e);
-      }
-    });
-  }
+  constructor(public dbName: string) {}
   async scan(args?: ScanStorageArgs | undefined): Promise<KeyValuePair[]> {
     await this._dbReady;

[NoCoverage] BlockStatement
src/storage/cached-indexed-db.ts:16:53
   constructor(public dbName: string) {
     this._indexedDB = new IndexedDbTupleStorage(dbName);
     this._cache = new MemoryBTree();
-    this._dbReady = new Promise(async (res, rej) => {
-      try {
-        const results = await this._indexedDB.scan();
-        this._cache.commit({ set: results });
-        res();
-      } catch (e) {
-        rej(e);
-      }
-    });
+    this._dbReady = new Promise(async (res, rej) => {});
   }
   async scan(args?: ScanStorageArgs | undefined): Promise<KeyValuePair[]> {

[NoCoverage] BlockStatement
src/storage/cached-indexed-db.ts:17:11
     this._indexedDB = new IndexedDbTupleStorage(dbName);
     this._cache = new MemoryBTree();
     this._dbReady = new Promise(async (res, rej) => {
-      try {
-        const results = await this._indexedDB.scan();
-        this._cache.commit({ set: results });
-        res();
-      } catch (e) {
+      try {} catch (e) {
         rej(e);
       }

[NoCoverage] BlockStatement
src/storage/cached-indexed-db.ts:21:19
         const results = await this._indexedDB.scan();
         this._cache.commit({ set: results });
         res();
-      } catch (e) {
-        rej(e);
-      }
+      } catch (e) {}
     });
   }

[NoCoverage] BlockStatement
src/storage/cached-indexed-db.ts:26:75
       }
     });
   }
-  async scan(args?: ScanStorageArgs | undefined): Promise<KeyValuePair[]> {
-    await this._dbReady;
-    return this._cache.scan(args);
-  }
+  async scan(args?: ScanStorageArgs | undefined): Promise<KeyValuePair[]> {}
 
   async commit(writes: WriteOps<KeyValuePair>): Promise<void> {

[NoCoverage] BlockStatement
src/storage/cached-indexed-db.ts:31:63
     return this._cache.scan(args);
   }
 
-  async commit(writes: WriteOps<KeyValuePair>): Promise<void> {
-    await this._dbReady;
-    this._cache.commit(writes);
-    this._indexedDB.commit(writes);
-  }
+  async commit(writes: WriteOps<KeyValuePair>): Promise<void> {}
   async close(): Promise<void> {
     await this._dbReady;

[NoCoverage] BlockStatement
src/storage/cached-indexed-db.ts:36:32
     this._cache.commit(writes);
     this._indexedDB.commit(writes);
   }
-  async close(): Promise<void> {
-    await this._dbReady;
-    this._cache.close();
-    await this._indexedDB.close();
-  }
+  async close(): Promise<void> {}
 }
 
