[Killed] BlockStatement
src/storage/memory-btree.ts:18:17
 const BTreeClass = (BTree.default ? BTree.default : BTree) as typeof BTree;
 export default class MemoryBTree implements TupleStorageApi {
   btree: BTree<any, any>;
-  constructor() {
-    this.btree = new BTreeClass<Tuple, any>(undefined, compareTuple);
-  }
+  constructor() {}
   scan(args?: ScanStorageArgs | undefined): KeyValuePair[] {
     // const { start, end, limit, reverse } = args || {}
killedBy: DurableClock creates a fresh clock if no relevant metadata; Database API can furnish the client id
statusReason: Cannot read properties of undefined (reading 'forRange')

[Killed] BlockStatement
src/storage/memory-btree.ts:21:60
   constructor() {
     this.btree = new BTreeClass<Tuple, any>(undefined, compareTuple);
   }
-  scan(args?: ScanStorageArgs | undefined): KeyValuePair[] {
-    // const { start, end, limit, reverse } = args || {}
-    const low = args?.gte ?? args?.gt ?? MIN;
-    const high = args?.lte ?? args?.lt ?? MAX;
-    const results: KeyValuePair[] = [];
-    this.btree.forRange(
-      low,
-      high,
-      args?.lte != null,
-      (key, value, n) => {
-        results.push({ key, value });
-        if (args?.limit && n >= args.limit) return { break: n };
-        return;
-      },
-      args?.gte != null ? 0 : -1
-    );
-    if (args?.reverse) results.reverse();
-    return results;
-  }
+  scan(args?: ScanStorageArgs | undefined): KeyValuePair[] {}
   commit(writes: WriteOps<KeyValuePair>): void {
     const { set, remove } = writes;
killedBy: triple inserts can insert a single triple; DurableClock creates a fresh clock if no relevant metadata
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] LogicalOperator
src/storage/memory-btree.ts:23:17
   }
   scan(args?: ScanStorageArgs | undefined): KeyValuePair[] {
     // const { start, end, limit, reverse } = args || {}
-    const low = args?.gte ?? args?.gt ?? MIN;
+    const low = args?.gte && args?.gt ?? MIN;
     const high = args?.lte ?? args?.lt ?? MAX;
     const results: KeyValuePair[] = [];
killedBy: Database API can furnish the client id
statusReason: Cannot read properties of null (reading 'length')

[Killed] LogicalOperator
src/storage/memory-btree.ts:23:17
   }
   scan(args?: ScanStorageArgs | undefined): KeyValuePair[] {
     // const { start, end, limit, reverse } = args || {}
-    const low = args?.gte ?? args?.gt ?? MIN;
+    const low = (args?.gte ?? args?.gt) && MIN;
     const high = args?.lte ?? args?.lt ?? MAX;
     const results: KeyValuePair[] = [];
killedBy: DurableClock initializes with persisted clock if available
statusReason: Cannot read properties of null (reading 'length')

[Killed] LogicalOperator
src/storage/memory-btree.ts:24:18
   scan(args?: ScanStorageArgs | undefined): KeyValuePair[] {
     // const { start, end, limit, reverse } = args || {}
     const low = args?.gte ?? args?.gt ?? MIN;
-    const high = args?.lte ?? args?.lt ?? MAX;
+    const high = args?.lte && args?.lt ?? MAX;
     const results: KeyValuePair[] = [];
     this.btree.forRange(
killedBy: Database API supports basic queries with filters; triple inserts can insert a single triple
statusReason: unsupported index

[Killed] LogicalOperator
src/storage/memory-btree.ts:24:18
   scan(args?: ScanStorageArgs | undefined): KeyValuePair[] {
     // const { start, end, limit, reverse } = args || {}
     const low = args?.gte ?? args?.gt ?? MIN;
-    const high = args?.lte ?? args?.lt ?? MAX;
+    const high = (args?.lte ?? args?.lt) && MAX;
     const results: KeyValuePair[] = [];
     this.btree.forRange(
killedBy: triple inserts can insert a single triple
statusReason: expected [ { id: 'id', …(4) }, …(1) ] to have a length of 1 but got 2

[Killed] ArrayDeclaration
src/storage/memory-btree.ts:25:37
     // const { start, end, limit, reverse } = args || {}
     const low = args?.gte ?? args?.gt ?? MIN;
     const high = args?.lte ?? args?.lt ?? MAX;
-    const results: KeyValuePair[] = [];
+    const results: KeyValuePair[] = ["Stryker was here"];
     this.btree.forRange(
       low,
killedBy: DurableClock creates a fresh clock if no relevant metadata; triple inserts can insert a single triple
statusReason: Cannot read properties of undefined (reading 'slice')

[Survived] OptionalChaining
src/storage/memory-btree.ts:29:7
     this.btree.forRange(
       low,
       high,
-      args?.lte != null,
+      args.lte != null,
       (key, value, n) => {
         results.push({ key, value });

[Survived] ConditionalExpression
src/storage/memory-btree.ts:29:7
     this.btree.forRange(
       low,
       high,
-      args?.lte != null,
+      false,
       (key, value, n) => {
         results.push({ key, value });

[Killed] BlockStatement
src/storage/memory-btree.ts:30:26
       low,
       high,
       args?.lte != null,
-      (key, value, n) => {
-        results.push({ key, value });
-        if (args?.limit && n >= args.limit) return { break: n };
-        return;
-      },
+      (key, value, n) => {},
       args?.gte != null ? 0 : -1
     );
killedBy: Database API can lookup entity by Id; triple inserts can insert a single triple
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/storage/memory-btree.ts:32:13
       args?.lte != null,
       (key, value, n) => {
         results.push({ key, value });
-        if (args?.limit && n >= args.limit) return { break: n };
+        if (true) return { break: n };
         return;
       },
killedBy: DurableClock initializes with persisted clock if available; Database API supports basic queries with filters; search/scan functionality can find by attribute
statusReason: expected undefined to be 15 // Object.is equality

[Survived] ConditionalExpression
src/storage/memory-btree.ts:32:28
       args?.lte != null,
       (key, value, n) => {
         results.push({ key, value });
-        if (args?.limit && n >= args.limit) return { break: n };
+        if (args?.limit && true) return { break: n };
         return;
       },

[Survived] ConditionalExpression
src/storage/memory-btree.ts:35:7
         if (args?.limit && n >= args.limit) return { break: n };
         return;
       },
-      args?.gte != null ? 0 : -1
+      true ? 0 : -1
     );
     if (args?.reverse) results.reverse();

[Survived] UnaryOperator
src/storage/memory-btree.ts:35:31
         if (args?.limit && n >= args.limit) return { break: n };
         return;
       },
-      args?.gte != null ? 0 : -1
+      args?.gte != null ? 0 : +1
     );
     if (args?.reverse) results.reverse();

[Killed] MethodExpression
src/storage/memory-btree.ts:37:24
       },
       args?.gte != null ? 0 : -1
     );
-    if (args?.reverse) results.reverse();
+    if (args?.reverse) results;
     return results;
   }
killedBy: search/scan functionality can find by the max timestamp
statusReason: expected [ 1, 'A' ] to strictly equal [ 2, 'A' ]

[Killed] ConditionalExpression
src/storage/memory-btree.ts:37:9
       },
       args?.gte != null ? 0 : -1
     );
-    if (args?.reverse) results.reverse();
+    if (false) results.reverse();
     return results;
   }
killedBy: search/scan functionality can find by the max timestamp
statusReason: expected [ 1, 'A' ] to strictly equal [ 2, 'A' ]

[Killed] BlockStatement
src/storage/memory-btree.ts:40:48
     if (args?.reverse) results.reverse();
     return results;
   }
-  commit(writes: WriteOps<KeyValuePair>): void {
-    const { set, remove } = writes;
-    for (const tuple of remove || []) {
-      this.btree.delete(tuple);
-    }
-    for (const { key, value } of set || []) {
-      this.btree.set(key, value);
-    }
-  }
+  commit(writes: WriteOps<KeyValuePair>): void {}
   close(): void {}
 
killedBy: DurableClock initializes with persisted clock if available; triple inserts can insert a single triple
statusReason: expected +0 to be 15 // Object.is equality

[Killed] ConditionalExpression
src/storage/memory-btree.ts:42:25
   }
   commit(writes: WriteOps<KeyValuePair>): void {
     const { set, remove } = writes;
-    for (const tuple of remove || []) {
+    for (const tuple of false) {
       this.btree.delete(tuple);
     }
killedBy: DurableClock creates a fresh clock if no relevant metadata
statusReason: stryCov_9fa48 is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
src/storage/memory-btree.ts:42:25
   }
   commit(writes: WriteOps<KeyValuePair>): void {
     const { set, remove } = writes;
-    for (const tuple of remove || []) {
+    for (const tuple of true) {
       this.btree.delete(tuple);
     }
killedBy: DurableClock creates a fresh clock if no relevant metadata
statusReason: stryCov_9fa48 is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] LogicalOperator
src/storage/memory-btree.ts:45:34
     for (const tuple of remove || []) {
       this.btree.delete(tuple);
     }
-    for (const { key, value } of set || []) {
+    for (const { key, value } of set && []) {
       this.btree.set(key, value);
     }
killedBy: triple inserts can insert a single triple
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/storage/memory-btree.ts:45:34
     for (const tuple of remove || []) {
       this.btree.delete(tuple);
     }
-    for (const { key, value } of set || []) {
+    for (const { key, value } of true) {
       this.btree.set(key, value);
     }
killedBy: Database API can furnish the client id
statusReason: stryCov_9fa48 is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
src/storage/memory-btree.ts:51:16
   }
   close(): void {}
 
-  wipe(): void {
-    this.btree = new BTreeClass<Tuple, any>(undefined, compareTuple);
-  }
+  wipe(): void {}
 }
 
killedBy: timestamp index greater than queries
statusReason: attr does not match any registered models (Task)
