[Killed] BlockStatement
src/timestamp.ts:6:3
 export function timestampCompare(
   a: Timestamp | undefined,
   b: Timestamp | undefined
-) {
-  if (!a && !b) return 0;
-  if (!a) return -1;
-  if (!b) return 1;
-  if (a[0] !== b[0]) return a[0] < b[0] ? -1 : 1;
-  if (a[1] !== b[1]) return a[1] < b[1] ? -1 : 1;
-  return 0;
-}
+) {}
 
killedBy: subscriptions handles selection updates; DurableClock can read new timestamps from the store and update the clock
statusReason: expected 'Computer Science' to be 'Math' // Object.is equality

[Killed] BooleanLiteral
src/timestamp.ts:7:7
   a: Timestamp | undefined,
   b: Timestamp | undefined
 ) {
-  if (!a && !b) return 0;
+  if (a && !b) return 0;
   if (!a) return -1;
   if (!b) return 1;
killedBy: DurableClock can read new timestamps from the store and update the clock
statusReason: expected +0 to be 16 // Object.is equality

[Killed] ConditionalExpression
src/timestamp.ts:7:7
   a: Timestamp | undefined,
   b: Timestamp | undefined
 ) {
-  if (!a && !b) return 0;
+  if (true) return 0;
   if (!a) return -1;
   if (!b) return 1;
killedBy: DurableClock can read new timestamps from the store and update the clock; subscriptions handles selection updates
statusReason: expected +0 to be 16 // Object.is equality

[Killed] BooleanLiteral
src/timestamp.ts:8:7
   b: Timestamp | undefined
 ) {
   if (!a && !b) return 0;
-  if (!a) return -1;
+  if (a) return -1;
   if (!b) return 1;
   if (a[0] !== b[0]) return a[0] < b[0] ? -1 : 1;
killedBy: Register operations can set register; DurableClock can read new timestamps from the store and update the clock
statusReason: expected Map{} to have a size of +0 but got 1

[Killed] ConditionalExpression
src/timestamp.ts:8:7
   b: Timestamp | undefined
 ) {
   if (!a && !b) return 0;
-  if (!a) return -1;
+  if (true) return -1;
   if (!b) return 1;
   if (a[0] !== b[0]) return a[0] < b[0] ? -1 : 1;
killedBy: DurableClock can read new timestamps from the store and update the clock
statusReason: expected +0 to be 16 // Object.is equality

[Killed] ConditionalExpression
src/timestamp.ts:9:7
 ) {
   if (!a && !b) return 0;
   if (!a) return -1;
-  if (!b) return 1;
+  if (true) return 1;
   if (a[0] !== b[0]) return a[0] < b[0] ? -1 : 1;
   if (a[1] !== b[1]) return a[1] < b[1] ? -1 : 1;
killedBy: Register operations can set register; mutating triple values from the store can set the value of a triple
statusReason: expected Map{} to have a size of +0 but got 1

[Killed] ConditionalExpression
src/timestamp.ts:9:7
 ) {
   if (!a && !b) return 0;
   if (!a) return -1;
-  if (!b) return 1;
+  if (false) return 1;
   if (a[0] !== b[0]) return a[0] < b[0] ? -1 : 1;
   if (a[1] !== b[1]) return a[1] < b[1] ? -1 : 1;
killedBy: DurableClock can read new timestamps from the store and update the clock
statusReason: expected +0 to be 16 // Object.is equality

[Killed] ConditionalExpression
src/timestamp.ts:10:29
   if (!a && !b) return 0;
   if (!a) return -1;
   if (!b) return 1;
-  if (a[0] !== b[0]) return a[0] < b[0] ? -1 : 1;
+  if (a[0] !== b[0]) return false ? -1 : 1;
   if (a[1] !== b[1]) return a[1] < b[1] ? -1 : 1;
   return 0;
killedBy: Register operations can set register
statusReason: expected Map{} to have a size of +0 but got 1

[Killed] UnaryOperator
src/timestamp.ts:10:43
   if (!a && !b) return 0;
   if (!a) return -1;
   if (!b) return 1;
-  if (a[0] !== b[0]) return a[0] < b[0] ? -1 : 1;
+  if (a[0] !== b[0]) return a[0] < b[0] ? +1 : 1;
   if (a[1] !== b[1]) return a[1] < b[1] ? -1 : 1;
   return 0;
killedBy: mutating triple values from the store can set the value of a triple
statusReason: expected 'value' to be 'new-value' // Object.is equality

[Survived] ConditionalExpression
src/timestamp.ts:11:7
   if (!a) return -1;
   if (!b) return 1;
   if (a[0] !== b[0]) return a[0] < b[0] ? -1 : 1;
-  if (a[1] !== b[1]) return a[1] < b[1] ? -1 : 1;
+  if (false) return a[1] < b[1] ? -1 : 1;
   return 0;
 }

[NoCoverage] UnaryOperator
src/timestamp.ts:11:43
   if (!a) return -1;
   if (!b) return 1;
   if (a[0] !== b[0]) return a[0] < b[0] ? -1 : 1;
-  if (a[1] !== b[1]) return a[1] < b[1] ? -1 : 1;
+  if (a[1] !== b[1]) return a[1] < b[1] ? +1 : 1;
   return 0;
 }
