[Killed] ConditionalExpression
src/triple-store.ts:105:5
   const indexType = index.key[0];
   let e, a, v, t;
   switch (indexType) {
-    case 'EAV':
-      [, e, a, v, t] = index.key as EAVIndex['key'];
-      break;
+    case 'EAV':
     case 'AVE':
       [, a, v, e, t] = index.key as AVEIndex['key'];
killedBy: subscriptions handles selection updates; triple inserts can insert a single triple
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/triple-store.ts:105:10
   const indexType = index.key[0];
   let e, a, v, t;
   switch (indexType) {
-    case 'EAV':
+    case "":
       [, e, a, v, t] = index.key as EAVIndex['key'];
       break;
killedBy: DurableClock can read new timestamps from the store and update the clock; triple inserts can insert a single triple; Register operations can set register
statusReason: expected +0 to be 16 // Object.is equality

[Killed] ConditionalExpression
src/triple-store.ts:108:5
     case 'EAV':
       [, e, a, v, t] = index.key as EAVIndex['key'];
       break;
-    case 'AVE':
-      [, a, v, e, t] = index.key as AVEIndex['key'];
-      break;
+    case 'AVE':
+// case 'VAE':
+//   [, v, a, e, t] = index.key as VAEIndex['key'];
+//   break;
     // case 'VAE':
     //   [, v, a, e, t] = index.key as VAEIndex['key'];
killedBy: Database API can report basic collection stats from the database; triple inserts can insert a single triple
statusReason: expected [ undefined ] to deeply equal [ 'Class', 'Department', …(2) ]

[Killed] ConditionalExpression
src/triple-store.ts:114:5
     // case 'VAE':
     //   [, v, a, e, t] = index.key as VAEIndex['key'];
     //   break;
-    case 'clientTimestamp':
-      [, , t, e, a, v] = index.key as ClientTimestampIndex['key'];
-      break;
+    // case 'VAE':
+//   [, v, a, e, t] = index.key as VAEIndex['key'];
+//   break;
+case 'clientTimestamp':
     default:
       throw new Error('unsupported index');
killedBy: search/scan functionality can find by clientId
statusReason: unsupported index

[NoCoverage] ConditionalExpression
src/triple-store.ts:117:5
     case 'clientTimestamp':
       [, , t, e, a, v] = index.key as ClientTimestampIndex['key'];
       break;
-    default:
-      throw new Error('unsupported index');
+    default:
   }
   return {

[Killed] ObjectLiteral
src/triple-store.ts:120:10
     default:
       throw new Error('unsupported index');
   }
-  return {
-    id: e,
-    attribute: a,
-    value: v,
-    timestamp: t,
-    expired: index.value.expired,
-  };
+  return {};
 }
 
killedBy: triple inserts can insert a single triple; Database API supports basic queries with filters; DurableClock can read new timestamps from the store and update the clock
statusReason: expected undefined to be 'value' // Object.is equality

[Killed] BlockStatement
src/triple-store.ts:129:70
   };
 }
 
-function isTupleStorage(object: any): object is AsyncTupleStorageApi {
-  if (typeof object !== 'object') return false;
-  const storageKeys: (keyof AsyncTupleStorageApi)[] = [
-    'close',
-    'commit',
-    'scan',
-  ];
-  return storageKeys.every((objKey) => objKey in object);
-}
+function isTupleStorage(object: any): object is AsyncTupleStorageApi {}
 
 export interface TripleStoreApi {
killedBy: triple inserts can insert a single triple
statusReason: this.storage.scan is not a function

[Killed] EqualityOperator
src/triple-store.ts:130:7
 }
 
 function isTupleStorage(object: any): object is AsyncTupleStorageApi {
-  if (typeof object !== 'object') return false;
+  if (typeof object === 'object') return false;
   const storageKeys: (keyof AsyncTupleStorageApi)[] = [
     'close',
killedBy: triple inserts can insert a single triple
statusReason: this.storage.scan is not a function

[Killed] ConditionalExpression
src/triple-store.ts:130:7
 }
 
 function isTupleStorage(object: any): object is AsyncTupleStorageApi {
-  if (typeof object !== 'object') return false;
+  if (true) return false;
   const storageKeys: (keyof AsyncTupleStorageApi)[] = [
     'close',
killedBy: triple inserts can insert a single triple
statusReason: this.storage.scan is not a function

[Killed] ArrayDeclaration
src/triple-store.ts:131:55
 
 function isTupleStorage(object: any): object is AsyncTupleStorageApi {
   if (typeof object !== 'object') return false;
-  const storageKeys: (keyof AsyncTupleStorageApi)[] = [
-    'close',
-    'commit',
-    'scan',
-  ];
+  const storageKeys: (keyof AsyncTupleStorageApi)[] = [];
   return storageKeys.every((objKey) => objKey in object);
 }
killedBy: DurableClock initializes with persisted clock if available; Database API can furnish the client id; setStorageScope using setStorageScope scopes writes
statusReason: this.storage.scan is not a function

[Killed] StringLiteral
src/triple-store.ts:132:5
 function isTupleStorage(object: any): object is AsyncTupleStorageApi {
   if (typeof object !== 'object') return false;
   const storageKeys: (keyof AsyncTupleStorageApi)[] = [
-    'close',
+    "",
     'commit',
     'scan',
killedBy: triple inserts can insert a single triple
statusReason: this.storage.scan is not a function

[Killed] StringLiteral
src/triple-store.ts:134:5
   const storageKeys: (keyof AsyncTupleStorageApi)[] = [
     'close',
     'commit',
-    'scan',
+    "",
   ];
   return storageKeys.every((objKey) => objKey in object);
killedBy: triple inserts can insert a single triple
statusReason: this.storage.scan is not a function

[Killed] ArrowFunction
src/triple-store.ts:136:28
     'commit',
     'scan',
   ];
-  return storageKeys.every((objKey) => objKey in object);
+  return storageKeys.every(() => undefined);
 }
 
killedBy: triple inserts can insert a single triple
statusReason: this.storage.scan is not a function

[Survived] MethodExpression
src/triple-store.ts:136:10
     'commit',
     'scan',
   ];
-  return storageKeys.every((objKey) => objKey in object);
+  return storageKeys.some(objKey => objKey in object);
 }
 

[Killed] BlockStatement
src/triple-store.ts:226:6
     tupleOperator: ScopedMultiTupleOperator<TupleIndex>;
     clock: Clock;
     schema?: StoreSchema<Models<any, any>>;
-  }) {
-    this.tupleOperator = tupleOperator;
-    // this.schema = schema;
-    this.clock = clock;
-    // This is probably not needed but currently doesn't work because there is no `subscribe`
-    // on the tuple transaction api
-    // syncClockWithStore(clock, this);
-
-    // When updating schema tuples, we need to update the schema object for this tx
-    // Tuple-database doesnt support listening to non commited writes, so manually listening
-    // this.schema = this.readSchema();
-    this.schema = schema;
-    this.onMetadataChange(async ({ updates, deletes }) => {
-      if (
-        updates.some((u) => u[0] === '_schema') ||
-        deletes.some((d) => d[0] === '_schema')
-      ) {
-        this.schema = await this.readSchemaFromStorage();
-      }
-    });
-  }
+  }) {}
 
   async readSchema() {
killedBy: DurableClock creates a fresh clock if no relevant metadata; Database API can furnish the client id; triple inserts can insert a single triple
statusReason: Cannot read properties of undefined (reading 'set')

[Killed] BlockStatement
src/triple-store.ts:238:59
     // Tuple-database doesnt support listening to non commited writes, so manually listening
     // this.schema = this.readSchema();
     this.schema = schema;
-    this.onMetadataChange(async ({ updates, deletes }) => {
-      if (
-        updates.some((u) => u[0] === '_schema') ||
-        deletes.some((d) => d[0] === '_schema')
-      ) {
-        this.schema = await this.readSchemaFromStorage();
-      }
-    });
+    this.onMetadataChange(async ({ updates, deletes }) => {});
   }
 
killedBy: schema changes can rename an attribute
statusReason: Path studentId does not exist in model.

[Killed] ConditionalExpression
src/triple-store.ts:240:29
     this.schema = schema;
     this.onMetadataChange(async ({ updates, deletes }) => {
       if (
-        updates.some((u) => u[0] === '_schema') ||
+        updates.some((u) => false) ||
         deletes.some((d) => d[0] === '_schema')
       ) {
killedBy: schema changes can rename an attribute
statusReason: Path studentId does not exist in model.

[Killed] ArrowFunction
src/triple-store.ts:240:22
     this.schema = schema;
     this.onMetadataChange(async ({ updates, deletes }) => {
       if (
-        updates.some((u) => u[0] === '_schema') ||
+        updates.some(() => undefined) ||
         deletes.some((d) => d[0] === '_schema')
       ) {
killedBy: schema changes can rename an attribute
statusReason: Path studentId does not exist in model.

[Survived] ConditionalExpression
src/triple-store.ts:241:29
     this.onMetadataChange(async ({ updates, deletes }) => {
       if (
         updates.some((u) => u[0] === '_schema') ||
-        deletes.some((d) => d[0] === '_schema')
+        deletes.some((d) => true)
       ) {
         this.schema = await this.readSchemaFromStorage();

[Survived] EqualityOperator
src/triple-store.ts:241:29
     this.onMetadataChange(async ({ updates, deletes }) => {
       if (
         updates.some((u) => u[0] === '_schema') ||
-        deletes.some((d) => d[0] === '_schema')
+        deletes.some((d) => d[0] !== '_schema')
       ) {
         this.schema = await this.readSchemaFromStorage();

[Killed] BlockStatement
src/triple-store.ts:242:9
       if (
         updates.some((u) => u[0] === '_schema') ||
         deletes.some((d) => d[0] === '_schema')
-      ) {
-        this.schema = await this.readSchemaFromStorage();
-      }
+      ) {}
     });
   }
killedBy: schema changes can rename an attribute
statusReason: Path studentId does not exist in model.

[Killed] BlockStatement
src/triple-store.ts:248:22
     });
   }
 
-  async readSchema() {
-    return this.schema;
-  }
+  async readSchema() {}
 
   private async readSchemaFromStorage() {
killedBy: schema triple-store should prevent wrong types
statusReason: promise resolved "undefined" instead of rejecting

[Survived] BlockStatement
src/triple-store.ts:252:41
     return this.schema;
   }
 
-  private async readSchemaFromStorage() {
-    const schemaTriples = await this.readMetadataTuples('_schema');
-    // At some point we probably want to validate the we extract (ie has expected props)
-    if (!schemaTriples.length) return undefined;
-    return tuplesToSchema(schemaTriples);
-  }
+  private async readSchemaFromStorage() {}
 
   async findByCollection(

[Survived] StringLiteral
src/triple-store.ts:253:57
   }
 
   private async readSchemaFromStorage() {
-    const schemaTriples = await this.readMetadataTuples('_schema');
+    const schemaTriples = await this.readMetadataTuples("");
     // At some point we probably want to validate the we extract (ie has expected props)
     if (!schemaTriples.length) return undefined;

[Survived] BooleanLiteral
src/triple-store.ts:255:9
   private async readSchemaFromStorage() {
     const schemaTriples = await this.readMetadataTuples('_schema');
     // At some point we probably want to validate the we extract (ie has expected props)
-    if (!schemaTriples.length) return undefined;
+    if (schemaTriples.length) return undefined;
     return tuplesToSchema(schemaTriples);
   }

[Survived] ConditionalExpression
src/triple-store.ts:255:9
   private async readSchemaFromStorage() {
     const schemaTriples = await this.readMetadataTuples('_schema');
     // At some point we probably want to validate the we extract (ie has expected props)
-    if (!schemaTriples.length) return undefined;
+    if (true) return undefined;
     return tuplesToSchema(schemaTriples);
   }

[Killed] BlockStatement
src/triple-store.ts:262:27
   async findByCollection(
     collection: string,
     direction?: 'ASC' | 'DESC' | undefined
-  ): Promise<TripleRow[]> {
-    return findByCollection(this.tupleOperator, collection, direction);
-  }
+  ): Promise<TripleRow[]> {}
 
   async findValuesInRange(
killedBy: search/scan functionality can find by collection
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/triple-store.ts:275:5
           direction?: 'ASC' | 'DESC';
         }
       | undefined
-  ) {
-    return findValuesInRange(this.tupleOperator, attribute, constraints);
-  }
+  ) {}
 
   async findByEAV(
killedBy: search/scan functionality can find values in a range
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/triple-store.ts:286:27
       value?: Value | undefined
     ],
     direction?: 'ASC' | 'DESC' | undefined
-  ): Promise<TripleRow[]> {
-    return findByEAV(this.tupleOperator, tupleArgs, direction);
-  }
+  ): Promise<TripleRow[]> {}
   findByAVE(
     tupleArgs: [
killedBy: search/scan functionality can find by Entity Attribute and EAV
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/triple-store.ts:296:27
       entityId?: string | undefined
     ],
     direction?: 'ASC' | 'DESC' | undefined
-  ): Promise<TripleRow[]> {
-    return findByAVE(this.tupleOperator, tupleArgs, direction);
-  }
+  ): Promise<TripleRow[]> {}
   // findByVAE(
   //   tupleArgs: [
killedBy: database transactions can implicitly commit a transaction
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/triple-store.ts:309:69
   // ): Promise<TripleRow[]> {
   //   return findByVAE(this.tupleOperator, tupleArgs, direction);
   // }
-  async findByEntity(id?: string | undefined): Promise<TripleRow[]> {
-    return findByEntity(this.tupleOperator, id);
-  }
+  async findByEntity(id?: string | undefined): Promise<TripleRow[]> {}
   async findByEntityAttribute(
     id: string,
killedBy: supports transactions can rollback a transaction
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/triple-store.ts:315:27
   async findByEntityAttribute(
     id: string,
     attribute: Attribute
-  ): Promise<TripleRow[]> {
-    return findByEntityAttribute(this.tupleOperator, id, attribute);
-  }
+  ): Promise<TripleRow[]> {}
   async findByAttribute(attribute: Attribute): Promise<TripleRow[]> {
     return findByAttribute(this.tupleOperator, attribute);
killedBy: Register operations can set register; mutating triple values from the store can set the value of a triple
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] BlockStatement
src/triple-store.ts:318:69
   ): Promise<TripleRow[]> {
     return findByEntityAttribute(this.tupleOperator, id, attribute);
   }
-  async findByAttribute(attribute: Attribute): Promise<TripleRow[]> {
-    return findByAttribute(this.tupleOperator, attribute);
-  }
+  async findByAttribute(attribute: Attribute): Promise<TripleRow[]> {}
   // async findByValue(value: Value): Promise<TripleRow[]> {
   //   return findByValue(this.tupleOperator, value);
killedBy: schema changes can rename an attribute; search/scan functionality can find by attribute
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/triple-store.ts:325:31
   //   return findByValue(this.tupleOperator, value);
   // }
 
-  getEntity(entityId: string) {
-    return getEntity(this.tupleOperator, entityId);
-  }
+  getEntity(entityId: string) {}
 
   getEntities(collectionName: string) {
killedBy: database transactions can fetch by id in a transaction
statusReason: Cannot read properties of undefined (reading 'score')

[Killed] BlockStatement
src/triple-store.ts:329:39
     return getEntity(this.tupleOperator, entityId);
   }
 
-  getEntities(collectionName: string) {
-    return getEntities(this.tupleOperator, collectionName);
-  }
+  getEntities(collectionName: string) {}
 
   // async commit(): Promise<void> {
killedBy: database transactions can implicitly commit a transaction
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
src/triple-store.ts:350:38
   //   this.isCanceled = true;
   // }
 
-  findMaxTimestamp(clientId: string) {
-    return findMaxTimestamp(this.tupleOperator, clientId);
-  }
+  findMaxTimestamp(clientId: string) {}
 
   findByClientTimestamp(
killedBy: search/scan functionality can find by the max timestamp
statusReason: expected undefined to strictly equal [ 2, 'A' ]

[Killed] BlockStatement
src/triple-store.ts:358:5
     clientId: string,
     scanDirection: 'lt' | 'lte' | 'gt' | 'gte',
     timestamp: Timestamp | undefined
-  ) {
-    return findByClientTimestamp(
-      this.tupleOperator,
-      clientId,
-      scanDirection,
-      timestamp
-    );
-  }
+  ) {}
 
   async insertTriple(tripleRow: TripleRow): Promise<void> {
killedBy: search/scan functionality can find by clientId
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/triple-store.ts:367:59
     );
   }
 
-  async insertTriple(tripleRow: TripleRow): Promise<void> {
-    await this.insertTriples([tripleRow]);
-  }
+  async insertTriple(tripleRow: TripleRow): Promise<void> {}
 
   async insertTriples(triplesInput: TripleRow[]): Promise<void> {
killedBy: DurableClock can read new timestamps from the store and update the clock
statusReason: expected +0 to be 16 // Object.is equality

[Killed] BlockStatement
src/triple-store.ts:371:65
     await this.insertTriples([tripleRow]);
   }
 
-  async insertTriples(triplesInput: TripleRow[]): Promise<void> {
-    if (!triplesInput.length) return;
-    for (const triple of triplesInput) {
-      await this.addTripleToIndex(this.tupleOperator, triple);
-    }
-  }
+  async insertTriples(triplesInput: TripleRow[]): Promise<void> {}
 
   private async addTripleToIndex(
killedBy: Database API can lookup entity by Id; triple inserts can insert a single triple
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/triple-store.ts:372:9
   }
 
   async insertTriples(triplesInput: TripleRow[]): Promise<void> {
-    if (!triplesInput.length) return;
+    if (true) return;
     for (const triple of triplesInput) {
       await this.addTripleToIndex(this.tupleOperator, triple);
killedBy: DurableClock can read new timestamps from the store and update the clock
statusReason: expected +0 to be 16 // Object.is equality

[Killed] BooleanLiteral
src/triple-store.ts:372:9
   }
 
   async insertTriples(triplesInput: TripleRow[]): Promise<void> {
-    if (!triplesInput.length) return;
+    if (triplesInput.length) return;
     for (const triple of triplesInput) {
       await this.addTripleToIndex(this.tupleOperator, triple);
killedBy: triple inserts can insert a single triple; DurableClock can read new timestamps from the store and update the clock
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/triple-store.ts:373:40
 
   async insertTriples(triplesInput: TripleRow[]): Promise<void> {
     if (!triplesInput.length) return;
-    for (const triple of triplesInput) {
-      await this.addTripleToIndex(this.tupleOperator, triple);
-    }
+    for (const triple of triplesInput) {}
   }
 
killedBy: DurableClock can read new timestamps from the store and update the clock; triple inserts can insert a single triple
statusReason: expected +0 to be 16 // Object.is equality

[Killed] ConditionalExpression
src/triple-store.ts:384:9
   ) {
     const { id: id, attribute, value, timestamp, expired } = tripleInput;
 
-    if (expired) {
+    if (true) {
       console.info('Skipping index for expired triple');
       return;
killedBy: Database API can lookup entity by Id; DurableClock can read new timestamps from the store and update the clock; triple inserts can insert a single triple
statusReason: expected null not to be null

[NoCoverage] BlockStatement
src/triple-store.ts:384:18
   ) {
     const { id: id, attribute, value, timestamp, expired } = tripleInput;
 
-    if (expired) {
-      console.info('Skipping index for expired triple');
-      return;
-    }
+    if (expired) {}
 
     // If we already have this triple, skip it (performance optimization)

[Killed] ConditionalExpression
src/triple-store.ts:391:9
 
     // If we already have this triple, skip it (performance optimization)
     // This does add another binary search, so might be worth patching tuple-db to let us do this in tx.set()
-    if (await tx.exists(['EAV', id, attribute, value, timestamp])) {
+    if (true) {
       console.warn("inserting triple that's already in the db");
       return;
killedBy: DurableClock can read new timestamps from the store and update the clock; triple inserts can insert a single triple
statusReason: expected +0 to be 16 // Object.is equality

[NoCoverage] BlockStatement
src/triple-store.ts:391:68
 
     // If we already have this triple, skip it (performance optimization)
     // This does add another binary search, so might be worth patching tuple-db to let us do this in tx.set()
-    if (await tx.exists(['EAV', id, attribute, value, timestamp])) {
-      console.warn("inserting triple that's already in the db");
-      return;
-    }
+    if (await tx.exists(['EAV', id, attribute, value, timestamp])) {}
 
     const schema = await this.readSchema();

[NoCoverage] StringLiteral
src/triple-store.ts:392:20
     // If we already have this triple, skip it (performance optimization)
     // This does add another binary search, so might be worth patching tuple-db to let us do this in tx.set()
     if (await tx.exists(['EAV', id, attribute, value, timestamp])) {
-      console.warn("inserting triple that's already in the db");
+      console.warn("");
       return;
     }

[Killed] ConditionalExpression
src/triple-store.ts:397:9
     }
 
     const schema = await this.readSchema();
-    if (schema) {
+    if (false) {
       try {
         validateTriple(schema.collections, attribute, value);
killedBy: schema triple-store should prevent wrong types
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/triple-store.ts:397:17
     }
 
     const schema = await this.readSchema();
-    if (schema) {
-      try {
-        validateTriple(schema.collections, attribute, value);
-      } catch (e) {
-        // console.error(e);
-        // this.cancel();
-        throw e;
-      }
-    }
+    if (schema) {}
 
     const metadata = { expired };
killedBy: schema triple-store should prevent wrong types
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/triple-store.ts:398:11
 
     const schema = await this.readSchema();
     if (schema) {
-      try {
-        validateTriple(schema.collections, attribute, value);
-      } catch (e) {
+      try {} catch (e) {
         // console.error(e);
         // this.cancel();
killedBy: schema triple-store should prevent wrong types
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/triple-store.ts:400:19
     if (schema) {
       try {
         validateTriple(schema.collections, attribute, value);
-      } catch (e) {
-        // console.error(e);
-        // this.cancel();
-        throw e;
-      }
+      } catch (e) {}
     }
 
killedBy: schema triple-store should prevent wrong types
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/triple-store.ts:415:8
     tx.set(['AVE', attribute, value, id, timestamp], metadata);
     // tx.set(['VAE', value, attribute, id, timestamp], metadata);
     tx.set(
-      ['clientTimestamp', timestamp[1], timestamp, id, attribute, value],
+      ["", timestamp[1], timestamp, id, attribute, value],
       metadata
     );
killedBy: search/scan functionality can find by clientId
statusReason: expected [] to strictly equal [ 'A', 'A' ]

[Killed] BlockStatement
src/triple-store.ts:420:39
     );
   }
 
-  async deleteTriple(trip: TripleRow) {
-    this.deleteTriples([trip]);
-  }
+  async deleteTriple(trip: TripleRow) {}
 
   async deleteTriples(triples: TripleRow[]) {
killedBy: Deleting triples can delete a triple
statusReason: expected [ { id: 'cats#2', …(4) } ] to have a length of +0 but got 1

[Killed] BlockStatement
src/triple-store.ts:424:45
     this.deleteTriples([trip]);
   }
 
-  async deleteTriples(triples: TripleRow[]) {
-    const tx = this.tupleOperator;
-    for (const triple of triples) {
-      const { id: id, attribute, value, timestamp } = triple;
-      tx.remove(['EAV', id, attribute, value, timestamp]);
-      tx.remove(['AVE', attribute, value, id, timestamp]);
-      tx.remove(['VAE', value, attribute, id, timestamp]);
-      tx.remove([
-        'clientTimestamp',
-        timestamp[1],
-        timestamp,
-        id,
-        attribute,
-        value,
-      ]);
-    }
-  }
+  async deleteTriples(triples: TripleRow[]) {}
 
   async readMetadataTuples(entityId: string, attribute?: Attribute) {
killedBy: Deleting triples can delete a triple
statusReason: expected [ { id: 'cats#1', …(4) } ] to have a length of +0 but got 1

[Killed] BlockStatement
src/triple-store.ts:426:35
 
   async deleteTriples(triples: TripleRow[]) {
     const tx = this.tupleOperator;
-    for (const triple of triples) {
-      const { id: id, attribute, value, timestamp } = triple;
-      tx.remove(['EAV', id, attribute, value, timestamp]);
-      tx.remove(['AVE', attribute, value, id, timestamp]);
-      tx.remove(['VAE', value, attribute, id, timestamp]);
-      tx.remove([
-        'clientTimestamp',
-        timestamp[1],
-        timestamp,
-        id,
-        attribute,
-        value,
-      ]);
-    }
+    for (const triple of triples) {}
   }
 
killedBy: Deleting triples can delete a triple
statusReason: expected [ { id: 'cats#1', …(4) } ] to have a length of +0 but got 1

[Killed] StringLiteral
src/triple-store.ts:428:18
     const tx = this.tupleOperator;
     for (const triple of triples) {
       const { id: id, attribute, value, timestamp } = triple;
-      tx.remove(['EAV', id, attribute, value, timestamp]);
+      tx.remove(["", id, attribute, value, timestamp]);
       tx.remove(['AVE', attribute, value, id, timestamp]);
       tx.remove(['VAE', value, attribute, id, timestamp]);
killedBy: Deleting triples can delete a triple
statusReason: expected [ { id: 'cats#1', …(4) } ] to have a length of +0 but got 1

[Survived] StringLiteral
src/triple-store.ts:429:18
     for (const triple of triples) {
       const { id: id, attribute, value, timestamp } = triple;
       tx.remove(['EAV', id, attribute, value, timestamp]);
-      tx.remove(['AVE', attribute, value, id, timestamp]);
+      tx.remove(["", attribute, value, id, timestamp]);
       tx.remove(['VAE', value, attribute, id, timestamp]);
       tx.remove([

[Killed] BlockStatement
src/triple-store.ts:442:69
     }
   }
 
-  async readMetadataTuples(entityId: string, attribute?: Attribute) {
-    const tuples = await this.tupleOperator.scan({
-      prefix: ['metadata', entityId, ...(attribute ?? [])],
-    });
-
-    return tuples.map(mapStaticTupleToEAV);
-  }
+  async readMetadataTuples(entityId: string, attribute?: Attribute) {}
 
   async updateMetadataTuples(updates: EAV[]) {
killedBy: Set operations can add to set; schema triple-store defining a store with a schema should store schema
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ObjectLiteral
src/triple-store.ts:443:50
   }
 
   async readMetadataTuples(entityId: string, attribute?: Attribute) {
-    const tuples = await this.tupleOperator.scan({
-      prefix: ['metadata', entityId, ...(attribute ?? [])],
-    });
+    const tuples = await this.tupleOperator.scan({});
 
     return tuples.map(mapStaticTupleToEAV);
killedBy: schema changes can drop a collection definition from the schema
statusReason: Cannot convert undefined or null to object

[Killed] LogicalOperator
src/triple-store.ts:444:42
 
   async readMetadataTuples(entityId: string, attribute?: Attribute) {
     const tuples = await this.tupleOperator.scan({
-      prefix: ['metadata', entityId, ...(attribute ?? [])],
+      prefix: ['metadata', entityId, ...(attribute && [])],
     });
 
killedBy: Set operations can add to set; schema triple-store defining a store with a schema should store schema
statusReason: (intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] StringLiteral
src/triple-store.ts:444:16
 
   async readMetadataTuples(entityId: string, attribute?: Attribute) {
     const tuples = await this.tupleOperator.scan({
-      prefix: ['metadata', entityId, ...(attribute ?? [])],
+      prefix: ["", entityId, ...(attribute ?? [])],
     });
 
killedBy: schema changes can drop a collection definition from the schema
statusReason: expected { …(1) } to not have property "students"

[Killed] BlockStatement
src/triple-store.ts:450:46
     return tuples.map(mapStaticTupleToEAV);
   }
 
-  async updateMetadataTuples(updates: EAV[]) {
-    for (const [entityId, attribute, value] of updates) {
-      this.tupleOperator.set(['metadata', entityId, ...attribute], value);
-    }
-    await Promise.all(
-      [...this.txMetadataListeners].map((cb) => cb({ updates, deletes: [] }))
-    );
-  }
+  async updateMetadataTuples(updates: EAV[]) {}
 
   async deleteMetadataTuples(
killedBy: schema triple-store defining a store with a schema should store schema; DurableClock initializes with persisted clock if available
statusReason: expected 0 to be greater than 0
