[Killed] BlockStatement
src/triple-store.ts:451:57
   }
 
   async updateMetadataTuples(updates: EAV[]) {
-    for (const [entityId, attribute, value] of updates) {
-      this.tupleOperator.set(['metadata', entityId, ...attribute], value);
-    }
+    for (const [entityId, attribute, value] of updates) {}
     await Promise.all(
       [...this.txMetadataListeners].map((cb) => cb({ updates, deletes: [] }))
killedBy: schema triple-store defining a store with a schema should store schema; DurableClock initializes with persisted clock if available
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/triple-store.ts:452:31
 
   async updateMetadataTuples(updates: EAV[]) {
     for (const [entityId, attribute, value] of updates) {
-      this.tupleOperator.set(['metadata', entityId, ...attribute], value);
+      this.tupleOperator.set(["", entityId, ...attribute], value);
     }
     await Promise.all(
killedBy: DurableClock initializes with persisted clock if available; schema triple-store defining a store with a schema should store schema
statusReason: expected +0 to be 15 // Object.is equality

[Killed] ArrowFunction
src/triple-store.ts:455:41
       this.tupleOperator.set(['metadata', entityId, ...attribute], value);
     }
     await Promise.all(
-      [...this.txMetadataListeners].map((cb) => cb({ updates, deletes: [] }))
+      [...this.txMetadataListeners].map(() => undefined)
     );
   }
killedBy: schema changes can rename an attribute
statusReason: Path studentId does not exist in model.

[Killed] ObjectLiteral
src/triple-store.ts:455:52
       this.tupleOperator.set(['metadata', entityId, ...attribute], value);
     }
     await Promise.all(
-      [...this.txMetadataListeners].map((cb) => cb({ updates, deletes: [] }))
+      [...this.txMetadataListeners].map((cb) => cb({}))
     );
   }
killedBy: Set operations can add to set; DurableClock creates a fresh clock if no relevant metadata; schema triple-store defining a store with a schema should store schema
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] BlockStatement
src/triple-store.ts:461:5
 
   async deleteMetadataTuples(
     deletes: [entityId: string, attribute?: Attribute][]
-  ) {
-    for (const [entityId, attribute] of deletes) {
-      (
-        await this.tupleOperator.scan({
-          prefix: ['metadata', entityId, ...(attribute ?? [])],
-        })
-      ).forEach((tuple) => this.tupleOperator.remove(tuple.key));
-    }
-    await Promise.all(
-      [...this.txMetadataListeners].map((cb) => cb({ updates: [], deletes }))
-    );
-  }
+  ) {}
 
   onMetadataChange(callback: MetadataListener) {
killedBy: schema triple-store should allow the deletion of metadatatriples
statusReason: expected { collections: { …(1) }, version: +0 } to be falsy

[Killed] BlockStatement
src/triple-store.ts:462:50
   async deleteMetadataTuples(
     deletes: [entityId: string, attribute?: Attribute][]
   ) {
-    for (const [entityId, attribute] of deletes) {
-      (
-        await this.tupleOperator.scan({
-          prefix: ['metadata', entityId, ...(attribute ?? [])],
-        })
-      ).forEach((tuple) => this.tupleOperator.remove(tuple.key));
-    }
+    for (const [entityId, attribute] of deletes) {}
     await Promise.all(
       [...this.txMetadataListeners].map((cb) => cb({ updates: [], deletes }))
killedBy: schema triple-store should allow the deletion of metadatatriples
statusReason: expected { collections: { …(1) }, version: +0 } to be falsy

[Killed] LogicalOperator
src/triple-store.ts:465:46
     for (const [entityId, attribute] of deletes) {
       (
         await this.tupleOperator.scan({
-          prefix: ['metadata', entityId, ...(attribute ?? [])],
+          prefix: ['metadata', entityId, ...(attribute && [])],
         })
       ).forEach((tuple) => this.tupleOperator.remove(tuple.key));
killedBy: schema triple-store defining a store with a schema should store schema; Set operations can add to set
statusReason: (intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] ArrayDeclaration
src/triple-store.ts:465:59
     for (const [entityId, attribute] of deletes) {
       (
         await this.tupleOperator.scan({
-          prefix: ['metadata', entityId, ...(attribute ?? [])],
+          prefix: ['metadata', entityId, ...(attribute ?? ["Stryker was here"])],
         })
       ).forEach((tuple) => this.tupleOperator.remove(tuple.key));
killedBy: schema triple-store should allow the deletion of metadatatriples
statusReason: expected { collections: { …(1) }, version: +0 } to be falsy

[Killed] ArrowFunction
src/triple-store.ts:467:17
         await this.tupleOperator.scan({
           prefix: ['metadata', entityId, ...(attribute ?? [])],
         })
-      ).forEach((tuple) => this.tupleOperator.remove(tuple.key));
+      ).forEach(() => undefined);
     }
     await Promise.all(
killedBy: schema triple-store should allow the deletion of metadatatriples
statusReason: expected { collections: { …(1) }, version: +0 } to be falsy

[Survived] ArrowFunction
src/triple-store.ts:470:41
       ).forEach((tuple) => this.tupleOperator.remove(tuple.key));
     }
     await Promise.all(
-      [...this.txMetadataListeners].map((cb) => cb({ updates: [], deletes }))
+      [...this.txMetadataListeners].map(() => undefined)
     );
   }

[Killed] ObjectLiteral
src/triple-store.ts:470:52
       ).forEach((tuple) => this.tupleOperator.remove(tuple.key));
     }
     await Promise.all(
-      [...this.txMetadataListeners].map((cb) => cb({ updates: [], deletes }))
+      [...this.txMetadataListeners].map((cb) => cb({}))
     );
   }
killedBy: Set operations can add to set; schema triple-store defining a store with a schema should store schema
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] BlockStatement
src/triple-store.ts:474:48
     );
   }
 
-  onMetadataChange(callback: MetadataListener) {
-    this.txMetadataListeners.add(callback);
-    return () => {
-      this.txMetadataListeners.delete(callback);
-    };
-  }
+  onMetadataChange(callback: MetadataListener) {}
 
   async setValue(id: EntityId, attribute: Attribute, value: Value) {
killedBy: schema changes can rename an attribute
statusReason: Path studentId does not exist in model.

[NoCoverage] BlockStatement
src/triple-store.ts:476:18
 
   onMetadataChange(callback: MetadataListener) {
     this.txMetadataListeners.add(callback);
-    return () => {
-      this.txMetadataListeners.delete(callback);
-    };
+    return () => {};
   }
 

[Killed] BlockStatement
src/triple-store.ts:481:68
     };
   }
 
-  async setValue(id: EntityId, attribute: Attribute, value: Value) {
-    const newTimestamp = await this.clock.getNextTimestamp();
-    const existingTriples = await this.findByEntityAttribute(id, attribute);
-    const olderTriples = existingTriples.filter(
-      ({ timestamp, expired }) =>
-        timestampCompare(timestamp, newTimestamp) == -1 && !expired
-    );
-
-    await this.deleteTriples(olderTriples);
-
-    const newerTriples = existingTriples.filter(
-      ({ timestamp }) => timestampCompare(timestamp, newTimestamp) == 1
-    );
-    if (newerTriples.length === 0) {
-      await this.insertTriples([
-        { id, attribute, value, timestamp: newTimestamp, expired: false },
-      ]);
-    }
-  }
+  async setValue(id: EntityId, attribute: Attribute, value: Value) {}
 }
 
killedBy: mutating triple values from the store can set the value of a triple; Register operations can set register
statusReason: expected 'value' to be 'new-value' // Object.is equality

[Survived] MethodExpression
src/triple-store.ts:484:26
   async setValue(id: EntityId, attribute: Attribute, value: Value) {
     const newTimestamp = await this.clock.getNextTimestamp();
     const existingTriples = await this.findByEntityAttribute(id, attribute);
-    const olderTriples = existingTriples.filter(
-      ({ timestamp, expired }) =>
-        timestampCompare(timestamp, newTimestamp) == -1 && !expired
-    );
+    const olderTriples = existingTriples;
 
     await this.deleteTriples(olderTriples);

[Survived] ArrowFunction
src/triple-store.ts:485:7
     const newTimestamp = await this.clock.getNextTimestamp();
     const existingTriples = await this.findByEntityAttribute(id, attribute);
     const olderTriples = existingTriples.filter(
-      ({ timestamp, expired }) =>
-        timestampCompare(timestamp, newTimestamp) == -1 && !expired
+      () => undefined
     );
 

[Survived] BooleanLiteral
src/triple-store.ts:486:60
     const existingTriples = await this.findByEntityAttribute(id, attribute);
     const olderTriples = existingTriples.filter(
       ({ timestamp, expired }) =>
-        timestampCompare(timestamp, newTimestamp) == -1 && !expired
+        timestampCompare(timestamp, newTimestamp) == -1 && expired
     );
 

[Survived] ConditionalExpression
src/triple-store.ts:486:9
     const existingTriples = await this.findByEntityAttribute(id, attribute);
     const olderTriples = existingTriples.filter(
       ({ timestamp, expired }) =>
-        timestampCompare(timestamp, newTimestamp) == -1 && !expired
+        false
     );
 

[Killed] MethodExpression
src/triple-store.ts:491:26
 
     await this.deleteTriples(olderTriples);
 
-    const newerTriples = existingTriples.filter(
-      ({ timestamp }) => timestampCompare(timestamp, newTimestamp) == 1
-    );
+    const newerTriples = existingTriples;
     if (newerTriples.length === 0) {
       await this.insertTriples([
killedBy: mutating triple values from the store can set the value of a triple; Register operations can set register
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ConditionalExpression
src/triple-store.ts:492:26
     await this.deleteTriples(olderTriples);
 
     const newerTriples = existingTriples.filter(
-      ({ timestamp }) => timestampCompare(timestamp, newTimestamp) == 1
+      ({ timestamp }) => true
     );
     if (newerTriples.length === 0) {
killedBy: Register operations can set register; mutating triple values from the store can set the value of a triple
statusReason: expected Map{} to have a size of +0 but got 1

[Killed] EqualityOperator
src/triple-store.ts:492:26
     await this.deleteTriples(olderTriples);
 
     const newerTriples = existingTriples.filter(
-      ({ timestamp }) => timestampCompare(timestamp, newTimestamp) == 1
+      ({ timestamp }) => timestampCompare(timestamp, newTimestamp) != 1
     );
     if (newerTriples.length === 0) {
killedBy: Register operations can set register; mutating triple values from the store can set the value of a triple
statusReason: expected Map{} to have a size of +0 but got 1

[Killed] BlockStatement
src/triple-store.ts:494:36
     const newerTriples = existingTriples.filter(
       ({ timestamp }) => timestampCompare(timestamp, newTimestamp) == 1
     );
-    if (newerTriples.length === 0) {
-      await this.insertTriples([
-        { id, attribute, value, timestamp: newTimestamp, expired: false },
-      ]);
-    }
+    if (newerTriples.length === 0) {}
   }
 }
killedBy: Register operations can set register; mutating triple values from the store can set the value of a triple
statusReason: expected Map{} to have a size of +0 but got 1

[Killed] EqualityOperator
src/triple-store.ts:494:9
     const newerTriples = existingTriples.filter(
       ({ timestamp }) => timestampCompare(timestamp, newTimestamp) == 1
     );
-    if (newerTriples.length === 0) {
+    if (newerTriples.length !== 0) {
       await this.insertTriples([
         { id, attribute, value, timestamp: newTimestamp, expired: false },
killedBy: Register operations can set register; mutating triple values from the store can set the value of a triple
statusReason: expected Map{} to have a size of +0 but got 1

[Killed] ArrayDeclaration
src/triple-store.ts:495:32
       ({ timestamp }) => timestampCompare(timestamp, newTimestamp) == 1
     );
     if (newerTriples.length === 0) {
-      await this.insertTriples([
-        { id, attribute, value, timestamp: newTimestamp, expired: false },
-      ]);
+      await this.insertTriples([]);
     }
   }
killedBy: mutating triple values from the store can set the value of a triple
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] BooleanLiteral
src/triple-store.ts:496:67
     );
     if (newerTriples.length === 0) {
       await this.insertTriples([
-        { id, attribute, value, timestamp: newTimestamp, expired: false },
+        { id, attribute, value, timestamp: newTimestamp, expired: true },
       ]);
     }
killedBy: Register operations can set register; mutating triple values from the store can set the value of a triple
statusReason: expected Map{} to have a size of +0 but got 1

[Killed] ObjectLiteral
src/triple-store.ts:496:9
     );
     if (newerTriples.length === 0) {
       await this.insertTriples([
-        { id, attribute, value, timestamp: newTimestamp, expired: false },
+        {},
       ]);
     }
killedBy: mutating triple values from the store can set the value of a triple
statusReason: Unknown value type: undefined

[Killed] BlockStatement
src/triple-store.ts:505:3
 async function updateEntityIndex(
   tx: ScopedMultiTupleOperator<TupleIndex>,
   triple: TripleRow
-) {
-  const existingEntity = await getEntity(tx, triple.id);
-  const updatedEntity = entityToResultReducer(existingEntity ?? {}, triple);
-  tx.set(['Entity', triple.id], updatedEntity);
-}
+) {}
 
 export class TripleStoreTransaction extends TripleStoreOperator {
killedBy: Database API can lookup entity by Id
statusReason: expected null not to be null

[Killed] LogicalOperator
src/triple-store.ts:507:47
   triple: TripleRow
 ) {
   const existingEntity = await getEntity(tx, triple.id);
-  const updatedEntity = entityToResultReducer(existingEntity ?? {}, triple);
+  const updatedEntity = entityToResultReducer(existingEntity && {}, triple);
   tx.set(['Entity', triple.id], updatedEntity);
 }
killedBy: DurableClock can read new timestamps from the store and update the clock; Database API can furnish the client id; triple inserts can insert a single triple
statusReason: Cannot read properties of null (reading '')

[Killed] StringLiteral
src/triple-store.ts:508:11
 ) {
   const existingEntity = await getEntity(tx, triple.id);
   const updatedEntity = entityToResultReducer(existingEntity ?? {}, triple);
-  tx.set(['Entity', triple.id], updatedEntity);
+  tx.set(["", triple.id], updatedEntity);
 }
 
killedBy: Database API can lookup entity by Id
statusReason: expected null not to be null

[Killed] BlockStatement
src/triple-store.ts:522:6
     tupleTx: MultiTupleTransaction<TupleIndex>;
     clock: Clock;
     schema?: StoreSchema<Models<any, any>>;
-  }) {
-    super({ tupleOperator: tupleTx, clock, schema });
-    this.tupleTx = tupleTx;
-  }
+  }) {}
 
   async commit(): Promise<void> {
killedBy: triple inserts can insert a single triple; DurableClock creates a fresh clock if no relevant metadata; Database API can furnish the client id
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/triple-store.ts:527:33
     this.tupleTx = tupleTx;
   }
 
-  async commit(): Promise<void> {
-    await this.tupleTx.commit();
-  }
+  async commit(): Promise<void> {}
 
   async cancel(): Promise<void> {
killedBy: database transactions can't commit inside the transaction callback
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/triple-store.ts:531:33
     await this.tupleTx.commit();
   }
 
-  async cancel(): Promise<void> {
-    await this.tupleTx.cancel();
-  }
+  async cancel(): Promise<void> {}
 
   withScope(scope: StorageScope) {
killedBy: supports transactions can rollback a transaction; database transactions can rollback a transaction
statusReason: expected [ { id: 'id', …(4) } ] to have a length of +0 but got 1

[Killed] BlockStatement
src/triple-store.ts:535:34
     await this.tupleTx.cancel();
   }
 
-  withScope(scope: StorageScope) {
-    return new TripleStoreOperator({
-      tupleOperator: this.tupleTx.withScope(scope),
-      clock: this.clock,
-      schema: this.schema,
-    });
-  }
+  withScope(scope: StorageScope) {}
 }
 
killedBy: transaction scoping actions within a transaction can specify read and write scopes; schema changes can rename an attribute
statusReason: Cannot read properties of undefined (reading 'insertTriple')

[Survived] ArrayDeclaration
src/triple-store.ts:562:20
     tenantId,
     schema,
     clock,
-    storageScope = [],
+    storageScope = ["Stryker was here"],
   }: {
     storage?:

[Killed] LogicalOperator
src/triple-store.ts:576:9
     storageScope?: string[];
     clock?: Clock;
   }) {
-    if (!stores && !storage)
+    if (!stores || !storage)
       throw new Error('Must provide either storage or stores');
     if (stores && storage)
killedBy: DurableClock creates a fresh clock if no relevant metadata
statusReason: Must provide either storage or stores

[Killed] BooleanLiteral
src/triple-store.ts:576:9
     storageScope?: string[];
     clock?: Clock;
   }) {
-    if (!stores && !storage)
+    if (stores && !storage)
       throw new Error('Must provide either storage or stores');
     if (stores && storage)
killedBy: DurableClock creates a fresh clock if no relevant metadata; setStorageScope using setStorageScope scopes writes
statusReason: Must provide either storage or stores

[Killed] ConditionalExpression
src/triple-store.ts:578:9
   }) {
     if (!stores && !storage)
       throw new Error('Must provide either storage or stores');
-    if (stores && storage)
+    if (true)
       throw new Error('Cannot provide both storage and stores');
 
killedBy: DurableClock creates a fresh clock if no relevant metadata
statusReason: Cannot provide both storage and stores

[Killed] LogicalOperator
src/triple-store.ts:578:9
   }) {
     if (!stores && !storage)
       throw new Error('Must provide either storage or stores');
-    if (stores && storage)
+    if (stores || storage)
       throw new Error('Cannot provide both storage and stores');
 
killedBy: DurableClock creates a fresh clock if no relevant metadata
statusReason: Cannot provide both storage and stores

[Killed] ConditionalExpression
src/triple-store.ts:583:9
 
     this.storageScope = storageScope;
     let normalizedStores;
-    if (stores) {
+    if (true) {
       normalizedStores = stores;
     } else {
killedBy: DurableClock creates a fresh clock if no relevant metadata
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
src/triple-store.ts:583:9
 
     this.storageScope = storageScope;
     let normalizedStores;
-    if (stores) {
+    if (false) {
       normalizedStores = stores;
     } else {
killedBy: DurableClock creates a fresh clock if no relevant metadata
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
src/triple-store.ts:585:12
     let normalizedStores;
     if (stores) {
       normalizedStores = stores;
-    } else {
-      const confirmedStorage = storage!;
-      normalizedStores = isTupleStorage(confirmedStorage)
-        ? {
-            primary: new AsyncTupleDatabaseClient<
-              WithTenantIdPrefix<TupleIndex>
-            >(new AsyncTupleDatabase(confirmedStorage)),
-          }
-        : Object.fromEntries(
-            Object.entries(confirmedStorage).map(([k, v]) => [
-              k,
-              new AsyncTupleDatabaseClient<WithTenantIdPrefix<TupleIndex>>(
-                new AsyncTupleDatabase(v)
-              ),
-            ])
-          );
-    }
+    } else {}
     // Server side database should provide a tenantId (project id)
     this.stores = normalizedStores;
killedBy: DurableClock creates a fresh clock if no relevant metadata
statusReason: Cannot convert undefined or null to object

[Killed] ObjectLiteral
src/triple-store.ts:588:11
     } else {
       const confirmedStorage = storage!;
       normalizedStores = isTupleStorage(confirmedStorage)
-        ? {
-            primary: new AsyncTupleDatabaseClient<
-              WithTenantIdPrefix<TupleIndex>
-            >(new AsyncTupleDatabase(confirmedStorage)),
-          }
+        ? {}
         : Object.fromEntries(
             Object.entries(confirmedStorage).map(([k, v]) => [
killedBy: triple inserts can insert a single triple
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrowFunction
src/triple-store.ts:594:50
             >(new AsyncTupleDatabase(confirmedStorage)),
           }
         : Object.fromEntries(
-            Object.entries(confirmedStorage).map(([k, v]) => [
-              k,
-              new AsyncTupleDatabaseClient<WithTenantIdPrefix<TupleIndex>>(
-                new AsyncTupleDatabase(v)
-              ),
-            ])
+            Object.entries(confirmedStorage).map(() => undefined)
           );
     }
killedBy: DurableClock creates a fresh clock if no relevant metadata
statusReason: Iterator value undefined is not an entry object

[Killed] LogicalOperator
src/triple-store.ts:604:21
     }
     // Server side database should provide a tenantId (project id)
     this.stores = normalizedStores;
-    this.tenantId = tenantId ?? 'client';
+    this.tenantId = tenantId && 'client';
     this.tupleStore = new MultiTupleStore<WithTenantIdPrefix<TupleIndex>>({
       storage: normalizedStores,
killedBy: Database API can furnish the client id
statusReason: Unknown value type: undefined

[Killed] LogicalOperator
src/triple-store.ts:609:18
       storage: normalizedStores,
     }).subspace([this.tenantId]) as MultiTupleStore<TupleIndex>;
 
-    this.clock = clock ?? new MemoryClock();
+    this.clock = clock && new MemoryClock();
     this.clock.assignToStore(this);
 
killedBy: DurableClock creates a fresh clock if no relevant metadata
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/triple-store.ts:618:45
       : Promise.resolve();
 
     // Listen to future writes to the schema
-    this.ensureInitializedSchema.then(() => {
-      // Slightly different than on tx, here we update schema on commit
-      // This is a bit awkward because we store schema on every store (which is also unnecessary)
-      this.tupleStore.subscribe({ prefix: ['metadata'] }, async (writes) => {
-        const { set = [], remove = [] } = writes;
-        const dataWrites = set.filter(({ key }) => key[1] === '_schema');
-        const dataDeletes = remove.filter((key) => key[1] === '_schema');
-        if (dataWrites.length || dataDeletes.length) {
-          this.schema = await this.readSchemaFromStorage();
-        }
-      });
-    });
+    this.ensureInitializedSchema.then(() => {});
   }
 
killedBy: schema triple-store should allow the deletion of metadatatriples
statusReason: expected { collections: { …(1) }, version: +0 } to be falsy

[Killed] BlockStatement
src/triple-store.ts:621:77
     this.ensureInitializedSchema.then(() => {
       // Slightly different than on tx, here we update schema on commit
       // This is a bit awkward because we store schema on every store (which is also unnecessary)
-      this.tupleStore.subscribe({ prefix: ['metadata'] }, async (writes) => {
-        const { set = [], remove = [] } = writes;
-        const dataWrites = set.filter(({ key }) => key[1] === '_schema');
-        const dataDeletes = remove.filter((key) => key[1] === '_schema');
-        if (dataWrites.length || dataDeletes.length) {
-          this.schema = await this.readSchemaFromStorage();
-        }
-      });
+      this.tupleStore.subscribe({ prefix: ['metadata'] }, async (writes) => {});
     });
   }
killedBy: schema triple-store should allow the deletion of metadatatriples
statusReason: expected { collections: { …(1) }, version: +0 } to be falsy

[Survived] ArrayDeclaration
src/triple-store.ts:621:43
     this.ensureInitializedSchema.then(() => {
       // Slightly different than on tx, here we update schema on commit
       // This is a bit awkward because we store schema on every store (which is also unnecessary)
-      this.tupleStore.subscribe({ prefix: ['metadata'] }, async (writes) => {
+      this.tupleStore.subscribe({ prefix: [] }, async (writes) => {
         const { set = [], remove = [] } = writes;
         const dataWrites = set.filter(({ key }) => key[1] === '_schema');

[Killed] ArrowFunction
src/triple-store.ts:623:39
       // This is a bit awkward because we store schema on every store (which is also unnecessary)
       this.tupleStore.subscribe({ prefix: ['metadata'] }, async (writes) => {
         const { set = [], remove = [] } = writes;
-        const dataWrites = set.filter(({ key }) => key[1] === '_schema');
+        const dataWrites = set.filter(() => undefined);
         const dataDeletes = remove.filter((key) => key[1] === '_schema');
         if (dataWrites.length || dataDeletes.length) {
killedBy: schema changes can add an attribute
statusReason: expected { …(2) } to have property "age"

[Killed] EqualityOperator
src/triple-store.ts:623:52
       // This is a bit awkward because we store schema on every store (which is also unnecessary)
       this.tupleStore.subscribe({ prefix: ['metadata'] }, async (writes) => {
         const { set = [], remove = [] } = writes;
-        const dataWrites = set.filter(({ key }) => key[1] === '_schema');
+        const dataWrites = set.filter(({ key }) => key[1] !== '_schema');
         const dataDeletes = remove.filter((key) => key[1] === '_schema');
         if (dataWrites.length || dataDeletes.length) {
killedBy: schema changes can add an attribute
statusReason: expected { …(2) } to have property "age"

[Killed] ArrowFunction
src/triple-store.ts:624:43
       this.tupleStore.subscribe({ prefix: ['metadata'] }, async (writes) => {
         const { set = [], remove = [] } = writes;
         const dataWrites = set.filter(({ key }) => key[1] === '_schema');
-        const dataDeletes = remove.filter((key) => key[1] === '_schema');
+        const dataDeletes = remove.filter(() => undefined);
         if (dataWrites.length || dataDeletes.length) {
           this.schema = await this.readSchemaFromStorage();
killedBy: schema triple-store should allow the deletion of metadatatriples
statusReason: expected { collections: { …(1) }, version: +0 } to be falsy

[Killed] ConditionalExpression
src/triple-store.ts:624:52
       this.tupleStore.subscribe({ prefix: ['metadata'] }, async (writes) => {
         const { set = [], remove = [] } = writes;
         const dataWrites = set.filter(({ key }) => key[1] === '_schema');
-        const dataDeletes = remove.filter((key) => key[1] === '_schema');
+        const dataDeletes = remove.filter((key) => false);
         if (dataWrites.length || dataDeletes.length) {
           this.schema = await this.readSchemaFromStorage();
killedBy: schema changes can drop a collection definition from the schema; schema triple-store should allow the deletion of metadatatriples
statusReason: expected { …(1) } to not have property "students"

[Killed] ConditionalExpression
src/triple-store.ts:625:13
         const { set = [], remove = [] } = writes;
         const dataWrites = set.filter(({ key }) => key[1] === '_schema');
         const dataDeletes = remove.filter((key) => key[1] === '_schema');
-        if (dataWrites.length || dataDeletes.length) {
+        if (false) {
           this.schema = await this.readSchemaFromStorage();
         }
killedBy: schema triple-store should allow the deletion of metadatatriples
statusReason: expected { collections: { …(1) }, version: +0 } to be falsy

[Killed] LogicalOperator
src/triple-store.ts:625:13
         const { set = [], remove = [] } = writes;
         const dataWrites = set.filter(({ key }) => key[1] === '_schema');
         const dataDeletes = remove.filter((key) => key[1] === '_schema');
-        if (dataWrites.length || dataDeletes.length) {
+        if (dataWrites.length && dataDeletes.length) {
           this.schema = await this.readSchemaFromStorage();
         }
killedBy: schema triple-store should allow the deletion of metadatatriples
statusReason: expected { collections: { …(1) }, version: +0 } to be falsy

[Killed] BlockStatement
src/triple-store.ts:632:71
     });
   }
 
-  private async overrideSchema(schema: StoreSchema<Models<any, any>>) {
-    await this.transact(async (tx) => {
-      await tx.deleteMetadataTuples([['_schema']]);
-      await tx.updateMetadataTuples(schemaToTriples(schema.collections));
-    });
-    this.schema = schema;
-  }
+  private async overrideSchema(schema: StoreSchema<Models<any, any>>) {}
 
   findByCollection(
killedBy: Set operations can add to set; schema triple-store defining a store with a schema should store schema
statusReason: Received an unexpected value ([object Object]) for path employees in entity [object Object] interpreted as undefined. This is likely caused by a missing or incorrect schema, or because a filter path was provided that does not lead to a leaf attribute in the entity

[Killed] BlockStatement
src/triple-store.ts:633:39
   }
 
   private async overrideSchema(schema: StoreSchema<Models<any, any>>) {
-    await this.transact(async (tx) => {
-      await tx.deleteMetadataTuples([['_schema']]);
-      await tx.updateMetadataTuples(schemaToTriples(schema.collections));
-    });
+    await this.transact(async (tx) => {});
     this.schema = schema;
   }
killedBy: schema triple-store defining a store with a schema should store schema
statusReason: expected 0 to be greater than 0
