[Killed] BlockStatement
src/triple-store.ts:643:27
   findByCollection(
     collection: string,
     direction?: 'ASC' | 'DESC' | undefined
-  ): Promise<TripleRow[]> {
-    return findByCollection(this.tupleStore, collection, direction);
-  }
+  ): Promise<TripleRow[]> {}
 
   async findValuesInRange(
killedBy: subscriptions handles selection updates; search/scan functionality can find by collection
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/triple-store.ts:656:5
           direction?: 'ASC' | 'DESC';
         }
       | undefined
-  ) {
-    return findValuesInRange(this.tupleStore, attribute, constraints);
-  }
+  ) {}
 
   findByEAV(
killedBy: subscriptions handles order and limit; search/scan functionality can find values in a range
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/triple-store.ts:667:27
       value?: Value | undefined
     ],
     direction?: 'ASC' | 'DESC' | undefined
-  ): Promise<TripleRow[]> {
-    return findByEAV(this.tupleStore, [entityId, attribute, value], direction);
-  }
+  ): Promise<TripleRow[]> {}
   findByAVE(
     [attribute, value, entityId]: [
killedBy: search/scan functionality can find by Entity Attribute and EAV
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/triple-store.ts:677:27
       entityId?: string | undefined
     ],
     direction?: 'ASC' | 'DESC' | undefined
-  ): Promise<TripleRow[]> {
-    return findByAVE(this.tupleStore, [attribute, value, entityId], direction);
-  }
+  ): Promise<TripleRow[]> {}
   // findByVAE(
   //   [value, attribute, entityId]: [
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/triple-store.ts:690:63
   // ): Promise<TripleRow[]> {
   //   return findByVAE(this.tupleStore, [value, attribute, entityId], direction);
   // }
-  findByEntity(id?: string | undefined): Promise<TripleRow[]> {
-    return findByEntity(this.tupleStore, id);
-  }
+  findByEntity(id?: string | undefined): Promise<TripleRow[]> {}
   findByEntityAttribute(
     id: string,
killedBy: subscriptions handles selection updates; triple inserts can insert a single triple
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/triple-store.ts:696:27
   findByEntityAttribute(
     id: string,
     attribute: Attribute
-  ): Promise<TripleRow[]> {
-    return findByEntityAttribute(this.tupleStore, id, attribute);
-  }
+  ): Promise<TripleRow[]> {}
   findByAttribute(attribute: Attribute): Promise<TripleRow[]> {
     return findByAttribute(this.tupleStore, attribute);
killedBy: search/scan functionality can find by Entity Attribute and EAV
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/triple-store.ts:699:63
   ): Promise<TripleRow[]> {
     return findByEntityAttribute(this.tupleStore, id, attribute);
   }
-  findByAttribute(attribute: Attribute): Promise<TripleRow[]> {
-    return findByAttribute(this.tupleStore, attribute);
-  }
+  findByAttribute(attribute: Attribute): Promise<TripleRow[]> {}
   // findByValue(value: Value): Promise<TripleRow[]> {
   //   return findByValue(this.tupleStore, value);
killedBy: triple inserts can insert a single triple
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/triple-store.ts:706:31
   //   return findByValue(this.tupleStore, value);
   // }
 
-  getEntity(entityId: string) {
-    return getEntity(this.tupleStore, entityId);
-  }
+  getEntity(entityId: string) {}
 
   getEntities(collectionName: string) {
killedBy: Database API can lookup entity by Id
statusReason: expected undefined to be null

[Killed] BlockStatement
src/triple-store.ts:710:39
     return getEntity(this.tupleStore, entityId);
   }
 
-  getEntities(collectionName: string) {
-    return getEntities(this.tupleStore, collectionName);
-  }
+  getEntities(collectionName: string) {}
 
   findMaxTimestamp(clientId: string) {
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
src/triple-store.ts:714:38
     return getEntities(this.tupleStore, collectionName);
   }
 
-  findMaxTimestamp(clientId: string) {
-    return findMaxTimestamp(this.tupleStore, clientId);
-  }
+  findMaxTimestamp(clientId: string) {}
 
   findByClientTimestamp(
killedBy: search/scan functionality can find by the max timestamp
statusReason: expected undefined to strictly equal [ 2, 'B' ]

[Killed] BlockStatement
src/triple-store.ts:722:5
     clientId: string,
     scanDirection: 'lt' | 'lte' | 'gt' | 'gte',
     timestamp: Timestamp | undefined
-  ) {
-    return findByClientTimestamp(
-      this.tupleStore,
-      clientId,
-      scanDirection,
-      timestamp
-    );
-  }
+  ) {}
 
   async transact(
killedBy: search/scan functionality can find by clientId
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/triple-store.ts:737:59
   ) {
     // const schema = await this.readSchema();
     const schema = await this.readSchema();
-    await this.tupleStore.autoTransact(async (tupleTx) => {
-      const tx = new TripleStoreTransaction({
-        tupleTx: tupleTx,
-        clock: this.clock,
-        schema,
-      });
-      try {
-        await callback(tx);
-      } catch (e) {
-        throw e;
-        // console.error(e);
-      }
-    }, scope);
+    await this.tupleStore.autoTransact(async (tupleTx) => {}, scope);
     // const tx = new TripleStoreTransaction({
     //   tupleTx: this.tupleStore.transact(scope),
killedBy: Database API will throw an error if the provided entity id has a # sign in it; triple inserts can insert a single triple
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ObjectLiteral
src/triple-store.ts:738:45
     // const schema = await this.readSchema();
     const schema = await this.readSchema();
     await this.tupleStore.autoTransact(async (tupleTx) => {
-      const tx = new TripleStoreTransaction({
-        tupleTx: tupleTx,
-        clock: this.clock,
-        schema,
-      });
+      const tx = new TripleStoreTransaction({});
       try {
         await callback(tx);
killedBy: DurableClock creates a fresh clock if no relevant metadata; Database API can furnish the client id; triple inserts can insert a single triple
statusReason: Cannot read properties of undefined (reading 'set')

[Killed] BlockStatement
src/triple-store.ts:743:11
         clock: this.clock,
         schema,
       });
-      try {
-        await callback(tx);
-      } catch (e) {
+      try {} catch (e) {
         throw e;
         // console.error(e);
killedBy: DurableClock initializes with persisted clock if available; Database API will throw an error if the provided entity id has a # sign in it; triple inserts can insert a single triple
statusReason: expected +0 to be 15 // Object.is equality

[Killed] BlockStatement
src/triple-store.ts:745:19
       });
       try {
         await callback(tx);
-      } catch (e) {
-        throw e;
-        // console.error(e);
-      }
+      } catch (e) {}
     }, scope);
     // const tx = new TripleStoreTransaction({
killedBy: Database API will throw an error if the provided entity id has a # sign in it; schema triple-store should prevent wrong types
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/triple-store.ts:767:62
     // }
   }
 
-  setStorageScope(storageKeys: (keyof typeof this.stores)[]) {
-    return new TripleStore({
-      stores: Object.fromEntries(
-        Object.entries(this.stores).filter(([storagekey]) =>
-          storageKeys.includes(storagekey as keyof typeof this.stores)
-        )
-      ),
-      storageScope: storageKeys,
-      tenantId: this.tenantId,
-      clock: this.clock,
-    });
-  }
+  setStorageScope(storageKeys: (keyof typeof this.stores)[]) {}
 
   async setValue(
killedBy: DurableClock creates a fresh clock if no relevant metadata; setStorageScope using setStorageScope scopes writes
statusReason: Cannot read properties of undefined (reading 'readMetadataTuples')

[Killed] ArrowFunction
src/triple-store.ts:770:44
   setStorageScope(storageKeys: (keyof typeof this.stores)[]) {
     return new TripleStore({
       stores: Object.fromEntries(
-        Object.entries(this.stores).filter(([storagekey]) =>
-          storageKeys.includes(storagekey as keyof typeof this.stores)
+        Object.entries(this.stores).filter(() => undefined
         )
       ),
killedBy: DurableClock initializes with persisted clock if available
statusReason: expected +0 to be 15 // Object.is equality

[Killed] MethodExpression
src/triple-store.ts:770:9
   setStorageScope(storageKeys: (keyof typeof this.stores)[]) {
     return new TripleStore({
       stores: Object.fromEntries(
-        Object.entries(this.stores).filter(([storagekey]) =>
-          storageKeys.includes(storagekey as keyof typeof this.stores)
-        )
+        Object.entries(this.stores)
       ),
       storageScope: storageKeys,
killedBy: setStorageScope using setStorageScope scopes writes
statusReason: expected 4 to be +0 // Object.is equality

[Killed] BlockStatement
src/triple-store.ts:784:20
     entity: string,
     attribute: Attribute,
     value: Value
-  ): Promise<void> {
-    await this.transact(async (tx) => {
-      await tx.setValue(entity, attribute, value);
-    });
-  }
+  ): Promise<void> {}
 
   async insertTriple(tripleRow: TripleRow) {
killedBy: mutating triple values from the store can set the value of a triple
statusReason: expected 'value' to be 'new-value' // Object.is equality

[Killed] BlockStatement
src/triple-store.ts:785:39
     attribute: Attribute,
     value: Value
   ): Promise<void> {
-    await this.transact(async (tx) => {
-      await tx.setValue(entity, attribute, value);
-    });
+    await this.transact(async (tx) => {});
   }
 
killedBy: mutating triple values from the store can set the value of a triple
statusReason: expected 'value' to be 'new-value' // Object.is equality

[Killed] BlockStatement
src/triple-store.ts:790:44
     });
   }
 
-  async insertTriple(tripleRow: TripleRow) {
-    await this.transact(async (tx) => {
-      await tx.insertTriple(tripleRow);
-    });
-  }
+  async insertTriple(tripleRow: TripleRow) {}
 
   async insertTriples(triplesInput: TripleRow[]) {
killedBy: triple inserts can insert a single triple
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/triple-store.ts:791:39
   }
 
   async insertTriple(tripleRow: TripleRow) {
-    await this.transact(async (tx) => {
-      await tx.insertTriple(tripleRow);
-    });
+    await this.transact(async (tx) => {});
   }
 
killedBy: triple inserts can insert a single triple
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/triple-store.ts:796:50
     });
   }
 
-  async insertTriples(triplesInput: TripleRow[]) {
-    await this.transact(async (tx) => {
-      await tx.insertTriples(triplesInput);
-    });
-  }
+  async insertTriples(triplesInput: TripleRow[]) {}
 
   onInsert(callback: (triples: TripleRow[]) => void) {
killedBy: triple inserts can insert multiple triples
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/triple-store.ts:797:39
   }
 
   async insertTriples(triplesInput: TripleRow[]) {
-    await this.transact(async (tx) => {
-      await tx.insertTriples(triplesInput);
-    });
+    await this.transact(async (tx) => {});
   }
 
killedBy: triple inserts can insert multiple triples
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/triple-store.ts:802:54
     });
   }
 
-  onInsert(callback: (triples: TripleRow[]) => void) {
-    function writesCallback(writes: WriteOps<TupleIndex>) {
-      const { set = [] } = writes;
-      if (set.length === 0) return;
-      const triples = set.map((w) => indexToTriple(w));
-      callback(triples);
-    }
-    const unsub = this.tupleStore.subscribe(
-      { prefix: ['EAV'] },
-      writesCallback
-    );
-    return () => {
-      unsub();
-    };
-  }
+  onInsert(callback: (triples: TripleRow[]) => void) {}
 
   // Including this as a way to capture any change to the store
killedBy: DurableClock can read new timestamps from the store and update the clock
statusReason: expected +0 to be 16 // Object.is equality

[Killed] BlockStatement
src/triple-store.ts:803:59
   }
 
   onInsert(callback: (triples: TripleRow[]) => void) {
-    function writesCallback(writes: WriteOps<TupleIndex>) {
-      const { set = [] } = writes;
-      if (set.length === 0) return;
-      const triples = set.map((w) => indexToTriple(w));
-      callback(triples);
-    }
+    function writesCallback(writes: WriteOps<TupleIndex>) {}
     const unsub = this.tupleStore.subscribe(
       { prefix: ['EAV'] },
killedBy: insert triggers metadata updates do not fire triggers; DurableClock can read new timestamps from the store and update the clock
statusReason: expected "spy" to be called 1 times, but got 0 times

[NoCoverage] ArrayDeclaration
src/triple-store.ts:804:21
 
   onInsert(callback: (triples: TripleRow[]) => void) {
     function writesCallback(writes: WriteOps<TupleIndex>) {
-      const { set = [] } = writes;
+      const { set = ["Stryker was here"] } = writes;
       if (set.length === 0) return;
       const triples = set.map((w) => indexToTriple(w));

[Killed] ConditionalExpression
src/triple-store.ts:805:11
   onInsert(callback: (triples: TripleRow[]) => void) {
     function writesCallback(writes: WriteOps<TupleIndex>) {
       const { set = [] } = writes;
-      if (set.length === 0) return;
+      if (true) return;
       const triples = set.map((w) => indexToTriple(w));
       callback(triples);
killedBy: insert triggers metadata updates do not fire triggers; DurableClock can read new timestamps from the store and update the clock
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] EqualityOperator
src/triple-store.ts:805:11
   onInsert(callback: (triples: TripleRow[]) => void) {
     function writesCallback(writes: WriteOps<TupleIndex>) {
       const { set = [] } = writes;
-      if (set.length === 0) return;
+      if (set.length !== 0) return;
       const triples = set.map((w) => indexToTriple(w));
       callback(triples);
killedBy: DurableClock can read new timestamps from the store and update the clock
statusReason: expected +0 to be 16 // Object.is equality

[Killed] ArrowFunction
src/triple-store.ts:806:31
     function writesCallback(writes: WriteOps<TupleIndex>) {
       const { set = [] } = writes;
       if (set.length === 0) return;
-      const triples = set.map((w) => indexToTriple(w));
+      const triples = set.map(() => undefined);
       callback(triples);
     }
killedBy: DurableClock can read new timestamps from the store and update the clock; mutating triple values from the store can set the value of a triple
statusReason: expected +0 to be 16 // Object.is equality

[NoCoverage] BlockStatement
src/triple-store.ts:813:18
       { prefix: ['EAV'] },
       writesCallback
     );
-    return () => {
-      unsub();
-    };
+    return () => {};
   }
 

[Killed] BlockStatement
src/triple-store.ts:823:5
   // This might actually be a use case for tombstones
   onWrite(
     callback: (writes: { inserts: TripleRow[]; deletes: TripleRow[] }) => void
-  ) {
-    function writesCallback(writes: WriteOps<TupleIndex>) {
-      const { set = [], remove = [] } = writes;
-      if (set.length === 0 && remove.length === 0) return;
-      const inserts = set.map((w) => indexToTriple(w));
-      const deletes = remove.map((w) =>
-        //@ts-ignore
-        indexToTriple({ key: w, value: { expired: false } })
-      );
-      callback({ inserts, deletes });
-    }
-    const unsub = this.tupleStore.subscribe(
-      { prefix: ['EAV'] },
-      writesCallback
-    );
-    return unsub;
-  }
+  ) {}
 
   async deleteTriple(triple: TripleRow) {
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/triple-store.ts:824:59
   onWrite(
     callback: (writes: { inserts: TripleRow[]; deletes: TripleRow[] }) => void
   ) {
-    function writesCallback(writes: WriteOps<TupleIndex>) {
-      const { set = [], remove = [] } = writes;
-      if (set.length === 0 && remove.length === 0) return;
-      const inserts = set.map((w) => indexToTriple(w));
-      const deletes = remove.map((w) =>
-        //@ts-ignore
-        indexToTriple({ key: w, value: { expired: false } })
-      );
-      callback({ inserts, deletes });
-    }
+    function writesCallback(writes: WriteOps<TupleIndex>) {}
     const unsub = this.tupleStore.subscribe(
       { prefix: ['EAV'] },
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[NoCoverage] ArrayDeclaration
src/triple-store.ts:825:34
     callback: (writes: { inserts: TripleRow[]; deletes: TripleRow[] }) => void
   ) {
     function writesCallback(writes: WriteOps<TupleIndex>) {
-      const { set = [], remove = [] } = writes;
+      const { set = [], remove = ["Stryker was here"] } = writes;
       if (set.length === 0 && remove.length === 0) return;
       const inserts = set.map((w) => indexToTriple(w));

[Killed] ConditionalExpression
src/triple-store.ts:826:11
   ) {
     function writesCallback(writes: WriteOps<TupleIndex>) {
       const { set = [], remove = [] } = writes;
-      if (set.length === 0 && remove.length === 0) return;
+      if (true) return;
       const inserts = set.map((w) => indexToTriple(w));
       const deletes = remove.map((w) =>
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/triple-store.ts:826:11
   ) {
     function writesCallback(writes: WriteOps<TupleIndex>) {
       const { set = [], remove = [] } = writes;
-      if (set.length === 0 && remove.length === 0) return;
+      if (true && remove.length === 0) return;
       const inserts = set.map((w) => indexToTriple(w));
       const deletes = remove.map((w) =>
killedBy: subscriptions handles order and limit
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/triple-store.ts:827:31
     function writesCallback(writes: WriteOps<TupleIndex>) {
       const { set = [], remove = [] } = writes;
       if (set.length === 0 && remove.length === 0) return;
-      const inserts = set.map((w) => indexToTriple(w));
+      const inserts = set.map(() => undefined);
       const deletes = remove.map((w) =>
         //@ts-ignore
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/triple-store.ts:828:34
       const { set = [], remove = [] } = writes;
       if (set.length === 0 && remove.length === 0) return;
       const inserts = set.map((w) => indexToTriple(w));
-      const deletes = remove.map((w) =>
-        //@ts-ignore
-        indexToTriple({ key: w, value: { expired: false } })
+      const deletes = remove.map(() => undefined
       );
       callback({ inserts, deletes });
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] BooleanLiteral
src/triple-store.ts:830:51
       const inserts = set.map((w) => indexToTriple(w));
       const deletes = remove.map((w) =>
         //@ts-ignore
-        indexToTriple({ key: w, value: { expired: false } })
+        indexToTriple({ key: w, value: { expired: true } })
       );
       callback({ inserts, deletes });

[Killed] ObjectLiteral
src/triple-store.ts:830:23
       const inserts = set.map((w) => indexToTriple(w));
       const deletes = remove.map((w) =>
         //@ts-ignore
-        indexToTriple({ key: w, value: { expired: false } })
+        indexToTriple({})
       );
       callback({ inserts, deletes });
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrayDeclaration
src/triple-store.ts:835:17
       callback({ inserts, deletes });
     }
     const unsub = this.tupleStore.subscribe(
-      { prefix: ['EAV'] },
+      { prefix: [] },
       writesCallback
     );
killedBy: subscriptions handles selection updates
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/triple-store.ts:841:41
     return unsub;
   }
 
-  async deleteTriple(triple: TripleRow) {
-    await this.transact(async (tx) => {
-      await tx.deleteTriples([triple]);
-    });
-  }
+  async deleteTriple(triple: TripleRow) {}
 
   async deleteTriples(triples: TripleRow[]) {
killedBy: Deleting triples can delete a triple
statusReason: expected [ { id: 'cats#1', …(4) } ] to have a length of +0 but got 1

[Killed] BlockStatement
src/triple-store.ts:842:39
   }
 
   async deleteTriple(triple: TripleRow) {
-    await this.transact(async (tx) => {
-      await tx.deleteTriples([triple]);
-    });
+    await this.transact(async (tx) => {});
   }
 
killedBy: Deleting triples can delete a triple
statusReason: expected [ { id: 'cats#1', …(4) } ] to have a length of +0 but got 1

[Killed] ArrayDeclaration
src/triple-store.ts:843:30
 
   async deleteTriple(triple: TripleRow) {
     await this.transact(async (tx) => {
-      await tx.deleteTriples([triple]);
+      await tx.deleteTriples([]);
     });
   }
killedBy: Deleting triples can delete a triple
statusReason: expected [ { id: 'cats#1', …(4) } ] to have a length of +0 but got 1

[Killed] BlockStatement
src/triple-store.ts:847:45
     });
   }
 
-  async deleteTriples(triples: TripleRow[]) {
-    await this.transact(async (tx) => {
-      await tx.deleteTriples(triples);
-    });
-  }
+  async deleteTriples(triples: TripleRow[]) {}
 
   async readMetadataTuples(entityId: string, attribute?: Attribute) {
killedBy: Deleting triples can delete multiple triples
statusReason: expected [ { id: 'cats#1', …(4) }, …(1) ] to have a length of +0 but got 2

[Killed] BlockStatement
src/triple-store.ts:848:39
   }
 
   async deleteTriples(triples: TripleRow[]) {
-    await this.transact(async (tx) => {
-      await tx.deleteTriples(triples);
-    });
+    await this.transact(async (tx) => {});
   }
 
killedBy: Deleting triples can delete multiple triples
statusReason: expected [ { id: 'cats#1', …(4) }, …(1) ] to have a length of +0 but got 2

[Killed] BlockStatement
src/triple-store.ts:853:69
     });
   }
 
-  async readMetadataTuples(entityId: string, attribute?: Attribute) {
-    return (
-      await this.tupleStore.scan({
-        prefix: ['metadata', entityId, ...(attribute ?? [])],
-      })
-    ).map(mapStaticTupleToEAV);
-  }
+  async readMetadataTuples(entityId: string, attribute?: Attribute) {}
 
   async updateMetadataTuples(updates: EAV[]) {
killedBy: triple inserts can insert a single triple; Database API can furnish the client id; DurableClock creates a fresh clock if no relevant metadata
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ObjectLiteral
src/triple-store.ts:855:34
 
   async readMetadataTuples(entityId: string, attribute?: Attribute) {
     return (
-      await this.tupleStore.scan({
-        prefix: ['metadata', entityId, ...(attribute ?? [])],
-      })
+      await this.tupleStore.scan({})
     ).map(mapStaticTupleToEAV);
   }
killedBy: DurableClock can read new timestamps from the store and update the clock; Database API can furnish the client id; insert triggers metadata updates do not fire triggers
statusReason: b does not match any registered models ()

[Killed] LogicalOperator
src/triple-store.ts:856:44
   async readMetadataTuples(entityId: string, attribute?: Attribute) {
     return (
       await this.tupleStore.scan({
-        prefix: ['metadata', entityId, ...(attribute ?? [])],
+        prefix: ['metadata', entityId, ...(attribute && [])],
       })
     ).map(mapStaticTupleToEAV);
killedBy: DurableClock creates a fresh clock if no relevant metadata
statusReason: (intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] BlockStatement
src/triple-store.ts:861:46
     ).map(mapStaticTupleToEAV);
   }
 
-  async updateMetadataTuples(updates: EAV[]) {
-    await this.transact(async (tx) => {
-      await tx.updateMetadataTuples(updates);
-    });
-  }
+  async updateMetadataTuples(updates: EAV[]) {}
 
   async deleteMetadataTuples(
killedBy: DurableClock initializes with persisted clock if available; migrations initializing a DB with migrations sets the schema
statusReason: expected +0 to be 15 // Object.is equality

[Killed] BlockStatement
src/triple-store.ts:862:39
   }
 
   async updateMetadataTuples(updates: EAV[]) {
-    await this.transact(async (tx) => {
-      await tx.updateMetadataTuples(updates);
-    });
+    await this.transact(async (tx) => {});
   }
 
killedBy: DurableClock initializes with persisted clock if available
statusReason: expected +0 to be 15 // Object.is equality

[Killed] BlockStatement
src/triple-store.ts:869:5
 
   async deleteMetadataTuples(
     deletes: [entityId: string, attribute?: Attribute][]
-  ) {
-    await this.transact(async (tx) => {
-      await tx.deleteMetadataTuples(deletes);
-    });
-  }
+  ) {}
 
   async readSchema() {
killedBy: schema triple-store should allow the deletion of metadatatriples
statusReason: expected { collections: { …(1) }, version: +0 } to be falsy

[Killed] BlockStatement
src/triple-store.ts:870:39
   async deleteMetadataTuples(
     deletes: [entityId: string, attribute?: Attribute][]
   ) {
-    await this.transact(async (tx) => {
-      await tx.deleteMetadataTuples(deletes);
-    });
+    await this.transact(async (tx) => {});
   }
 
killedBy: schema triple-store should allow the deletion of metadatatriples
statusReason: expected { collections: { …(1) }, version: +0 } to be falsy

[Killed] BlockStatement
src/triple-store.ts:875:22
     });
   }
 
-  async readSchema() {
-    // Wait for initial schema write to complete
-    await this.ensureInitializedSchema;
-    // Lazily assign in memory schema object
-    if (!this.schema) {
-      this.schema = await this.readSchemaFromStorage();
-    }
-    return this.schema;
-  }
+  async readSchema() {}
 
   private async readSchemaFromStorage() {
killedBy: schema triple-store defining a store with a schema should store schema
statusReason: expected undefined to be truthy

[Survived] ConditionalExpression
src/triple-store.ts:879:9
     // Wait for initial schema write to complete
     await this.ensureInitializedSchema;
     // Lazily assign in memory schema object
-    if (!this.schema) {
+    if (true) {
       this.schema = await this.readSchemaFromStorage();
     }

[Survived] BlockStatement
src/triple-store.ts:879:23
     // Wait for initial schema write to complete
     await this.ensureInitializedSchema;
     // Lazily assign in memory schema object
-    if (!this.schema) {
-      this.schema = await this.readSchemaFromStorage();
-    }
+    if (!this.schema) {}
     return this.schema;
   }

[Killed] ConditionalExpression
src/triple-store.ts:888:9
   private async readSchemaFromStorage() {
     const schemaTriples = await this.readMetadataTuples('_schema');
     // At some point we probably want to validate the we extract (ie has expected props)
-    if (!schemaTriples.length) return undefined;
+    if (false) return undefined;
     return tuplesToSchema(schemaTriples);
   }
killedBy: DurableClock can read new timestamps from the store and update the clock; Database API can furnish the client id
statusReason: b does not match any registered models ()

[Killed] BlockStatement
src/triple-store.ts:892:17
     return tuplesToSchema(schemaTriples);
   }
 
-  async clear() {
-    await this.tupleStore.clear();
-  }
+  async clear() {}
 }
 
killedBy: migrations Data deletion clear() removes all data from the database
statusReason: expected 13 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/triple-store.ts:902:7
   attribute: Attribute,
   value: Value
 ) {
-  if (schema == undefined) {
+  if (true) {
     throw new Error('Cannot validate triples. No schema was registered.');
   }
killedBy: Set operations can add to set
statusReason: Cannot validate triples. No schema was registered.
