[Killed] EqualityOperator
src/triple-store.ts:902:7
   attribute: Attribute,
   value: Value
 ) {
-  if (schema == undefined) {
+  if (schema != undefined) {
     throw new Error('Cannot validate triples. No schema was registered.');
   }
killedBy: Set operations can add to set
statusReason: Cannot validate triples. No schema was registered.

[Killed] ConditionalExpression
src/triple-store.ts:908:7
   const [modelName, ...path] = attribute;
 
   // TODO: remove this hack
-  if (modelName === '_collection') return;
+  if (true) return;
 
   const model = schema[modelName];
killedBy: schema triple-store should prevent wrong types
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
src/triple-store.ts:908:7
   const [modelName, ...path] = attribute;
 
   // TODO: remove this hack
-  if (modelName === '_collection') return;
+  if (modelName !== '_collection') return;
 
   const model = schema[modelName];
killedBy: schema triple-store should prevent wrong types; Set operations can add to set
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
src/triple-store.ts:911:7
   if (modelName === '_collection') return;
 
   const model = schema[modelName];
-  if (!model) {
+  if (model) {
     throw new Error(
       `${modelName} does not match any registered models (${Object.keys(
killedBy: Set operations can add to set
statusReason: companies does not match any registered models (companies)

[Killed] ConditionalExpression
src/triple-store.ts:911:7
   if (modelName === '_collection') return;
 
   const model = schema[modelName];
-  if (!model) {
+  if (true) {
     throw new Error(
       `${modelName} does not match any registered models (${Object.keys(
killedBy: Set operations can add to set
statusReason: companies does not match any registered models (companies)

[Killed] BooleanLiteral
src/triple-store.ts:922:7
   // Leaf values are an array [value, timestamp], so check value
   const clockedSchema = getSchemaFromPath(model, path);
   const valueSchema = clockedSchema.items[0];
-  if (!SchemaValue.Check(valueSchema, value))
+  if (SchemaValue.Check(valueSchema, value))
     throw new Error(
       `Value ${value} does not match schema for ${attribute.join('.')}`
killedBy: Set operations can add to set; schema triple-store should prevent wrong types
statusReason: Value 1 does not match schema for companies.id

[Killed] ConditionalExpression
src/triple-store.ts:922:7
   // Leaf values are an array [value, timestamp], so check value
   const clockedSchema = getSchemaFromPath(model, path);
   const valueSchema = clockedSchema.items[0];
-  if (!SchemaValue.Check(valueSchema, value))
+  if (false)
     throw new Error(
       `Value ${value} does not match schema for ${attribute.join('.')}`
killedBy: schema triple-store should prevent wrong types
statusReason: promise resolved "undefined" instead of rejecting

[Survived] StringLiteral
src/triple-store.ts:924:7
   const valueSchema = clockedSchema.items[0];
   if (!SchemaValue.Check(valueSchema, value))
     throw new Error(
-      `Value ${value} does not match schema for ${attribute.join('.')}`
+      ``
     );
 }

[Killed] BlockStatement
src/triple-store.ts:931:3
 async function scanToTriples(
   tx: MultiTupleStoreOrTransaction,
   ...scanParams: Parameters<MultiTupleStoreOrTransaction['scan']>
-) {
-  // console.log(scanParams);
-  // @ts-ignore
-  return (await tx.scan(...scanParams)).map(indexToTriple);
-}
+) {}
 
 async function findByCollection(
killedBy: triple inserts can insert a single triple; Database API supports basic queries with filters
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/triple-store.ts:941:3
   tx: MultiTupleStoreOrTransaction,
   collectionName: string,
   direction?: 'ASC' | 'DESC'
-) {
-  return scanToTriples(tx, {
-    prefix: ['EAV'],
-    gte: [collectionName],
-    // @ts-ignore
-    lt: [collectionName + MAX],
-    reverse: direction === 'DESC',
-  });
-}
+) {}
 
 async function findByEAV(
killedBy: search/scan functionality can find by collection; subscriptions handles selection updates
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ObjectLiteral
src/triple-store.ts:942:28
   collectionName: string,
   direction?: 'ASC' | 'DESC'
 ) {
-  return scanToTriples(tx, {
-    prefix: ['EAV'],
-    gte: [collectionName],
-    // @ts-ignore
-    lt: [collectionName + MAX],
-    reverse: direction === 'DESC',
-  });
+  return scanToTriples(tx, {});
 }
 
killedBy: search/scan functionality can find by collection; subscriptions handles selection updates
statusReason: unsupported index

[Killed] ArrayDeclaration
src/triple-store.ts:943:13
   direction?: 'ASC' | 'DESC'
 ) {
   return scanToTriples(tx, {
-    prefix: ['EAV'],
+    prefix: [],
     gte: [collectionName],
     // @ts-ignore
killedBy: search/scan functionality can find by collection; subscriptions handles selection updates
statusReason: expected [] to match object [ 'cats#1', 'cats#2' ]

[Killed] ArrayDeclaration
src/triple-store.ts:944:10
 ) {
   return scanToTriples(tx, {
     prefix: ['EAV'],
-    gte: [collectionName],
+    gte: [],
     // @ts-ignore
     lt: [collectionName + MAX],
killedBy: search/scan functionality can find by collection
statusReason: expected [ 'cats#1', 'cats#2', 'dogs#1', …(1) ] to match object [ 'dogs#1', 'dogs#2' ]

[Killed] ArithmeticOperator
src/triple-store.ts:946:10
     prefix: ['EAV'],
     gte: [collectionName],
     // @ts-ignore
-    lt: [collectionName + MAX],
+    lt: [collectionName - MAX],
     reverse: direction === 'DESC',
   });
killedBy: search/scan functionality can find by collection; subscriptions handles selection updates
statusReason: Invalid bounds.

[Killed] ArrayDeclaration
src/triple-store.ts:946:9
     prefix: ['EAV'],
     gte: [collectionName],
     // @ts-ignore
-    lt: [collectionName + MAX],
+    lt: [],
     reverse: direction === 'DESC',
   });
killedBy: search/scan functionality can find by collection; subscriptions handles selection updates
statusReason: Invalid bounds.

[Killed] ConditionalExpression
src/triple-store.ts:947:14
     gte: [collectionName],
     // @ts-ignore
     lt: [collectionName + MAX],
-    reverse: direction === 'DESC',
+    reverse: true,
   });
 }
killedBy: search/scan functionality can find by collection
statusReason: expected [ 'cats#2', 'cats#1' ] to match object [ 'cats#1', 'cats#2' ]

[Killed] EqualityOperator
src/triple-store.ts:947:14
     gte: [collectionName],
     // @ts-ignore
     lt: [collectionName + MAX],
-    reverse: direction === 'DESC',
+    reverse: direction !== 'DESC',
   });
 }
killedBy: search/scan functionality can find by collection
statusReason: expected [ 'cats#2', 'cats#1' ] to match object [ 'cats#1', 'cats#2' ]

[Killed] BlockStatement
src/triple-store.ts:959:3
     value?: Value
   ] = [],
   direction?: 'ASC' | 'DESC'
-) {
-  const scanArgs = {
-    prefix: ['EAV'],
-    gte: [entityId ?? MIN, attribute ?? MIN, value ?? MIN],
-    // @ts-ignore
-    lt: [entityId ?? MAX, [...(attribute ?? []), MAX], MAX],
-    reverse: direction === 'DESC',
-  };
-  return scanToTriples(tx, scanArgs);
-}
+) {}
 
 function findByAVE(
killedBy: triple inserts can insert a single triple; Register operations can set register
statusReason: Target cannot be null or undefined.

[Killed] LogicalOperator
src/triple-store.ts:962:28
 ) {
   const scanArgs = {
     prefix: ['EAV'],
-    gte: [entityId ?? MIN, attribute ?? MIN, value ?? MIN],
+    gte: [entityId ?? MIN, attribute && MIN, value ?? MIN],
     // @ts-ignore
     lt: [entityId ?? MAX, [...(attribute ?? []), MAX], MAX],
killedBy: triple inserts can insert a single triple; Register operations can set register
statusReason: Unknown value type: undefined

[Killed] LogicalOperator
src/triple-store.ts:962:46
 ) {
   const scanArgs = {
     prefix: ['EAV'],
-    gte: [entityId ?? MIN, attribute ?? MIN, value ?? MIN],
+    gte: [entityId ?? MIN, attribute ?? MIN, value && MIN],
     // @ts-ignore
     lt: [entityId ?? MAX, [...(attribute ?? []), MAX], MAX],
killedBy: search/scan functionality can find by Entity Attribute and EAV; Register operations can set register
statusReason: Unknown value type: undefined

[Killed] LogicalOperator
src/triple-store.ts:964:32
     prefix: ['EAV'],
     gte: [entityId ?? MIN, attribute ?? MIN, value ?? MIN],
     // @ts-ignore
-    lt: [entityId ?? MAX, [...(attribute ?? []), MAX], MAX],
+    lt: [entityId ?? MAX, [...(attribute && []), MAX], MAX],
     reverse: direction === 'DESC',
   };
killedBy: subscriptions handles selection updates; triple inserts can insert a single triple
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] LogicalOperator
src/triple-store.ts:964:10
     prefix: ['EAV'],
     gte: [entityId ?? MIN, attribute ?? MIN, value ?? MIN],
     // @ts-ignore
-    lt: [entityId ?? MAX, [...(attribute ?? []), MAX], MAX],
+    lt: [entityId && MAX, [...(attribute ?? []), MAX], MAX],
     reverse: direction === 'DESC',
   };
killedBy: subscriptions handles selection updates; triple inserts can insert multiple triples
statusReason: Cannot read properties of undefined (reading 'major')

[Survived] EqualityOperator
src/triple-store.ts:965:14
     gte: [entityId ?? MIN, attribute ?? MIN, value ?? MIN],
     // @ts-ignore
     lt: [entityId ?? MAX, [...(attribute ?? []), MAX], MAX],
-    reverse: direction === 'DESC',
+    reverse: direction !== 'DESC',
   };
   return scanToTriples(tx, scanArgs);

[Survived] ConditionalExpression
src/triple-store.ts:965:14
     gte: [entityId ?? MIN, attribute ?? MIN, value ?? MIN],
     // @ts-ignore
     lt: [entityId ?? MAX, [...(attribute ?? []), MAX], MAX],
-    reverse: direction === 'DESC',
+    reverse: true,
   };
   return scanToTriples(tx, scanArgs);

[Killed] BlockStatement
src/triple-store.ts:978:3
     entityId?: EntityId
   ] = [],
   direction?: 'ASC' | 'DESC'
-) {
-  return scanToTriples(tx, {
-    prefix: ['AVE'],
-    gte: [attribute ?? MIN, value ?? MIN, entityId ?? MIN],
-    // @ts-ignore
-    lt: [[...(attribute ?? []), ...(value ? [] : [MAX])], value ?? MAX, MAX],
-    reverse: direction === 'DESC',
-  });
-}
+) {}
 
 function findValuesInRange(
killedBy: Database API supports basic queries with filters; triple inserts can insert a single triple
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ObjectLiteral
src/triple-store.ts:979:28
   ] = [],
   direction?: 'ASC' | 'DESC'
 ) {
-  return scanToTriples(tx, {
-    prefix: ['AVE'],
-    gte: [attribute ?? MIN, value ?? MIN, entityId ?? MIN],
-    // @ts-ignore
-    lt: [[...(attribute ?? []), ...(value ? [] : [MAX])], value ?? MAX, MAX],
-    reverse: direction === 'DESC',
-  });
+  return scanToTriples(tx, {});
 }
 
killedBy: Database API supports basic queries with filters; triple inserts can insert a single triple
statusReason: unsupported index

[Killed] StringLiteral
src/triple-store.ts:980:14
   direction?: 'ASC' | 'DESC'
 ) {
   return scanToTriples(tx, {
-    prefix: ['AVE'],
+    prefix: [""],
     gte: [attribute ?? MIN, value ?? MIN, entityId ?? MIN],
     // @ts-ignore
killedBy: Database API supports basic queries with filters; triple inserts can insert a single triple
statusReason: expected +0 to be 2 // Object.is equality

[Killed] LogicalOperator
src/triple-store.ts:981:43
 ) {
   return scanToTriples(tx, {
     prefix: ['AVE'],
-    gte: [attribute ?? MIN, value ?? MIN, entityId ?? MIN],
+    gte: [attribute ?? MIN, value ?? MIN, entityId && MIN],
     // @ts-ignore
     lt: [[...(attribute ?? []), ...(value ? [] : [MAX])], value ?? MAX, MAX],
killedBy: Database API supports basic queries with filters
statusReason: Unknown value type: undefined

[Killed] LogicalOperator
src/triple-store.ts:981:29
 ) {
   return scanToTriples(tx, {
     prefix: ['AVE'],
-    gte: [attribute ?? MIN, value ?? MIN, entityId ?? MIN],
+    gte: [attribute ?? MIN, value && MIN, entityId ?? MIN],
     // @ts-ignore
     lt: [[...(attribute ?? []), ...(value ? [] : [MAX])], value ?? MAX, MAX],
killedBy: Database API supports basic queries with the "like" operator; triple inserts can insert a single triple
statusReason: Cannot read properties of undefined (reading 'triples')

[Killed] LogicalOperator
src/triple-store.ts:983:15
     prefix: ['AVE'],
     gte: [attribute ?? MIN, value ?? MIN, entityId ?? MIN],
     // @ts-ignore
-    lt: [[...(attribute ?? []), ...(value ? [] : [MAX])], value ?? MAX, MAX],
+    lt: [[...(attribute && []), ...(value ? [] : [MAX])], value ?? MAX, MAX],
     reverse: direction === 'DESC',
   });
killedBy: Database API supports basic queries with filters; triple inserts can insert multiple triples
statusReason: expected +0 to be 2 // Object.is equality

[Killed] LogicalOperator
src/triple-store.ts:983:59
     prefix: ['AVE'],
     gte: [attribute ?? MIN, value ?? MIN, entityId ?? MIN],
     // @ts-ignore
-    lt: [[...(attribute ?? []), ...(value ? [] : [MAX])], value ?? MAX, MAX],
+    lt: [[...(attribute ?? []), ...(value ? [] : [MAX])], value && MAX, MAX],
     reverse: direction === 'DESC',
   });
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'triples')

[Killed] EqualityOperator
src/triple-store.ts:984:14
     gte: [attribute ?? MIN, value ?? MIN, entityId ?? MIN],
     // @ts-ignore
     lt: [[...(attribute ?? []), ...(value ? [] : [MAX])], value ?? MAX, MAX],
-    reverse: direction === 'DESC',
+    reverse: direction !== 'DESC',
   });
 }
killedBy: Database API can report basic collection stats from the database
statusReason: expected [ 'Student', 'Rapper', …(2) ] to deeply equal [ 'Class', 'Department', …(2) ]

[Killed] ConditionalExpression
src/triple-store.ts:984:14
     gte: [attribute ?? MIN, value ?? MIN, entityId ?? MIN],
     // @ts-ignore
     lt: [[...(attribute ?? []), ...(value ? [] : [MAX])], value ?? MAX, MAX],
-    reverse: direction === 'DESC',
+    reverse: true,
   });
 }
killedBy: Database API can report basic collection stats from the database
statusReason: expected [ 'Student', 'Rapper', …(2) ] to deeply equal [ 'Class', 'Department', …(2) ]

[Killed] BlockStatement
src/triple-store.ts:1000:3
     lessThan?: ValueCursor;
     direction?: 'ASC' | 'DESC';
   } = {}
-) {
-  const scanArgs = {
-    prefix: ['AVE'],
-    // @ts-ignore
-    gt: [attribute].concat(greaterThan ?? [MIN, MIN]),
-    // @ts-ignore
-    lt: [attribute].concat(lessThan ?? [MAX, MAX]),
-    reverse: direction === 'DESC',
-  };
-  return scanToTriples(tx, scanArgs);
-}
+) {}
 
 // function findByVAE(
killedBy: subscriptions handles order and limit; search/scan functionality can find values in a range
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/triple-store.ts:1002:14
   } = {}
 ) {
   const scanArgs = {
-    prefix: ['AVE'],
+    prefix: [""],
     // @ts-ignore
     gt: [attribute].concat(greaterThan ?? [MIN, MIN]),
killedBy: search/scan functionality can find values in a range; subscriptions handles order and limit
statusReason: expected [] to have a length of 2 but got +0

[Killed] LogicalOperator
src/triple-store.ts:1004:28
   const scanArgs = {
     prefix: ['AVE'],
     // @ts-ignore
-    gt: [attribute].concat(greaterThan ?? [MIN, MIN]),
+    gt: [attribute].concat(greaterThan && [MIN, MIN]),
     // @ts-ignore
     lt: [attribute].concat(lessThan ?? [MAX, MAX]),
killedBy: subscriptions handles order and limit; search/scan functionality can find values in a range
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] ArrayDeclaration
src/triple-store.ts:1004:43
   const scanArgs = {
     prefix: ['AVE'],
     // @ts-ignore
-    gt: [attribute].concat(greaterThan ?? [MIN, MIN]),
+    gt: [attribute].concat(greaterThan ?? []),
     // @ts-ignore
     lt: [attribute].concat(lessThan ?? [MAX, MAX]),

[Killed] LogicalOperator
src/triple-store.ts:1006:28
     // @ts-ignore
     gt: [attribute].concat(greaterThan ?? [MIN, MIN]),
     // @ts-ignore
-    lt: [attribute].concat(lessThan ?? [MAX, MAX]),
+    lt: [attribute].concat(lessThan && [MAX, MAX]),
     reverse: direction === 'DESC',
   };
killedBy: search/scan functionality can find values in a range; subscriptions handles order and limit
statusReason: expected [ { id: 'cats#1', …(4) }, …(2) ] to have a length of 1 but got 3

[Killed] EqualityOperator
src/triple-store.ts:1007:14
     gt: [attribute].concat(greaterThan ?? [MIN, MIN]),
     // @ts-ignore
     lt: [attribute].concat(lessThan ?? [MAX, MAX]),
-    reverse: direction === 'DESC',
+    reverse: direction !== 'DESC',
   };
   return scanToTriples(tx, scanArgs);
killedBy: subscriptions handles order and limit
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/triple-store.ts:1007:14
     gt: [attribute].concat(greaterThan ?? [MIN, MIN]),
     // @ts-ignore
     lt: [attribute].concat(lessThan ?? [MAX, MAX]),
-    reverse: direction === 'DESC',
+    reverse: false,
   };
   return scanToTriples(tx, scanArgs);
killedBy: ORDER & LIMIT & Pagination order by DESC
statusReason: expected false to be truthy

[Killed] BlockStatement
src/triple-store.ts:1033:25
 async function findByEntity(
   tx: MultiTupleStoreOrTransaction,
   id?: EntityId
-): Promise<TripleRow[]> {
-  return findByEAV(tx, [id]);
-}
+): Promise<TripleRow[]> {}
 
 async function findByEntityAttribute(
killedBy: subscriptions handles selection updates; triple inserts can insert a single triple
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrayDeclaration
src/triple-store.ts:1034:24
   tx: MultiTupleStoreOrTransaction,
   id?: EntityId
 ): Promise<TripleRow[]> {
-  return findByEAV(tx, [id]);
+  return findByEAV(tx, []);
 }
 
killedBy: triple inserts can insert multiple triples
statusReason: expected [ { id: 'id-1', …(4) }, …(1) ] to have a length of 1 but got 2

[Killed] BlockStatement
src/triple-store.ts:1041:25
   tx: MultiTupleStoreOrTransaction,
   id: EntityId,
   attribute: Attribute
-): Promise<TripleRow[]> {
-  return findByEAV(tx, [id, attribute]);
-}
+): Promise<TripleRow[]> {}
 
 async function findByAttribute(
killedBy: Register operations can set register; search/scan functionality can find by Entity Attribute and EAV
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] BlockStatement
src/triple-store.ts:1048:25
 async function findByAttribute(
   tx: MultiTupleStoreOrTransaction,
   attribute: Attribute
-): Promise<TripleRow[]> {
-  return findByAVE(tx, [attribute]);
-}
+): Promise<TripleRow[]> {}
 
 // async function findByValue(
killedBy: triple inserts can insert a single triple; Database API can report basic collection stats from the database
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/triple-store.ts:1060:70
 // }
 
 // [tenantId, 'metadata', '_schema'] prefix
-function mapStaticTupleToEAV(tuple: { key: any[]; value: any }): EAV {
-  const [_index, entityId, ...path] = tuple.key;
-  return [entityId, path, tuple.value];
-}
+function mapStaticTupleToEAV(tuple: { key: any[]; value: any }): EAV {}
 
 // NOTE: SOME WEIRD STUFF GOING ON WITH TUPLE DATABASE AND gt/lte with array prefixes
killedBy: schema triple-store defining a store with a schema should store schema; Set operations can add to set; DurableClock initializes with persisted clock if available
statusReason: .for is not iterable

[Killed] ArrayDeclaration
src/triple-store.ts:1072:23
   scanDirection: 'lt' | 'lte' | 'gt' | 'gte',
   timestamp: Timestamp | undefined
 ) {
-  const indexPrefix = ['clientTimestamp', clientId];
+  const indexPrefix = [];
   if (scanDirection === 'lt') {
     if (!timestamp) return [];
killedBy: search/scan functionality can find by clientId
statusReason: unsupported index

[Killed] StringLiteral
src/triple-store.ts:1072:24
   scanDirection: 'lt' | 'lte' | 'gt' | 'gte',
   timestamp: Timestamp | undefined
 ) {
-  const indexPrefix = ['clientTimestamp', clientId];
+  const indexPrefix = ["", clientId];
   if (scanDirection === 'lt') {
     if (!timestamp) return [];
killedBy: search/scan functionality can find by clientId
statusReason: expected [] to strictly equal [ 'A', 'A' ]

[Killed] ConditionalExpression
src/triple-store.ts:1073:7
   timestamp: Timestamp | undefined
 ) {
   const indexPrefix = ['clientTimestamp', clientId];
-  if (scanDirection === 'lt') {
+  if (false) {
     if (!timestamp) return [];
     return await scanToTriples(tx, {
killedBy: timestamp index less than queries
statusReason: Cannot scan with direction lt

[Killed] EqualityOperator
src/triple-store.ts:1073:7
   timestamp: Timestamp | undefined
 ) {
   const indexPrefix = ['clientTimestamp', clientId];
-  if (scanDirection === 'lt') {
+  if (scanDirection !== 'lt') {
     if (!timestamp) return [];
     return await scanToTriples(tx, {
killedBy: search/scan functionality can find by clientId
statusReason: expected [] to strictly equal [ 'A', 'A' ]

[Killed] BooleanLiteral
src/triple-store.ts:1074:9
 ) {
   const indexPrefix = ['clientTimestamp', clientId];
   if (scanDirection === 'lt') {
-    if (!timestamp) return [];
+    if (timestamp) return [];
     return await scanToTriples(tx, {
       prefix: indexPrefix,
killedBy: timestamp index less than queries
statusReason: Unknown value type: undefined

[Killed] ConditionalExpression
src/triple-store.ts:1074:9
 ) {
   const indexPrefix = ['clientTimestamp', clientId];
   if (scanDirection === 'lt') {
-    if (!timestamp) return [];
+    if (true) return [];
     return await scanToTriples(tx, {
       prefix: indexPrefix,
killedBy: timestamp index less than queries
statusReason: expected [] to have a length of 1 but got +0

[Killed] ObjectLiteral
src/triple-store.ts:1075:36
   const indexPrefix = ['clientTimestamp', clientId];
   if (scanDirection === 'lt') {
     if (!timestamp) return [];
-    return await scanToTriples(tx, {
-      prefix: indexPrefix,
-      lt: [timestamp],
-    });
+    return await scanToTriples(tx, {});
   }
   if (scanDirection === 'lte') {
killedBy: timestamp index less than queries
statusReason: unsupported index

[Killed] ArrayDeclaration
src/triple-store.ts:1077:11
     if (!timestamp) return [];
     return await scanToTriples(tx, {
       prefix: indexPrefix,
-      lt: [timestamp],
+      lt: [],
     });
   }
killedBy: timestamp index less than queries
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/triple-store.ts:1080:7
       lt: [timestamp],
     });
   }
-  if (scanDirection === 'lte') {
+  if (true) {
     if (!timestamp) return [];
     return await scanToTriples(tx, {
killedBy: search/scan functionality can find by clientId
statusReason: expected [] to strictly equal [ 'A', 'A' ]

[Killed] ConditionalExpression
src/triple-store.ts:1080:7
       lt: [timestamp],
     });
   }
-  if (scanDirection === 'lte') {
+  if (false) {
     if (!timestamp) return [];
     return await scanToTriples(tx, {
killedBy: timestamp index less than or equal queries
statusReason: Cannot scan with direction lte

[Killed] ConditionalExpression
src/triple-store.ts:1081:9
     });
   }
   if (scanDirection === 'lte') {
-    if (!timestamp) return [];
+    if (false) return [];
     return await scanToTriples(tx, {
       prefix: indexPrefix,
killedBy: timestamp index less than or equal queries
statusReason: timestamp is not iterable

[Killed] ConditionalExpression
src/triple-store.ts:1081:9
     });
   }
   if (scanDirection === 'lte') {
-    if (!timestamp) return [];
+    if (true) return [];
     return await scanToTriples(tx, {
       prefix: indexPrefix,
killedBy: timestamp index less than or equal queries
statusReason: expected [] to have a length of 1 but got +0

[Killed] ObjectLiteral
src/triple-store.ts:1082:36
   }
   if (scanDirection === 'lte') {
     if (!timestamp) return [];
-    return await scanToTriples(tx, {
-      prefix: indexPrefix,
-      lte: [[...timestamp, MAX]],
-    });
+    return await scanToTriples(tx, {});
   }
   if (scanDirection === 'gt') {
killedBy: timestamp index less than or equal queries
statusReason: unsupported index

[Killed] ArrayDeclaration
src/triple-store.ts:1084:13
     if (!timestamp) return [];
     return await scanToTriples(tx, {
       prefix: indexPrefix,
-      lte: [[...timestamp, MAX]],
+      lte: [[]],
     });
   }
killedBy: timestamp index less than or equal queries
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrayDeclaration
src/triple-store.ts:1084:12
     if (!timestamp) return [];
     return await scanToTriples(tx, {
       prefix: indexPrefix,
-      lte: [[...timestamp, MAX]],
+      lte: [],
     });
   }
killedBy: timestamp index less than or equal queries
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/triple-store.ts:1087:7
       lte: [[...timestamp, MAX]],
     });
   }
-  if (scanDirection === 'gt') {
+  if (scanDirection !== 'gt') {
     return scanToTriples(tx, {
       prefix: indexPrefix,
killedBy: search/scan functionality can find by clientId
statusReason: Cannot scan with direction gt

[Killed] BlockStatement
src/triple-store.ts:1087:31
       lte: [[...timestamp, MAX]],
     });
   }
-  if (scanDirection === 'gt') {
-    return scanToTriples(tx, {
-      prefix: indexPrefix,
-      gt: [[...(timestamp ?? []), MIN]],
-    });
-  }
+  if (scanDirection === 'gt') {}
   if (scanDirection === 'gte') {
     return scanToTriples(tx, {
killedBy: search/scan functionality can find by clientId
statusReason: Cannot scan with direction gt

[Killed] ObjectLiteral
src/triple-store.ts:1088:30
     });
   }
   if (scanDirection === 'gt') {
-    return scanToTriples(tx, {
-      prefix: indexPrefix,
-      gt: [[...(timestamp ?? []), MIN]],
-    });
+    return scanToTriples(tx, {});
   }
   if (scanDirection === 'gte') {
killedBy: search/scan functionality can find by clientId
statusReason: unsupported index

[Killed] LogicalOperator
src/triple-store.ts:1090:17
   if (scanDirection === 'gt') {
     return scanToTriples(tx, {
       prefix: indexPrefix,
-      gt: [[...(timestamp ?? []), MIN]],
+      gt: [[...(timestamp && []), MIN]],
     });
   }
killedBy: search/scan functionality can find by clientId
statusReason: (intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] ArrayDeclaration
src/triple-store.ts:1090:30
   if (scanDirection === 'gt') {
     return scanToTriples(tx, {
       prefix: indexPrefix,
-      gt: [[...(timestamp ?? []), MIN]],
+      gt: [[...(timestamp ?? ["Stryker was here"]), MIN]],
     });
   }
killedBy: search/scan functionality can find by clientId
statusReason: expected [] to strictly equal [ 'A', 'A' ]

[Killed] ConditionalExpression
src/triple-store.ts:1093:7
       gt: [[...(timestamp ?? []), MIN]],
     });
   }
-  if (scanDirection === 'gte') {
+  if (false) {
     return scanToTriples(tx, {
       prefix: indexPrefix,
killedBy: timestamp index greater than or equal queries
statusReason: Cannot scan with direction gte

[Killed] BlockStatement
src/triple-store.ts:1093:32
       gt: [[...(timestamp ?? []), MIN]],
     });
   }
-  if (scanDirection === 'gte') {
-    return scanToTriples(tx, {
-      prefix: indexPrefix,
-      gte: [[...(timestamp ?? [])]],
-    });
-  }
+  if (scanDirection === 'gte') {}
   throw new Error('Cannot scan with direction ' + scanDirection);
 }
killedBy: timestamp index greater than or equal queries
statusReason: Cannot scan with direction gte

[Killed] LogicalOperator
src/triple-store.ts:1096:18
   if (scanDirection === 'gte') {
     return scanToTriples(tx, {
       prefix: indexPrefix,
-      gte: [[...(timestamp ?? [])]],
+      gte: [[...(timestamp && [])]],
     });
   }
killedBy: timestamp index greater than or equal queries
statusReason: (intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] BlockStatement
src/triple-store.ts:1102:78
   throw new Error('Cannot scan with direction ' + scanDirection);
 }
 
-async function getEntity(tx: MultiTupleStoreOrTransaction, entityId: string) {
-  const res = await tx.scan({
-    prefix: ['Entity'],
-    limit: 1,
-    gte: [entityId],
-  });
-  if (res.length === 0 || res[0].key[1] !== entityId) return null;
-  return res[0].value;
-}
+async function getEntity(tx: MultiTupleStoreOrTransaction, entityId: string) {}
 
 async function getEntities(
killedBy: Database API can lookup entity by Id
statusReason: expected undefined to be null

[Killed] ArrayDeclaration
src/triple-store.ts:1104:13
 
 async function getEntity(tx: MultiTupleStoreOrTransaction, entityId: string) {
   const res = await tx.scan({
-    prefix: ['Entity'],
+    prefix: [],
     limit: 1,
     gte: [entityId],
killedBy: Database API can lookup entity by Id
statusReason: expected null not to be null

[Killed] EqualityOperator
src/triple-store.ts:1108:7
     limit: 1,
     gte: [entityId],
   });
-  if (res.length === 0 || res[0].key[1] !== entityId) return null;
+  if (res.length !== 0 || res[0].key[1] !== entityId) return null;
   return res[0].value;
 }
killedBy: triple inserts can insert a single triple
statusReason: Cannot read properties of undefined (reading 'key')
