[Killed] LogicalOperator
src/triple-store.ts:1108:7
     limit: 1,
     gte: [entityId],
   });
-  if (res.length === 0 || res[0].key[1] !== entityId) return null;
+  if (res.length === 0 && res[0].key[1] !== entityId) return null;
   return res[0].value;
 }
killedBy: Database API can furnish the client id; DurableClock can read new timestamps from the store and update the clock; triple inserts can insert a single triple
statusReason: Cannot read properties of undefined (reading 'key')

[Killed] BlockStatement
src/triple-store.ts:1115:3
 async function getEntities(
   tx: MultiTupleStoreOrTransaction,
   collectionName: string
-) {
-  const res = await tx.scan({
-    prefix: ['Entity'],
-    gte: [collectionName],
-    lt: [collectionName + MAX],
-  });
-  return new Map(res.map((r) => [r.key[1], r.value]));
-}
+) {}
 
 async function findMaxTimestamp(
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] ArithmeticOperator
src/triple-store.ts:1119:10
   const res = await tx.scan({
     prefix: ['Entity'],
     gte: [collectionName],
-    lt: [collectionName + MAX],
+    lt: [collectionName - MAX],
   });
   return new Map(res.map((r) => [r.key[1], r.value]));
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'triples')

[Killed] ArrowFunction
src/triple-store.ts:1121:26
     gte: [collectionName],
     lt: [collectionName + MAX],
   });
-  return new Map(res.map((r) => [r.key[1], r.value]));
+  return new Map(res.map(() => undefined));
 }
 
killedBy: Database API supports basic queries with filters
statusReason: Iterator value undefined is not an entry object

[Killed] BlockStatement
src/triple-store.ts:1127:3
 async function findMaxTimestamp(
   tx: MultiTupleStoreOrTransaction,
   clientId: string
-) {
-  const res = (await tx.scan({
-    prefix: ['clientTimestamp', clientId],
-    reverse: true,
-  })) as ClientTimestampIndex[];
-  return res[0]?.key[2];
-}
+) {}
 
killedBy: search/scan functionality can find by the max timestamp
statusReason: expected undefined to strictly equal [ 2, 'A' ]
