[NoCoverage] ArrayDeclaration
src/utils/multi-proxy.ts:3:44
 export function createMultiProxy<T>(
   [primary, ...shadows]: T[],
-  [primaryScope, ...shadowScopes]: any[] = []
+  [primaryScope, ...shadowScopes]: any[] = ["Stryker was here"]
 ): T {
   // if (typeof primary !== typeof secondary) throw new Error("types must match to create shadow");

[NoCoverage] ConditionalExpression
src/utils/multi-proxy.ts:6:7
   [primaryScope, ...shadowScopes]: any[] = []
 ): T {
   // if (typeof primary !== typeof secondary) throw new Error("types must match to create shadow");
-  if (typeof primary === null) return primary;
+  if (false) return primary;
   if (typeof primary === 'function') {
     // @ts-ignore

[NoCoverage] ConditionalExpression
src/utils/multi-proxy.ts:6:7
   [primaryScope, ...shadowScopes]: any[] = []
 ): T {
   // if (typeof primary !== typeof secondary) throw new Error("types must match to create shadow");
-  if (typeof primary === null) return primary;
+  if (true) return primary;
   if (typeof primary === 'function') {
     // @ts-ignore

[NoCoverage] ConditionalExpression
src/utils/multi-proxy.ts:7:7
 ): T {
   // if (typeof primary !== typeof secondary) throw new Error("types must match to create shadow");
   if (typeof primary === null) return primary;
-  if (typeof primary === 'function') {
+  if (false) {
     // @ts-ignore
     return (...args: any[]) => {

[NoCoverage] EqualityOperator
src/utils/multi-proxy.ts:7:7
 ): T {
   // if (typeof primary !== typeof secondary) throw new Error("types must match to create shadow");
   if (typeof primary === null) return primary;
-  if (typeof primary === 'function') {
+  if (typeof primary !== 'function') {
     // @ts-ignore
     return (...args: any[]) => {

[NoCoverage] BlockStatement
src/utils/multi-proxy.ts:9:32
   if (typeof primary === null) return primary;
   if (typeof primary === 'function') {
     // @ts-ignore
-    return (...args: any[]) => {
-      const primaryReturn = primary.apply(primaryScope, args);
-      const shadowReturns = shadows.map((shadow, i) =>
-        (shadow as T & Function).apply(shadowScopes[i], args)
-      );
-      return createMultiProxy(
-        [primaryReturn, ...shadowReturns],
-        [primary, ...shadows]
-      );
-    };
+    return (...args: any[]) => {};
   }
   if (typeof primary === 'object') {

[NoCoverage] ArrowFunction
src/utils/multi-proxy.ts:11:41
     // @ts-ignore
     return (...args: any[]) => {
       const primaryReturn = primary.apply(primaryScope, args);
-      const shadowReturns = shadows.map((shadow, i) =>
-        (shadow as T & Function).apply(shadowScopes[i], args)
+      const shadowReturns = shadows.map(() => undefined
       );
       return createMultiProxy(

[NoCoverage] EqualityOperator
src/utils/multi-proxy.ts:20:7
       );
     };
   }
-  if (typeof primary === 'object') {
+  if (typeof primary !== 'object') {
     // @ts-ignore
     return new Proxy(primary as object, {

[NoCoverage] BlockStatement
src/utils/multi-proxy.ts:20:36
       );
     };
   }
-  if (typeof primary === 'object') {
-    // @ts-ignore
-    return new Proxy(primary as object, {
-      get(target, prop, receiver) {
-        return createMultiProxy(
-          [
-            Reflect.get(target, prop, receiver),
-            ...shadows.map((shadow) => Reflect.get(shadow as object, prop)),
-          ],
-          [primary, ...shadows]
-        );
-      },
-    });
-  }
+  if (typeof primary === 'object') {}
   return primary;
 }

[NoCoverage] BlockStatement
src/utils/multi-proxy.ts:23:35
   if (typeof primary === 'object') {
     // @ts-ignore
     return new Proxy(primary as object, {
-      get(target, prop, receiver) {
-        return createMultiProxy(
-          [
-            Reflect.get(target, prop, receiver),
-            ...shadows.map((shadow) => Reflect.get(shadow as object, prop)),
-          ],
-          [primary, ...shadows]
-        );
-      },
+      get(target, prop, receiver) {},
     });
   }

[NoCoverage] ArrowFunction
src/utils/multi-proxy.ts:27:28
         return createMultiProxy(
           [
             Reflect.get(target, prop, receiver),
-            ...shadows.map((shadow) => Reflect.get(shadow as object, prop)),
+            ...shadows.map(() => undefined),
           ],
           [primary, ...shadows]

[NoCoverage] ArrayDeclaration
src/utils/multi-proxy.ts:29:11
             Reflect.get(target, prop, receiver),
             ...shadows.map((shadow) => Reflect.get(shadow as object, prop)),
           ],
-          [primary, ...shadows]
+          []
         );
       },
