[Killed] BlockStatement
src/utils/pipeline.ts:17:5
       stages?: (['map', MapFunc<any, any>] | ['filter', FilterFunc<any>])[];
       limit?: number;
     } = {}
-  ) {
-    this.stages = stages ?? [];
-    this.limit = limit ?? Infinity;
-  }
+  ) {}
 
   map<O>(mapFunc: MapFunc<T, O>) {
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'concat')

[Killed] LogicalOperator
src/utils/pipeline.ts:18:19
       limit?: number;
     } = {}
   ) {
-    this.stages = stages ?? [];
+    this.stages = stages && [];
     this.limit = limit ?? Infinity;
   }
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'concat')

[Killed] LogicalOperator
src/utils/pipeline.ts:19:18
     } = {}
   ) {
     this.stages = stages ?? [];
-    this.limit = limit ?? Infinity;
+    this.limit = limit && Infinity;
   }
 
killedBy: subscriptions handles order and limit
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/utils/pipeline.ts:22:34
     this.limit = limit ?? Infinity;
   }
 
-  map<O>(mapFunc: MapFunc<T, O>) {
-    // @ts-ignore not sure about best to store type info about original source
-    return new Pipeline<O>(this.source, {
-      stages: this.stages.concat([['map', mapFunc]]),
-      limit: this.limit,
-    });
-  }
+  map<O>(mapFunc: MapFunc<T, O>) {}
 
   tap(tapFunc: (item: T, index: number) => Promise<void> | void) {
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] ArrayDeclaration
src/utils/pipeline.ts:25:35
   map<O>(mapFunc: MapFunc<T, O>) {
     // @ts-ignore not sure about best to store type info about original source
     return new Pipeline<O>(this.source, {
-      stages: this.stages.concat([['map', mapFunc]]),
+      stages: this.stages.concat([[]]),
       limit: this.limit,
     });
killedBy: Database API supports basic queries with filters
statusReason: object is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] StringLiteral
src/utils/pipeline.ts:25:36
   map<O>(mapFunc: MapFunc<T, O>) {
     // @ts-ignore not sure about best to store type info about original source
     return new Pipeline<O>(this.source, {
-      stages: this.stages.concat([['map', mapFunc]]),
+      stages: this.stages.concat([["", mapFunc]]),
       limit: this.limit,
     });
killedBy: Database API supports basic queries with filters
statusReason: object is not iterable (cannot read property Symbol(Symbol.iterator))

[NoCoverage] BlockStatement
src/utils/pipeline.ts:30:66
     });
   }
 
-  tap(tapFunc: (item: T, index: number) => Promise<void> | void) {
-    return new Pipeline<T>(this.source, {
-      stages: this.stages.concat([
-        [
-          'map',
-          async (item, i) => {
-            await tapFunc(item, i);
-            return item;
-          },
-        ],
-      ]),
-      limit: this.limit,
-    });
-  }
+  tap(tapFunc: (item: T, index: number) => Promise<void> | void) {}
 
   filter(filterFunc: FilterFunc<T>) {

[NoCoverage] ArrayDeclaration
src/utils/pipeline.ts:33:9
   tap(tapFunc: (item: T, index: number) => Promise<void> | void) {
     return new Pipeline<T>(this.source, {
       stages: this.stages.concat([
-        [
-          'map',
-          async (item, i) => {
-            await tapFunc(item, i);
-            return item;
-          },
-        ],
+        [],
       ]),
       limit: this.limit,

[NoCoverage] StringLiteral
src/utils/pipeline.ts:34:11
     return new Pipeline<T>(this.source, {
       stages: this.stages.concat([
         [
-          'map',
+          "",
           async (item, i) => {
             await tapFunc(item, i);

[NoCoverage] BlockStatement
src/utils/pipeline.ts:35:30
       stages: this.stages.concat([
         [
           'map',
-          async (item, i) => {
-            await tapFunc(item, i);
-            return item;
-          },
+          async (item, i) => {},
         ],
       ]),

[Killed] BlockStatement
src/utils/pipeline.ts:45:37
     });
   }
 
-  filter(filterFunc: FilterFunc<T>) {
-    return new Pipeline<T>(this.source, {
-      stages: this.stages.concat([['filter', filterFunc]]),
-      limit: this.limit,
-    });
-  }
+  filter(filterFunc: FilterFunc<T>) {}
 
   take(limit: number) {
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ObjectLiteral
src/utils/pipeline.ts:46:41
   }
 
   filter(filterFunc: FilterFunc<T>) {
-    return new Pipeline<T>(this.source, {
-      stages: this.stages.concat([['filter', filterFunc]]),
-      limit: this.limit,
-    });
+    return new Pipeline<T>(this.source, {});
   }
 
killedBy: Database API supports basic queries with filters
statusReason: object is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ArrayDeclaration
src/utils/pipeline.ts:47:35
 
   filter(filterFunc: FilterFunc<T>) {
     return new Pipeline<T>(this.source, {
-      stages: this.stages.concat([['filter', filterFunc]]),
+      stages: this.stages.concat([[]]),
       limit: this.limit,
     });
killedBy: Database API supports basic queries with filters
statusReason: expected 4 to be 2 // Object.is equality

[Killed] BlockStatement
src/utils/pipeline.ts:52:23
     });
   }
 
-  take(limit: number) {
-    return new Pipeline<T>(this.source, {
-      stages: this.stages,
-      limit,
-    });
-  }
+  take(limit: number) {}
 
   async toArray(): Promise<T[]> {
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'toArray')

[Killed] MethodExpression
src/utils/pipeline.ts:61:19
 
   async toArray(): Promise<T[]> {
     let result = [];
-    const limit = Math.min(this.source.length ?? Infinity, this.limit);
+    const limit = Math.max(this.source.length ?? Infinity, this.limit);
     itemLoop: for (let i = 0; i < this.source.length; i++) {
       let item = this.source[i];
killedBy: subscriptions handles order and limit
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] LogicalOperator
src/utils/pipeline.ts:61:28
 
   async toArray(): Promise<T[]> {
     let result = [];
-    const limit = Math.min(this.source.length ?? Infinity, this.limit);
+    const limit = Math.min(this.source.length && Infinity, this.limit);
     itemLoop: for (let i = 0; i < this.source.length; i++) {
       let item = this.source[i];

[Killed] UpdateOperator
src/utils/pipeline.ts:62:55
   async toArray(): Promise<T[]> {
     let result = [];
     const limit = Math.min(this.source.length ?? Infinity, this.limit);
-    itemLoop: for (let i = 0; i < this.source.length; i++) {
+    itemLoop: for (let i = 0; i < this.source.length; i--) {
       let item = this.source[i];
       stageLoop: for (const stage of this.stages) {
killedBy: Database API supports basic queries with filters
statusReason: Cannot destructure property 'id' of 'undefined' as it is undefined.

[Killed] ConditionalExpression
src/utils/pipeline.ts:62:31
   async toArray(): Promise<T[]> {
     let result = [];
     const limit = Math.min(this.source.length ?? Infinity, this.limit);
-    itemLoop: for (let i = 0; i < this.source.length; i++) {
+    itemLoop: for (let i = 0; false; i++) {
       let item = this.source[i];
       stageLoop: for (const stage of this.stages) {
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/utils/pipeline.ts:64:51
     const limit = Math.min(this.source.length ?? Infinity, this.limit);
     itemLoop: for (let i = 0; i < this.source.length; i++) {
       let item = this.source[i];
-      stageLoop: for (const stage of this.stages) {
-        const [stageType, func] = stage;
-        if (stageType === 'map') {
-          item = await func(item, i);
-          continue;
-        }
-        if (stageType === 'filter') {
-          if (await func(item, i)) {
-            continue stageLoop;
-          } else {
-            continue itemLoop;
-          }
-        }
-      }
+      stageLoop: for (const stage of this.stages) {}
       result.push(item);
       if (result.length >= limit) {
killedBy: Database API supports basic queries with filters
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/utils/pipeline.ts:66:13
       let item = this.source[i];
       stageLoop: for (const stage of this.stages) {
         const [stageType, func] = stage;
-        if (stageType === 'map') {
+        if (false) {
           item = await func(item, i);
           continue;
killedBy: Database API supports basic queries with filters
statusReason: object is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] EqualityOperator
src/utils/pipeline.ts:66:13
       let item = this.source[i];
       stageLoop: for (const stage of this.stages) {
         const [stageType, func] = stage;
-        if (stageType === 'map') {
+        if (stageType !== 'map') {
           item = await func(item, i);
           continue;
killedBy: Database API supports basic queries with filters
statusReason: object is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
src/utils/pipeline.ts:70:37
           item = await func(item, i);
           continue;
         }
-        if (stageType === 'filter') {
-          if (await func(item, i)) {
-            continue stageLoop;
-          } else {
-            continue itemLoop;
-          }
-        }
+        if (stageType === 'filter') {}
       }
       result.push(item);
killedBy: Database API supports basic queries with filters
statusReason: expected 4 to be 2 // Object.is equality

[Killed] EqualityOperator
src/utils/pipeline.ts:70:13
           item = await func(item, i);
           continue;
         }
-        if (stageType === 'filter') {
+        if (stageType !== 'filter') {
           if (await func(item, i)) {
             continue stageLoop;
killedBy: Database API supports basic queries with filters
statusReason: expected 4 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/utils/pipeline.ts:71:15
           continue;
         }
         if (stageType === 'filter') {
-          if (await func(item, i)) {
+          if (false) {
             continue stageLoop;
           } else {
killedBy: Database API supports basic queries with filters
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/utils/pipeline.ts:71:15
           continue;
         }
         if (stageType === 'filter') {
-          if (await func(item, i)) {
+          if (true) {
             continue stageLoop;
           } else {
killedBy: Database API supports basic queries with filters
statusReason: expected 4 to be 2 // Object.is equality

[Killed] BlockStatement
src/utils/pipeline.ts:73:18
         if (stageType === 'filter') {
           if (await func(item, i)) {
             continue stageLoop;
-          } else {
-            continue itemLoop;
-          }
+          } else {}
         }
       }
killedBy: Database API supports basic queries with filters
statusReason: expected 4 to be 2 // Object.is equality

[Killed] BlockStatement
src/utils/pipeline.ts:79:35
         }
       }
       result.push(item);
-      if (result.length >= limit) {
-        break itemLoop;
-      }
+      if (result.length >= limit) {}
     }
     return result;
killedBy: subscriptions handles order and limit
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
src/utils/pipeline.ts:79:11
         }
       }
       result.push(item);
-      if (result.length >= limit) {
+      if (result.length < limit) {
         break itemLoop;
       }
killedBy: Database API supports basic queries with filters
statusReason: expected 1 to be 2 // Object.is equality
