[Killed] BlockStatement
src/utils.ts:9:55
 export function objectToTuples(
   object: any,
   prefix: (string | number)[] = []
-): [...(string | number)[], number | string | null][] {
-  if (object == null || typeof object !== 'object') {
-    return [[...prefix, object as string | number | null]];
-  }
-  // Maybe we support Maps in the future, for now this is secretly a helper for Sets
-  if (object instanceof Map) {
-    return [...object.entries()].flatMap(([key, val]) =>
-      objectToTuples(val, [...prefix, key])
-    );
-  }
-  if (object instanceof Set) {
-    const normalizedObj = SetType.fromJSON(object);
-    return objectToTuples(normalizedObj, prefix);
-  }
-  if (object instanceof Array) {
-    return object.flatMap((val, i) => objectToTuples(val, [...prefix, i]));
-  }
-  return Object.keys(object).flatMap((key) =>
-    objectToTuples(object[key], [...prefix, key])
-  );
-}
+): [...(string | number)[], number | string | null][] {}
 
 export function pathValsToObj(pathVals: any[][]) {
killedBy: schema triple-store defining a store with a schema should store schema; Database API can furnish the client id
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] LogicalOperator
src/utils.ts:10:7
   object: any,
   prefix: (string | number)[] = []
 ): [...(string | number)[], number | string | null][] {
-  if (object == null || typeof object !== 'object') {
+  if (object == null && typeof object !== 'object') {
     return [[...prefix, object as string | number | null]];
   }
killedBy: Database API can furnish the client id; schema triple-store defining a store with a schema should store schema
statusReason: Maximum call stack size exceeded

[Killed] BlockStatement
src/utils.ts:10:53
   object: any,
   prefix: (string | number)[] = []
 ): [...(string | number)[], number | string | null][] {
-  if (object == null || typeof object !== 'object') {
-    return [[...prefix, object as string | number | null]];
-  }
+  if (object == null || typeof object !== 'object') {}
   // Maybe we support Maps in the future, for now this is secretly a helper for Sets
   if (object instanceof Map) {
killedBy: schema triple-store defining a store with a schema should store schema; Database API can furnish the client id
statusReason: Maximum call stack size exceeded

[Killed] BlockStatement
src/utils.ts:14:30
     return [[...prefix, object as string | number | null]];
   }
   // Maybe we support Maps in the future, for now this is secretly a helper for Sets
-  if (object instanceof Map) {
-    return [...object.entries()].flatMap(([key, val]) =>
-      objectToTuples(val, [...prefix, key])
-    );
-  }
+  if (object instanceof Map) {}
   if (object instanceof Set) {
     const normalizedObj = SetType.fromJSON(object);
killedBy: Set operations can add to set
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
src/utils.ts:14:7
     return [[...prefix, object as string | number | null]];
   }
   // Maybe we support Maps in the future, for now this is secretly a helper for Sets
-  if (object instanceof Map) {
+  if (false) {
     return [...object.entries()].flatMap(([key, val]) =>
       objectToTuples(val, [...prefix, key])
killedBy: Set operations can add to set
statusReason: Cannot convert undefined or null to object

[Killed] ArrowFunction
src/utils.ts:15:42
   }
   // Maybe we support Maps in the future, for now this is secretly a helper for Sets
   if (object instanceof Map) {
-    return [...object.entries()].flatMap(([key, val]) =>
-      objectToTuples(val, [...prefix, key])
+    return [...object.entries()].flatMap(() => undefined
     );
   }
killedBy: Set operations can add to set
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/utils.ts:19:30
       objectToTuples(val, [...prefix, key])
     );
   }
-  if (object instanceof Set) {
-    const normalizedObj = SetType.fromJSON(object);
-    return objectToTuples(normalizedObj, prefix);
-  }
+  if (object instanceof Set) {}
   if (object instanceof Array) {
     return object.flatMap((val, i) => objectToTuples(val, [...prefix, i]));
killedBy: Set operations can add to set
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
src/utils.ts:19:7
       objectToTuples(val, [...prefix, key])
     );
   }
-  if (object instanceof Set) {
+  if (false) {
     const normalizedObj = SetType.fromJSON(object);
     return objectToTuples(normalizedObj, prefix);
killedBy: Set operations can add to set
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
src/utils.ts:23:7
     const normalizedObj = SetType.fromJSON(object);
     return objectToTuples(normalizedObj, prefix);
   }
-  if (object instanceof Array) {
+  if (true) {
     return object.flatMap((val, i) => objectToTuples(val, [...prefix, i]));
   }
killedBy: Database API can furnish the client id; schema triple-store defining a store with a schema should store schema
statusReason: object.flatMap is not a function

[Survived] ConditionalExpression
src/utils.ts:23:7
     const normalizedObj = SetType.fromJSON(object);
     return objectToTuples(normalizedObj, prefix);
   }
-  if (object instanceof Array) {
+  if (false) {
     return object.flatMap((val, i) => objectToTuples(val, [...prefix, i]));
   }

[Killed] ArrowFunction
src/utils.ts:24:27
     return objectToTuples(normalizedObj, prefix);
   }
   if (object instanceof Array) {
-    return object.flatMap((val, i) => objectToTuples(val, [...prefix, i]));
+    return object.flatMap(() => undefined);
   }
   return Object.keys(object).flatMap((key) =>
killedBy: Database API can furnish the client id
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/utils.ts:26:38
   if (object instanceof Array) {
     return object.flatMap((val, i) => objectToTuples(val, [...prefix, i]));
   }
-  return Object.keys(object).flatMap((key) =>
-    objectToTuples(object[key], [...prefix, key])
+  return Object.keys(object).flatMap(() => undefined
   );
 }
killedBy: Database API can furnish the client id; schema triple-store defining a store with a schema should store schema
statusReason: Cannot read properties of undefined (reading 'length')

[NoCoverage] BlockStatement
src/utils.ts:31:50
   );
 }
 
-export function pathValsToObj(pathVals: any[][]) {
-  return pathVals.reduce(updateObjWithPathVal, {});
-}
+export function pathValsToObj(pathVals: any[][]) {}
 
 function updateObjWithPathVal(obj: any, pathVal: any[]) {

[NoCoverage] MethodExpression
src/utils.ts:36:17
 }
 
 function updateObjWithPathVal(obj: any, pathVal: any[]) {
-  const paths = pathVal.slice(0, -1);
+  const paths = pathVal;
   const value = pathVal.at(-1);
   let scope = obj;

[NoCoverage] UnaryOperator
src/utils.ts:36:34
 }
 
 function updateObjWithPathVal(obj: any, pathVal: any[]) {
-  const paths = pathVal.slice(0, -1);
+  const paths = pathVal.slice(0, +1);
   const value = pathVal.at(-1);
   let scope = obj;

[NoCoverage] UnaryOperator
src/utils.ts:37:28
 
 function updateObjWithPathVal(obj: any, pathVal: any[]) {
   const paths = pathVal.slice(0, -1);
-  const value = pathVal.at(-1);
+  const value = pathVal.at(+1);
   let scope = obj;
   for (let i = 0; i < paths.length; i++) {

[NoCoverage] BlockStatement
src/utils.ts:39:42
   const paths = pathVal.slice(0, -1);
   const value = pathVal.at(-1);
   let scope = obj;
-  for (let i = 0; i < paths.length; i++) {
-    const key = paths[i];
-    if (i === paths.length - 1) {
-      scope[key] = value;
-      continue;
-    }
-    // if key already exists just update scope
-    if (scope[key] !== undefined) {
-      scope = scope[key];
-      continue;
-    }
-    const nextKey = paths[i + 1];
-    // heuristic for is an array
-    if (nextKey === 0) {
-      scope[key] = [];
-    } else {
-      scope[key] = {};
-    }
-    scope = scope[key];
-  }
+  for (let i = 0; i < paths.length; i++) {}
   return obj;
 }

[NoCoverage] UpdateOperator
src/utils.ts:39:37
   const paths = pathVal.slice(0, -1);
   const value = pathVal.at(-1);
   let scope = obj;
-  for (let i = 0; i < paths.length; i++) {
+  for (let i = 0; i < paths.length; i--) {
     const key = paths[i];
     if (i === paths.length - 1) {

[NoCoverage] ConditionalExpression
src/utils.ts:41:9
   let scope = obj;
   for (let i = 0; i < paths.length; i++) {
     const key = paths[i];
-    if (i === paths.length - 1) {
+    if (false) {
       scope[key] = value;
       continue;

[NoCoverage] BlockStatement
src/utils.ts:41:33
   let scope = obj;
   for (let i = 0; i < paths.length; i++) {
     const key = paths[i];
-    if (i === paths.length - 1) {
-      scope[key] = value;
-      continue;
-    }
+    if (i === paths.length - 1) {}
     // if key already exists just update scope
     if (scope[key] !== undefined) {

[NoCoverage] ConditionalExpression
src/utils.ts:46:9
       continue;
     }
     // if key already exists just update scope
-    if (scope[key] !== undefined) {
+    if (true) {
       scope = scope[key];
       continue;

[NoCoverage] ConditionalExpression
src/utils.ts:46:9
       continue;
     }
     // if key already exists just update scope
-    if (scope[key] !== undefined) {
+    if (false) {
       scope = scope[key];
       continue;

[NoCoverage] ArithmeticOperator
src/utils.ts:50:27
       scope = scope[key];
       continue;
     }
-    const nextKey = paths[i + 1];
+    const nextKey = paths[i - 1];
     // heuristic for is an array
     if (nextKey === 0) {

[NoCoverage] ConditionalExpression
src/utils.ts:52:9
     }
     const nextKey = paths[i + 1];
     // heuristic for is an array
-    if (nextKey === 0) {
+    if (false) {
       scope[key] = [];
     } else {

[NoCoverage] BlockStatement
src/utils.ts:52:24
     }
     const nextKey = paths[i + 1];
     // heuristic for is an array
-    if (nextKey === 0) {
-      scope[key] = [];
-    } else {
+    if (nextKey === 0) {} else {
       scope[key] = {};
     }

[NoCoverage] BlockStatement
src/utils.ts:54:12
     // heuristic for is an array
     if (nextKey === 0) {
       scope[key] = [];
-    } else {
-      scope[key] = {};
-    }
+    } else {}
     scope = scope[key];
   }

[Killed] BlockStatement
src/utils.ts:62:65
   return obj;
 }
 
-export function triplesToObject<T>(triples: TuplePrefix<EAV>[]) {
-  const result: any = {};
-  for (const [e, a, v] of triples) {
-    if (!result[e]) result[e] = {};
-    a.reduce((acc, curr, i) => {
-      if (i === a.length - 1) {
-        acc[curr] = v;
-        return acc;
-      }
-      if (!acc[curr]) acc[curr] = {};
-      return acc[curr];
-    }, result[e]);
-  }
-  return result as T;
-}
+export function triplesToObject<T>(triples: TuplePrefix<EAV>[]) {}
 
killedBy: schema triple-store defining a store with a schema should store schema; Set operations can add to set
statusReason: Cannot read properties of undefined (reading '_schema')

[Killed] BlockStatement
src/utils.ts:64:36
 
 export function triplesToObject<T>(triples: TuplePrefix<EAV>[]) {
   const result: any = {};
-  for (const [e, a, v] of triples) {
-    if (!result[e]) result[e] = {};
-    a.reduce((acc, curr, i) => {
-      if (i === a.length - 1) {
-        acc[curr] = v;
-        return acc;
-      }
-      if (!acc[curr]) acc[curr] = {};
-      return acc[curr];
-    }, result[e]);
-  }
+  for (const [e, a, v] of triples) {}
   return result as T;
 }
killedBy: DurableClock initializes with persisted clock if available
statusReason: Cannot read properties of undefined (reading 'tick')

[Killed] BooleanLiteral
src/utils.ts:65:9
 export function triplesToObject<T>(triples: TuplePrefix<EAV>[]) {
   const result: any = {};
   for (const [e, a, v] of triples) {
-    if (!result[e]) result[e] = {};
+    if (result[e]) result[e] = {};
     a.reduce((acc, curr, i) => {
       if (i === a.length - 1) {
killedBy: DurableClock initializes with persisted clock if available
statusReason: Cannot set properties of undefined (setting 'clientId')

[Killed] ConditionalExpression
src/utils.ts:65:9
 export function triplesToObject<T>(triples: TuplePrefix<EAV>[]) {
   const result: any = {};
   for (const [e, a, v] of triples) {
-    if (!result[e]) result[e] = {};
+    if (true) result[e] = {};
     a.reduce((acc, curr, i) => {
       if (i === a.length - 1) {
killedBy: DurableClock initializes with persisted clock if available
statusReason: expected undefined to be 'alice' // Object.is equality

[Killed] BlockStatement
src/utils.ts:66:32
   const result: any = {};
   for (const [e, a, v] of triples) {
     if (!result[e]) result[e] = {};
-    a.reduce((acc, curr, i) => {
-      if (i === a.length - 1) {
-        acc[curr] = v;
-        return acc;
-      }
-      if (!acc[curr]) acc[curr] = {};
-      return acc[curr];
-    }, result[e]);
+    a.reduce((acc, curr, i) => {}, result[e]);
   }
   return result as T;
killedBy: DurableClock initializes with persisted clock if available
statusReason: expected undefined to be 15 // Object.is equality

[Killed] ConditionalExpression
src/utils.ts:67:11
   for (const [e, a, v] of triples) {
     if (!result[e]) result[e] = {};
     a.reduce((acc, curr, i) => {
-      if (i === a.length - 1) {
+      if (false) {
         acc[curr] = v;
         return acc;
killedBy: Set operations can add to set; DurableClock initializes with persisted clock if available
statusReason: Invalid type: [object Object]

[Killed] BlockStatement
src/utils.ts:67:31
   for (const [e, a, v] of triples) {
     if (!result[e]) result[e] = {};
     a.reduce((acc, curr, i) => {
-      if (i === a.length - 1) {
-        acc[curr] = v;
-        return acc;
-      }
+      if (i === a.length - 1) {}
       if (!acc[curr]) acc[curr] = {};
       return acc[curr];
killedBy: Set operations can add to set; schema triple-store defining a store with a schema should store schema; DurableClock initializes with persisted clock if available
statusReason: Invalid type: [object Object]

[Killed] ConditionalExpression
src/utils.ts:71:11
         acc[curr] = v;
         return acc;
       }
-      if (!acc[curr]) acc[curr] = {};
+      if (false) acc[curr] = {};
       return acc[curr];
     }, result[e]);
killedBy: schema triple-store defining a store with a schema should store schema; Set operations can add to set
statusReason: Cannot read properties of undefined (reading 'Task')

[Killed] ConditionalExpression
src/utils.ts:71:11
         acc[curr] = v;
         return acc;
       }
-      if (!acc[curr]) acc[curr] = {};
+      if (true) acc[curr] = {};
       return acc[curr];
     }, result[e]);
killedBy: schema changes can add a collection definition to the schema
statusReason: expected { …(1) } to have property "id"
