[Killed] BlockStatement
src/clocks/memory-clock.ts:9:78
 export class MemoryClock implements Clock {
   clientId: string;
   tick: number;
-  constructor({ clientId, tick }: { clientId?: string; tick?: number } = {}) {
-    this.clientId = clientId ?? nanoid();
-    this.tick = tick ?? 0;
-  }
+  constructor({ clientId, tick }: { clientId?: string; tick?: number } = {}) {}
 
   async assignToStore(store: TripleStore): Promise<void> {
killedBy: Database API can furnish the client id
statusReason: Unknown value type: undefined

[Killed] LogicalOperator
src/clocks/memory-clock.ts:10:21
   clientId: string;
   tick: number;
   constructor({ clientId, tick }: { clientId?: string; tick?: number } = {}) {
-    this.clientId = clientId ?? nanoid();
+    this.clientId = clientId && nanoid();
     this.tick = tick ?? 0;
   }
killedBy: Database API can furnish the client id; mutating triple values from the store can set the value of a triple
statusReason: Unknown value type: undefined

[Killed] LogicalOperator
src/clocks/memory-clock.ts:11:17
   tick: number;
   constructor({ clientId, tick }: { clientId?: string; tick?: number } = {}) {
     this.clientId = clientId ?? nanoid();
-    this.tick = tick ?? 0;
+    this.tick = tick && 0;
   }
 
killedBy: Register operations can set register; mutating triple values from the store can set the value of a triple
statusReason: expected Map{} to have a size of +0 but got 1

[Survived] BlockStatement
src/clocks/memory-clock.ts:14:58
     this.tick = tick ?? 0;
   }
 
-  async assignToStore(store: TripleStore): Promise<void> {
-    const maxTs = await store.findMaxTimestamp(this.clientId);
-    if (maxTs) this.setTick(maxTs[0]);
-    store.onInsert((triples) => {
-      triples.forEach(({ timestamp }) => {
-        if (this.tick < timestamp[0]) this.setTick(timestamp[0]);
-      });
-    });
-  }
+  async assignToStore(store: TripleStore): Promise<void> {}
 
   getCurrentTimestamp(): Promise<Timestamp> {

[Survived] ConditionalExpression
src/clocks/memory-clock.ts:16:9
 
   async assignToStore(store: TripleStore): Promise<void> {
     const maxTs = await store.findMaxTimestamp(this.clientId);
-    if (maxTs) this.setTick(maxTs[0]);
+    if (false) this.setTick(maxTs[0]);
     store.onInsert((triples) => {
       triples.forEach(({ timestamp }) => {

[Survived] BlockStatement
src/clocks/memory-clock.ts:17:33
   async assignToStore(store: TripleStore): Promise<void> {
     const maxTs = await store.findMaxTimestamp(this.clientId);
     if (maxTs) this.setTick(maxTs[0]);
-    store.onInsert((triples) => {
-      triples.forEach(({ timestamp }) => {
-        if (this.tick < timestamp[0]) this.setTick(timestamp[0]);
-      });
-    });
+    store.onInsert((triples) => {});
   }
 

[Survived] BlockStatement
src/clocks/memory-clock.ts:18:42
     const maxTs = await store.findMaxTimestamp(this.clientId);
     if (maxTs) this.setTick(maxTs[0]);
     store.onInsert((triples) => {
-      triples.forEach(({ timestamp }) => {
-        if (this.tick < timestamp[0]) this.setTick(timestamp[0]);
-      });
+      triples.forEach(({ timestamp }) => {});
     });
   }

[Killed] EqualityOperator
src/clocks/memory-clock.ts:19:13
     if (maxTs) this.setTick(maxTs[0]);
     store.onInsert((triples) => {
       triples.forEach(({ timestamp }) => {
-        if (this.tick < timestamp[0]) this.setTick(timestamp[0]);
+        if (this.tick >= timestamp[0]) this.setTick(timestamp[0]);
       });
     });
killedBy: mutating triple values from the store can set the value of a triple
statusReason: expected 'value' to be 'new-value' // Object.is equality

[Survived] ConditionalExpression
src/clocks/memory-clock.ts:19:13
     if (maxTs) this.setTick(maxTs[0]);
     store.onInsert((triples) => {
       triples.forEach(({ timestamp }) => {
-        if (this.tick < timestamp[0]) this.setTick(timestamp[0]);
+        if (true) this.setTick(timestamp[0]);
       });
     });

[Killed] BlockStatement
src/clocks/memory-clock.ts:24:45
     });
   }
 
-  getCurrentTimestamp(): Promise<Timestamp> {
-    return new Promise((res) => res([this.tick, this.clientId]));
-  }
+  getCurrentTimestamp(): Promise<Timestamp> {}
 
   // Relying on something else to push the clock forward on triple confirmation
killedBy: Database API can furnish the client id
statusReason: Cannot read properties of undefined (reading '1')

[Killed] ArrowFunction
src/clocks/memory-clock.ts:25:24
   }
 
   getCurrentTimestamp(): Promise<Timestamp> {
-    return new Promise((res) => res([this.tick, this.clientId]));
+    return new Promise(() => undefined);
   }
 
killedBy: Database API can furnish the client id
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/clocks/memory-clock.ts:32:42
   // I think things being sync keeps some weird sitatuions from happening
   // An atomic transaction with multiple changes to the same attribute may not work because they might be assigned the same clock
   // Ex. the document API assigned the same clock to changes (but the attributes are all different)
-  getNextTimestamp(): Promise<Timestamp> {
-    const nextTimestamp = [++this.tick, this.clientId] as [number, string];
-    return new Promise((res) => res(nextTimestamp));
-  }
+  getNextTimestamp(): Promise<Timestamp> {}
 
   setTick(tick: number): Promise<void> {
killedBy: Database API can furnish the client id; mutating triple values from the store can set the value of a triple
statusReason: Cannot read properties of undefined (reading '1')

[Timeout] ArrowFunction
src/clocks/memory-clock.ts:34:24
   // Ex. the document API assigned the same clock to changes (but the attributes are all different)
   getNextTimestamp(): Promise<Timestamp> {
     const nextTimestamp = [++this.tick, this.clientId] as [number, string];
-    return new Promise((res) => res(nextTimestamp));
+    return new Promise(() => undefined);
   }
 

[Survived] BlockStatement
src/clocks/memory-clock.ts:37:40
     return new Promise((res) => res(nextTimestamp));
   }
 
-  setTick(tick: number): Promise<void> {
-    this.tick = tick;
-    return new Promise((res) => res());
-  }
+  setTick(tick: number): Promise<void> {}
 }
 

[Survived] ArrowFunction
src/clocks/memory-clock.ts:39:24
 
   setTick(tick: number): Promise<void> {
     this.tick = tick;
-    return new Promise((res) => res());
+    return new Promise(() => undefined);
   }
 }
