[Killed] BlockStatement
src/crdt/register.ts:5:72
 import { Value } from '../triple-store';
 
 //operations
-export async function set(tx: UpdateMutationTransaction, value: Value) {
-  const { transactor, entity, attribute } = tx;
-  return transactor.setValue(entity, attribute, value);
-}
+export async function set(tx: UpdateMutationTransaction, value: Value) {}
 
killedBy: Register operations can set register
statusReason: expected Map{} to have a size of +0 but got 1
