[Killed] BlockStatement
src/crdt/set.ts:6:72
 import { UpdateMutationTransaction } from '../mutation';
 
 //operations
-export async function add(tx: UpdateMutationTransaction, value: Value) {
-  const { transactor, entity, attribute } = tx;
-  const partialTriples = SetType.operations.add(value);
-  const newTriples = partialTriples.map<[EntityId, Attribute, Value]>(
-    ([attr, val]) => {
-      return [entity, [...attribute, ...attr], val];
-    }
-  );
-  for (const newTriple of newTriples) {
-    return transactor.setValue(...newTriple);
-  }
-}
+export async function add(tx: UpdateMutationTransaction, value: Value) {}
 
 export async function remove(tx: UpdateMutationTransaction, value: Value) {
killedBy: Set operations can add to set
statusReason: expected Map{} to have a size of 1 but got +0

[Killed] BlockStatement
src/crdt/set.ts:10:22
   const { transactor, entity, attribute } = tx;
   const partialTriples = SetType.operations.add(value);
   const newTriples = partialTriples.map<[EntityId, Attribute, Value]>(
-    ([attr, val]) => {
-      return [entity, [...attribute, ...attr], val];
-    }
+    ([attr, val]) => {}
   );
   for (const newTriple of newTriples) {
killedBy: Set operations can add to set
statusReason: newTriple is not iterable (cannot read property undefined)

[Killed] BlockStatement
src/crdt/set.ts:14:39
       return [entity, [...attribute, ...attr], val];
     }
   );
-  for (const newTriple of newTriples) {
-    return transactor.setValue(...newTriple);
-  }
+  for (const newTriple of newTriples) {}
 }
 
killedBy: Set operations can add to set
statusReason: expected Map{} to have a size of 1 but got +0

[Killed] BlockStatement
src/crdt/set.ts:19:75
   }
 }
 
-export async function remove(tx: UpdateMutationTransaction, value: Value) {
-  const { transactor, entity, attribute } = tx;
-  const partialTriples = SetType.operations.remove(value);
-  const newTriples = partialTriples.map<[EntityId, Attribute, Value]>(
-    ([attr, val]) => {
-      return [entity, [...attribute, ...attr], val];
-    }
-  );
-  for (const newTriple of newTriples) {
-    return transactor.setValue(...newTriple);
-  }
-}
+export async function remove(tx: UpdateMutationTransaction, value: Value) {}
 
killedBy: Set operations can remove from set
statusReason: expected Map{} to have a size of +0 but got 1
