[Killed] BlockStatement
src/utils/builder.ts:7:77
 
 // TODO: add allowed methods to the builder to throw runtime errors
 // when calling non-defined methods (i.e. query paramters for collectionQuery)
-export default function Builder<T extends Object>(initial: T): toBuilder<T> {
-  const data = initial;
-  return new Proxy({} as toBuilder<T>, {
-    get: (_target, name) => {
-      if (name === 'build') {
-        return () => data;
-      }
-      return (newVal: any) => {
-        return Builder({ ...data, [name]: newVal });
-      };
-    },
-  });
-}
+export default function Builder<T extends Object>(initial: T): toBuilder<T> {}
 
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'where')

[Killed] BlockStatement
src/utils/builder.ts:10:29
 export default function Builder<T extends Object>(initial: T): toBuilder<T> {
   const data = initial;
   return new Proxy({} as toBuilder<T>, {
-    get: (_target, name) => {
-      if (name === 'build') {
-        return () => data;
-      }
-      return (newVal: any) => {
-        return Builder({ ...data, [name]: newVal });
-      };
-    },
+    get: (_target, name) => {},
   });
 }
killedBy: Database API supports basic queries with filters
statusReason: CollectionQueryBuilder(...).where is not a function

[Killed] BlockStatement
src/utils/builder.ts:11:29
   const data = initial;
   return new Proxy({} as toBuilder<T>, {
     get: (_target, name) => {
-      if (name === 'build') {
-        return () => data;
-      }
+      if (name === 'build') {}
       return (newVal: any) => {
         return Builder({ ...data, [name]: newVal });
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'split')

[Killed] ConditionalExpression
src/utils/builder.ts:11:11
   const data = initial;
   return new Proxy({} as toBuilder<T>, {
     get: (_target, name) => {
-      if (name === 'build') {
+      if (true) {
         return () => data;
       }
killedBy: Database API supports basic queries with filters
statusReason: CollectionQueryBuilder(...).where(...).build is not a function

[Killed] ArrowFunction
src/utils/builder.ts:12:16
   return new Proxy({} as toBuilder<T>, {
     get: (_target, name) => {
       if (name === 'build') {
-        return () => data;
+        return () => undefined;
       }
       return (newVal: any) => {
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'collectionName')

[Killed] BlockStatement
src/utils/builder.ts:14:31
       if (name === 'build') {
         return () => data;
       }
-      return (newVal: any) => {
-        return Builder({ ...data, [name]: newVal });
-      };
+      return (newVal: any) => {};
     },
   });
killedBy: Database API supports basic queries with filters
statusReason: Cannot read properties of undefined (reading 'build')
